{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H1kH6QZV7Le4zqTRNxoZow", "review_id": "RF6UnRTtG7tWMcrO2GEoAg", "text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 2, "date": "2010-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TCqjsTEPFLfjdCxI2Zq1WQ", "review_id": "Hm4bXkXC3098K49bG2lIYg", "text": "They charge more than the services they provide are worth.  Since they currently have a monopoly on cable tv in the madison area there is nothing anyone can do about it.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2008-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "QSRCc7ip7DqRnUT0gJ6q_g", "review_id": "Yp9-duCZtwUlrP8CXJwSxg", "text": "To be fair, I am not yet a customer, so I cannot rate the actual quality of their cable/internet.  That said, I have so no such qualms about revealing their absolutely HORRENDOUS customer service practices.\n\nI spoke to a representative yesterday to sign up for internet service at my new apartment.  I specifically asked the representative if there were any promotions currently available, in order to receive the best price possible.  He quoted me 39.99 as their only current promotion for basic internet (not including moden/router rentals, upgraded speed, etc.) Taking him at his word, I accepted, and scheduled an installation.  Thus begins the tale of woe:\n\n-------------------------------------------------------------\n-  Later that night, on the internet:  I see advertised in giant, bold, colorful letters, $24.99 for basic internet.  Just about half the price of the \"promotion\" the representative offered me.\n\n-  I call the representative line to find out what I was told a blatant lie (in nicer terms, of course).  He confirms the promotion is available, but he doesn't have authority to change me to that price. TRANSFER 1, TO SALES!\n\n- Sales also confirms the much cheaper promotion, but says it is an online-only offer, and she absolutely cannot give it to me:  I can only receive it online, and I will need to reschedule my installation.  TRANSFER 2, TO THE INTERNET!\n\n- The internet promotion finds my address alright, but instead of being able to sign up online, every time I reach the promotion page for my address, I receive the same error message:  \"Your session has timed out or encountered an error. Please start over or click the \"Back Button\" on your browser. If you still wish to contact us.\"  This occurs over 3 different computers and the same number of unique browsers.  TRANSFER 3, TO THE ONLINE-CHAT REPRESENTATIVE!\n\n-  Online chat confirms again that the service is available, but I cannot achieve it online, only over the phone.  Having just been told the *exact opposite*, i attempt to point out the circular logic there, but to no avail. Apparently, reducing my price to their own advertised offer would be considered \"downgrading\" a customer, and he is not allowed to do that. TRANSFER 4, TO THE PHONE REPRESENTATIVE (AGAIN)!\n\n-  The new phone representative tells me that as I am NOT a customer, she cannot help me at all.  Still loving the contradictions (the last one claimed that she could not downgrade customers, now I'm not even a customer?  Really?), I try to argue, but she claims sales needs to handle me, and transfers my call.  TRANSFER 5, TO SALES (AGAIN)!\n\n- And at this point, after another few minutes of lovely Charter advertisements and soothingly torturous elevator music, I am transferred to... a voice mail.  This proceeds to Inform me that the Sales Depts. hours are over, so please call back later, and then terminates the call.\n---------------------------------------------------\n\n\n3 fun filled hours of lies, contradictions, and a misinformation campaign that would dazzle ANY public figure later... absolutely nothing was accomplished, except a gigantic waste of my life and a review that will hopefully reveal these horrifying business practices to all those unsuspecting cable-seeking fellows on Yelp.\n\nBeware.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2009-01-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DVWIxcfkjxri5UruYABkrQ", "review_id": "PHcYOcb3Hf18FUPgysF-lQ", "text": "there should be a negative rating on here.  one star is way to high.\ni am sick and tired of how the cable box is never working their solution? KEEP RESETTING THE BOX... YES IT IS MY JOB TO MAKE SURE I GET MY SERIVCE ON A DAILY BASIS.  IT'S NOT THEIRS TO MAKE SURE IT WORK.  Plus they have poor customer service but I don't blame the people that answer the phones but the people who st the rules to nickel and dime it's customers. \n\ncharter is horrible and since i coudn't get thru to complain on the phone here is my truth.  Charter is the worst.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2010-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "BD4IhPuK-DwGBQb3RzQDcQ", "review_id": "Hdng63D9qvnT1says4LMMw", "text": "In my opinion, Charter Communications is just terrible.  They have been unreliable, unhelpful, rude and incapable of providing an acceptable level of service.  The customer service representatives are like talking to pre-programed robots, even in the midst of a prolonged service outage, their main goal is to sell more worthless services. Avoid this company like the plague.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k42CUkU9dxyCRDlcOfsVTw", "review_id": "6wYj80QHbOGbttDC0S3NkQ", "text": "Later in the night, not very crowded yet they insisted we sit crowded next to another pair of people.  Service was slow, just getting a drink was an effort.  Food was poorly prepared and over cooked, or as in my partners case cold.  No way coming back other than drinks in the summer.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2013-12-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "spPw301AwzOqN0nTGXqsKg", "review_id": "ZiZSCu1eQyZ21dHXpLjzzQ", "text": "It you're basic bar food.  Nothing more.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "yFdFgkJJLgKKrbp9sg1NFA", "text": "Do you like it when your bowels want to explode?  Then this is the place for you.  The sad thing is, the aroma coming from the restaurant is hypnotizing as it drifts through the neighborhood, and the staff is really nice, but holy jeebus, does the pizza suck.  Every time we went there we spent the rest of the night in the bathroom.  Awful.", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 1, "date": "2008-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "011Ny5tOdSs_ZI_EzILaRA", "review_id": "ugxo0iHxlK1nPo-rM15u0g", "text": "Awful, awful, awful...  The worst of the worst of the cookie-cutter Chinese restaurants.  Food without flavor, a menu without imagination and a staff of such profound indifference it's hard to tell they're even there.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 1, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "MQPvn-sKbAqLS4tNtb8t1Q", "review_id": "k23vlH_rM4IwmRFrVmCOdQ", "text": "Tried this because it's local.  Terrible, bland Chinese food.  Not much else to say.  Will never return.  My wife wanted me to mention her sweet and sour chicken, which was battered fried chicken pieces with a side of sauce in a bowl.  When she asked where the vegetables were (like the picture), she was told there is a piece of pineapple in the sauce and that is what comes with it.  As promised, we looked hard into the sauce and found one very small piece of pineapple.  Bon Appetite.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 1, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6UfRC8Sw8z7EcYPIWtl1ig", "review_id": "Kl5i17yln4ZQ9vd3gst39g", "text": "I gave two stars, 1 star for the nice behavior of owners who welcome you into the restaurant with a smile and another star is the ambiance and my kiddo loved it.\n\nWorst service. waitress (an Asian women) was very rude and made me feel like we are not welcome there. \n\nmy two cents, if you are not a white man, please find a Dennis or Perkins and don't even bother to go to this place. \n\nI never wrote a review as bad as this and this place deserves it.", "business_id": "j515klfbCAEF3KPiKvHz9g", "stars": 2, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vU4N-TaRwk5GtAc97_wx9A", "review_id": "7lM4JHh-gzw9uTx5Z-AJSw", "text": "Kind of makes me feel like I' inconveniencing them.  I get left so they can help others.  I don't mind waiting, but when its my turn, then I am the person that should get the help and the other people should be told to wait.", "business_id": "ImBOmnSOb1ajWskhQyaa4Q", "stars": 2, "date": "2013-12-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pABc641OSh-3QANyWPdu7Q", "review_id": "pyQm4tzzRKgSFNe38CqIgg", "text": "I'm 20 years old.  The last exam I had was when I was 17-18 at planned parenthood.  When you go into their offices for birth control they basically make you do an exam when you go in.  Well, I needed a new gynecologist and my boyfriend's mom recommended Central Phoenix OB/Gyn.  Since I hadn't gone to a professional before (besides planned parenthood) I thought I would give it a try.  The receptionist is VERY rude.  When we first got there we had to stand at the counter for 15 mins before she came out to give me my paperwork.  Her attitude isn't very welcoming, which is what pushed me away in the beginning.  First impressions are very important.  I had set an appointment with the Doctor, but come to find out that she wasn't in the office and they would have to schedule it with the NP (Nurse Practitioner).  I didn't get an exam like I was told, but she consulted me on my birth control and they took a STD test just so I could feel certain that I didn't have any.  They gave me a small discount for not being able to see the doctor ($185 Without insurance) and told me that they would contact me with the results from my test on Monday (a week from when I went).  Monday came and I got no calls.  I had another appointment scheduled not too far from then, so I decided to wait until I went back to the office.\n\nThe second visit I was scheduled with a doctor (that I did see that time) and was greeted by the oh so friendly receptionist.  I was told that they didn't have my test results (They LOST them) and that I would have to do another and they would take care of it.  They DIDN'T do any exam (AGAIN!) even though I was scheduled for it (I haven't had an exam for about 3 years now).  She just consulted me on the birth control and sent me on my way.  I had many questions, I have been having a lot of pain in my lower abdomen which is why I needed to be checked, and she just seemed to be rushing through all of them with no care.  I told her I was frequently urinating and I haven't been drinking a lot of water.  Her solution was that I was drinking a lot of water (I thought I just told her I didn't drink a lot) and that everything was fine.  I was a little frustrated, but that's fine.  I got to the front desk and I had to pay $250 for a consultation and no exam!  They called me a week later and I assumed it was for my results... NOPE.  They had \"forgotten\" to charge me, even though they told me since they screwed up the first time they would take care of it, and I had to pay another $250 for the lab!  That's ridiculous.\n\nThere are too many mistakes in this office for anyone to just overpass.\nI don't know if it's because I didn't have insurance, but they made me feel very unwelcome and like I couldn't afford anything in the office.\n\nPlanned Parenthood seems a lot more professional and welcoming... At least they give me an exam every time I go.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ilbenZXokpf4ezafuUH0xA", "review_id": "jsN-FlWzo09lAvaLsPdeBg", "text": "I am 25 years old. I just moved to the area from Philadelphia and was looking for a OBGYN. I do not recommend Central Phoenix! My experience was terrible. The receptionist was very rude over the phone, but I decided to give her the benefit of the doubt because maybe she was having a bad day. After making my appointment I received a call a few days later that it needed to be rescheduled because the doctor was taking that day off. The lady on the phone was not apologetic about the inconvenience as I had already planned to take the day we had arranged off from work. I had an appointment scheduled at 5:30 pm however due to bad traffic I was running late. I called to let them know and no one answered so I left a message. When I arrived the receptionist at the desk was rude again and told me that because I was  little late the doctor could not see me. I tried to explain that when I called no one answered and she again was rude and unapologetic. I am currently looking for another OBGYN.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "_HN8b3eZL423v8bQ7ACUXw", "text": "I can't seem to understand 'why' many people rate this as a first-class sports bar because in actuality, its one of the worst I've ever been in, and I grew up going to the sports books in Juarez, Mexico where their idea of a flat screen was a gabacho thumping the TV onto the sticky tile floor and looking cross at an hombre could get your eye cut out and fed to you as the special of the day.\n\nYes, Majerle's is worse.  \n\nOkay, well, no one in Thunder Dan's is gonna devour your soul, but the place makes me feel like I'm sharing a pint with Florentines Catello di Rosso Gianfigliazzi and Ciappo Ubriachi in Dante's inner ring of the seventh circle of Hell.\n\nThe set up is terrible.  The TVs are difficult to see from EVERYWHERE in the bar and they have it arranged so that if you are fortunate enough to view up to TWO SCREENS (!) at one time, they are both showing the same game.  This is a problem during major events like the NCAA tournament or bowl games.  \n\nMoreover, i would be kitten-hearted to ask a manager to change their programming to another game i'd rather watch.  \n\nThe bar is always crowded, which makes it even more wondrous for me when i actually go in there and wait for a seat just to encounter no beer specials and terrible food.\n\nI wonder how large the bowl of crack the editors at Sports Illustrated were smoking to rate this anywhere near the top 1,000 sports bars in the US.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2008-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "W3qwEhlI6aBjrsHaOiaaBw", "text": "Been here twice, and I cant say either time was a thrilling experience. One thing I can say as a plus is the bartenders at lunch are always friendly and quick. The food so, not so great. I can never eat it all, the portions are extremely generous, but it's never very high quality. Just kinda seems like it is coming from a slop kitchen, and not really fit for a human. The house margaritas are actually pretty good, and a fair value. I recommend hanging out with a margarita and some chips and salsa (also pretty good) and then moving elsewhere for dinner. Call me crazy, but restaurants that leave me feeling sluggish and greasy are never my favorites.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "lG3C1Agp5WnreOS-7R-r-g", "text": "Well, it's a Michaels. Nothing particularly special there. Normally, I'd give most Michaels stores 4stars, but this one tends to be a bit messy and has the wonkiest layout of any craft store. Also, if you pop in and don't find what you're looking for, you have to loop through ALL the checkouts to exit (not just pass by one like at most similar stores). This makes me feel a bit uncomfortable if they happen to not have what I'm looking for or if I just stop in to price something, etc. \n\nOverall, a decent place. Greenway Station on the whole is a bit of a weird shopping center, but I do love that a craft store is in the mix.", "business_id": "YDUB7-NgjKEFn8CERLoKXQ", "stars": 3, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e9ALO47DWQYlG4bICLy_yQ", "review_id": "2aXPEKQrrp0N1Vvcgpp_JQ", "text": "We have been shopping at this location since we moved into the neighborhood this past year. Copp's (the past year or two) has really gone down hill. We normally do our big shopping at Woodman's because it's cheaper. We'd go to this Copp's more but 1, the prices are higher MUCH higher than almost any place in Madison.\n\n Also they have a horrible time having things in stock. A lot of shelves are barely stocked (during the week even) and the signs in the frozen area are dumb, having lame pictures isn't helping me find products.  \n\nIf they updated a few things, had more things in stock and even regular items in stock I'd give a better rating. Also the parking lot is pretty dim/dark. Makes me feel unsafe.", "business_id": "ZjwZIQM4TfFO7T7ck7FtYQ", "stars": 2, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 2}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "X-bkFc7cjzlwjRV4QAkWUw", "text": "Zoinks.\nYou know how you drive by a place over and over and think... \"Man why haven't I tried that!\" Weeeeeeeeeeellllll it kills me to say but sometimes it's for the best. After tripping up and down Atwood for 5 months going from here to there, I finally bit the bullet and gave them a try. While the woman (owner I assume) helping me was lovely, the food was all Wong. Sorry. Bean sprout overload populated the chop suey (a safe choice I thought because its so standard), the eggroll lacked flavor outside of the peanut butter used to seal it and the egg foo young which was a guilty pleasure staple of carry out growing up made me feel GUILTY, like really guilty for consuming it. Oily and in an all too rich sauce, it just didn't jive with my belly. I'd say I will go back, but honestly I feel like I went pretty safe, pretty standard. I'd be afraid to try again and branch out.", "business_id": "uzJ2Vefb951El2oneQI8NQ", "stars": 2, "date": "2013-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WDGHEIPGtOfCXNFarC30qA", "review_id": "dzSc6HK1EmyEzY_JgLnnqw", "text": "I would not recommend Joyce for bridal alterations. First and foremost, she is not friendly at all. I put on my dress for the first time since I bought it at her store, and was so excited about it. She made me feel rushed and took away from the moment. Then, she charged me $200 for bad alterations, which I ultimately took to get fixed for $100 elsewhere.", "business_id": "smHuQzYNOkN2CHDjLG8KBA", "stars": 1, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 6, "useful": 4, "cool": 5}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "JMIJht7Q5GX_NSiSrTEOsA", "text": "The McManager sucks.  (he wouldn't run his store Safeway card for me!)\n\nThe debit/credit card swipers suck! (they don't fit in their holders and they must use a freakin' dialup modem they are so God Damn slow)\n\nThey once completely ran out of MILK!\n\nTheir change machine was down for well over a week!\n\nI swear to God, if  there were any alternative in the vicinity I'd GLADLY pay twice the price to shop there! \n\nRevamped store is nice to look at, shitty to shop at!  \n\nNow with free Wi-Fi! \n\nEAT ME!", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 1, "date": "2008-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IkC2BKzADqgPlvaac5gRHg", "review_id": "l_ebk788HDecd6__CHiJTg", "text": "Ugh - stopped in here before a Diamonbacks game and quickly left after a beer. It's tiny, cramped (but not in a fun, packed house kind of way), and so very dark. It was kind of a mood killer. They do have a patio but didn't have the misters on and weren't serving out there. With all the beautiful weather we get in Arizona, I hate being cooped up in dark small places.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2012-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "EZEYk3Mf51BtQzPeGE7h7A", "review_id": "qTgvfko7CmEeAdF2qYXFfQ", "text": "PASS...\n\nVery mediocre food when surrounded by a lot of great options.  I can't believe the food network came here?!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "oPwFc3ae4Rh8JT7xfumOVQ", "review_id": "yRziuUtFQPP8yHiAvJ5OdQ", "text": "Was told this is the best place in downtown Phoenix to catch a game. It's not. They play crappy music instead of the sound from games, food is typical sports bar junk, and drinks are expensive. On top of that the crowd is pretty crappy unless you like washed up jocks acting like they own the town. If that's your thing, this is your spot.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "REfQIccdKSVnEPr3Bnucwg", "review_id": "uAnAb1zL7Rjd2qyMrnfWVA", "text": "\"My vodka soda tastes like water. Lame.\" July 5th 2012\n\nYeah, this place was pretty mediocre...which says a lot considering how uninteresting Phoenix is at night.\n\nThe place was packed, the drinks were pricey, and the waitress made sure to let us know after we sat down that we had to go to the bar to order our drinks as she was off duty. And...my vodka soda tasted like water.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2012-12-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JRNFrfiiuHpWpZJgt6ERYw", "review_id": "ylQn6EQDkHbEvQaeSlCIOg", "text": "The only good part of this place was the welcoming hostess. after the waiting staff and managerial staff, the waitresses were horrible. I felt disrespected and unwelcomed once I entered the door. Managers were very disgruntled and unhelpful... Anissa and Amy's skills should be in question. As a military service member I have never felt more disrespected when visiting an establishment. I will never talk positive about this bar and grill.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "NszHFzBLd0mVQ776zck4DA", "review_id": "z5iOFmGvrY0aHEgi_jqS_w", "text": "Another dismal review for this company. I called for a 6 AM pickup to the airport like I had several times previously. Dispatch informed someone would arrive. I waited until 6:10 AM and called again-dispatch then told me another 15 minutes until pickup! I stated that was not acceptable as I had a flight to catch. I ended up driving myself to the airport. Oh yeah, the driver called, as boarding for my plane started.", "business_id": "yR3U7jOgoD0V0sGovuyt0Q", "stars": 1, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qrs3EICADUKNFoUq2iHStA", "review_id": "_ePLBPrkrf4bhyiKWEn4Qg", "text": "I don't know what Dr. Goldberg was like before  moving to Arizona, but let me tell you, STAY AWAY from this doctor and this office. I was going to Dr. Johnson before he left and Goldberg took over when Johnson left. He is not a caring doctor. He is only interested in the co-pay and having you come in for medication refills every month. He will not give refills and could less about patients's financial situations. Trying to get your 90 days mail away pharmacy prescriptions through this guy is a joke. And to make matters even worse, his office staff is incompetent. 90% of the time when you call the office, they'll put you through to a voice mail, that NO ONE ever answers or returns your call. Both my adult children and husband have decided to leave this practice after experiencing such frustration. The entire office has an attitude like they are doing you a favor. Give me a break! Stay away from this doc and the practice. You deserve better and they will not be there when you really need them. I have never felt compelled to write a bad review about anyone until I met this pathetic excuse for a doctor who is all about the money.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 1, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6ViJPCbqIAIq5HPy7anIEw", "review_id": "IaONpXIHNtIBrmMU668OdQ", "text": "Went here for lunch with two co-workers, checked Yelp before we went and the reviews were very positive so we decided to give it a try.\n\nYikes! How can the reviews be 4-5 stars and the service at best \"average\", the food was terrible and myself and my co-workers all agreed, this restaurant doesn't rate two stars.\n\nI had one of the special Friday offerings, Smelt. It came with a salad (very average but fresh), fries (ordinary) and the Smelt. After a 20-25 minute wait our server came with our orders. I looked at my plate and was shocked! There was 12-15 so-called Smelt about 3\" long and deep fried. They looked like little fat cigarettes! I bit into one and it was all batter, I tried another and it was the same. I had deep fried batter for lunch!!\nI haven't had a meal this bad since I got out of the Navy! \n\n My co-workes meals were not much better, one had Chicken Fried Steak and he said it was made out of the box. My other co-worker had the Cod and he said it was mushy and brown colored! YUK! \n\nI hate to write such a negative review but this restaurant earned \"one\" star. Maybe they have great breakfast! I hope they do because their lunches are sub-par. \n\nThere are other restaurants on this street/highway, I'd give them a try before I stopped here. I know my co-workers and I won't be coming back.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 1, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l6PKBSi09-Qi0v3T9IZwCw", "review_id": "by1vl1hP-gZMSn0ChXlGWA", "text": "My boyfriend and I came here to have breakfast after New Years. We weren't expecting much being not at our best either. \n\nThe service, as mentioned several times in yelp, is really slow. My drink was forgotten about and the next time our waitress came around she was serving our meal about 30-40 minutes from taking our order. The restaurant was probably half full of people. My boyfriends meal was mediocre \"at best\" as he put it but my meal was worse. My bacon and egg omelette was burnt and the cheese was scarce. \n\nAt the end of our meal, our server still charged us for the missing drink but they were kind enough to take it off the bill, that is while we waited 10 minutes standing at the register. I wouldn't go back to this restaurant because I think my time is worth more than they treated it but could be nice for those who think differently.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 2, "date": "2014-01-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aYhKsAUQaaRGgdgcZC5XAw", "review_id": "KShIc8cUxbPCGDrJRsVvYw", "text": "If you live in Madison, you too probably have a love/hate relationship with Charter.  It's nice to have high speed Internet without having to buy a useless cable package, however it kind of sucks that the service is insanely inconsistent.  As someone who has spent countless hours with customer service representatives ranging from inadequate to empathetic and resourceful, I have no idea where the problem lies with their service.  (a.k.a. why am I not consistently getting the Internet service that I both adore and pay so much for?) However those of us who just want high-speed Internet without phone or cable one just sort of has to suck it up as this is really the only option.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 3, "date": "2007-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "8ITVDdfK07owxCA1x878Vw", "review_id": "YKl9cQsRT2J3_osn_U-fJw", "text": "My arch-enemy.\n\nI've never encountered a company with such an astounding lack of customer service.  Their monopoly on the local market doesn't help either.\n\nUPDATE: after posting this review, a customer service rep contacted me regarding my problem.  I had a rather pleasant email exchange with the reps.  We still weren't able to correct my problem but for finding an employee that was willing to go above and beyond, they gain an extra star.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 2, "date": "2007-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "awmiM7bsZZLv_WgiTXgRbw", "review_id": "3Pm1t9yeuGctjRPKxNrAOA", "text": "Used Charter for a couple of years. Just ditched them and I couldn't be happier. Shortly after we first started with Charter our connection went out, took them days to send someone out and it turned out they'd disconnected us for no reason at all. Thanks Charter. Fast forward to the recent past when our bill went up, I called up to try and get a new promotional rate because I'm no paying $60 for internet that bombs out briefly a couple times a day. They said they couldn't do anything better than their listed rate. \nAfter that I decided to downgrade to their lowest speed for the time being in order to save some money. When I called up to do so they transferred me to retentions and magically they offered me a better rate. Turned out they were lying and there was an additional charge on top of that because I wasn't bundling serviced (I have no interest in rotting my brain out watching cable TV or having a phone that I can't take with me in my pocket), when I complained and asked for the original rate the supervisor did not apologize and said the last person I talked to must have assumed I knew about the extra fee. When I told her I wanted the original rate she said there was nothing she could do, what is the point of having a retentions department if the best they can do is what is listed on the website?\nFinally I organized DSL with AT&T which was simple and easy and did not require a visit for installation. I just plugged the DSL modem in and called customer service who guided me through the set up. When I called to cancel with Charter they offered me the original rate but I'm pretty sure it would have been the same thing again. After calling to disconnect I got several calls from Charter trying to get my business back if perhaps they offered me a really good rate but by that point they'd managed to blow whatever shred of credibility they had left in my mind. Since I don't trust their billing practices I had no interest in continuing business with them any longer and am now much happier for it!", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AqTwwvkgk_qvfZ2k4ET4pA", "review_id": "DkGRye6t5Cd6PgRab2UwUg", "text": "I signed up for Yelp solely so I could post a review of Charter. That is how much I hate them. \n\nIf you are new to Madison and you don't live downtown - go with someone else. If you are living downtown, sorry, like me, you're probably stuck with Charter. \n\nI have been their customer for 7 years, so my list of woes is long, but I'll just sum up the current one:\n\nI canceled my account towards the middle of June. The account was to be canceled as of 7/1. \n\nOn 7/2, I moved. \n\nOn 7/8, I returned all my equipment to Charter. \n\n7/9 - present, I am STILL receiving bills for this account (now up to $280!). I have called 4 times and received INCREDIBLY poor service. People who were supposed to call me back have not. All have admitted that, yes, my account is showing up as canceled on 7/1, but that some mysterious \"work order\" has not been completed. The current agent I am speaking with told me they actually OWE me $19, but that the account still will not be canceled until the \"work order\" is complete. \n\nDo yourself a favor and get U-Verse or WHATEVER else is available in your area. Charter has a monopoly on downtown Madison and as such, treats its customers like crap.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2010-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QYYVQMpKwrhjdLMY3q1EXA", "review_id": "KL1rNfWrlHzHzZdDsghy5A", "text": "By far the worst company I have ever worked wit. If you can avoid Charter do so at all costs. Absolutely terrible customer service and SCAMMERS. I have to call every bill I get because they add charges. \nI have had to call about TV and internet about 10 times in 2 months.", "business_id": "oLctHIA1AxmsgOuu4dM6Vw", "stars": 1, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dplaWX2Ud7lCGDfcScy9BA", "review_id": "brYgfKhwiN4XAAt5quZCqA", "text": "Do NOT. I repeat - do not do business with this company. \n\nWe purchased a furnace with an extended warranty. The warranty was for 650.00 and we were told it would cover any defects, issues etc. Within 2 years the blower motor went out on a Friday. They advised us it would be 198.00 per hour since it was overtime. This was at 3pm on a Friday. They told me to read the fine print..... you know the drill. Finally after much run around I was told we would have a man out for no charge Monday morning at 8am. Of course no one showed up. after 3 more calls and missed times finally we had a tech arrive at 12noon. They do NOT do what they say, they are rude, and not the least bit proactive. Beware of any promises the sales persons make and any comittments the company makes.", "business_id": "ZW2WeP2Hp20tq0RG1NFkoQ", "stars": 1, "date": "2010-12-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PZZoUCBoxdKGtiY9x-hnKw", "review_id": "oh9vtXZDr6wwivSFwfjyIg", "text": "We called them once to fix our heat, -$200. We called them, again, -$500. Oh and that was without giving us an estimate. Just making the repairs and sending us a bill. And the system was still broken. We finally called another company and the problem was fixed. HVAC problems can be tough, but there isn't much reason to take a chance with this company. There are plenty of other HVAC companies who are more competent and communicative.", "business_id": "ZW2WeP2Hp20tq0RG1NFkoQ", "stars": 1, "date": "2010-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4d1HPQHoQnqS8uoZcDLUDg", "review_id": "y7aKWgnnx6QGDWX8OrCEwA", "text": "Scheduled appointment and repeated the date and time to confirm... The technician was a no show. So i called, and was told hat the appointment was for another day and time. Ok, a misunderstanding. They said someone would come out in 2 hours. In 3 hours I called and they said something else came up. I said, \"it's now or I am calling someone else\". The guy on the phone just said \"ok\".\n\nThese people are disorganized, do not respect your time, and clearly don't care about making customers happy.  Don't waste your time on these losers.", "business_id": "ZW2WeP2Hp20tq0RG1NFkoQ", "stars": 1, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lcNncIDyL4RRRVGFUi4ckw", "review_id": "Dp_HJfwFDxunuJ6B24RoDA", "text": "The library is a nice, clean facility with good, diverse resources for patrons. However, there is no designated quiet area that is closed off from the noise/speaking that happens in the front of the library. There is a quiet reading room, but it is not closed off, so the noise easily travels back there. Additionally, there are hardly ANY outlets near tables, so if you need to study using a computer, you're quite possibly out of luck. Overall, I expect a quiet area to study in a library, and this one doesn't necessarily deliver. More outlets would also make it a better studying spot.", "business_id": "95p9Xg358BezJyk1wqzzyg", "stars": 3, "date": "2014-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5SpVLn2FV2V_ORdugExiIg", "review_id": "ely6It59f_aOIDTkQuVJCg", "text": "Needs more books and homeless people. DVD collection didn't include Jingle All The Way and the place feels off putting. One star.", "business_id": "95p9Xg358BezJyk1wqzzyg", "stars": 2, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SE24BdF_JWLFV34Hr5cHLQ", "review_id": "46dtoXyw4GhusxFq7Lf1KQ", "text": "I've had a copy of Jingle All The Way since it came out and they haven't charged me a late fee yet. Talk about refusing to enforce the laws.", "business_id": "95p9Xg358BezJyk1wqzzyg", "stars": 2, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hhVKwwMkejIS9f5_OILtBw", "review_id": "WvGzFVHI-ttlhYzALyJnzg", "text": "Pros:\nDrinks are ok\nRib eye steak good medium rare with baked potato\nService was friendly and food served warm\nFood affordable\nrelaxing environment, local feel\n\nCons:\nScallops was to salty\nfurniture outdated\nwalleye fish was eh, not enough flavors\n\nIt's very Divey, not impressed even when my meal was free.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 1, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_ohPF8fo5ifWiMOrEPrC8Q", "review_id": "Yxcmpokaw5pJjJGMTqgCfg", "text": "The man and I are on this thing now where we are trying to eat at a few places famous for their fish fry's thanks to an article in Madison Magazine.  There are a few places in the mag that I am looking forward to trying but Green Lantern was the first one that we hit up.  \n\nDriving up the place looked kind of small and beat up which was not what I was expecting and not looking forward to.  As we got closer however I realized how big this place was on the inside.  It's huge!   At least it felt huge from where we were sitting.  I'm not sure if it was the article in the magazine that attributed to how crazy busy this place was or if there was a concert or what but this place was insane.  I mean we had to wait for an hour for our table.  On the plus side we had to wait an hour for our table which meant an hour of drinking so I can't really complain.\n\nBecause we had been waiting for so long we also had a chance to look at the menu so when we  finally sat down we knew exactly what we wanted; the waitress loved this.  We started with the calamari which I'm starting to find out is not one of Wisconsin's strong suits.  I don't think I have ever had good calamari here; maybe this will be my next food challenge 'The Great Calamari Showdown'!  Anyway, I had a few pieces of that and let the man have the rest'' he actually really liked it.  \n\nI ordered the salad which was huge, cheesy mashed potato, and 3 pieces of the lightly breaded cod.  The man order the same but with cheesy hash browns.  The fish was pretty good.  It was juicy and fresh and not bad.  I thought it was maybe just a little over the top with the seasoning.  I think I would have enjoyed it more if the flavors were a bit more subtle as opposed to all up in my face the way it was.  With that said however I though it was alright.  The man on the other hand was in love.  He likened his enjoyment of this place to the Tornado Room.  Pure blasphemy.  He clearly doesn't know anything about food. \n\nAll in all I am glad I tried this place but I don't think I will be making it a regular haunt.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BY9Eyuam4yTP4J2G0jHIyg", "review_id": "WtKlKTqAjM1IlF0hyXgfcQ", "text": "Went last Friday to try the famous fish fry.  Arrived at 5:50pm and was quoted a 25-30 minute wait, which I found acceptable.  We were not called until 55 minutes later, and this only happened when I brought my two young sons and sat on the floor conspicuously in plain view of the host stand.  At that point we were offered the \"quick alternative\" of a table downstairs.  Where was this option earlier?\n\nLook, we knew going out on the first Friday of lent would result in a wait and we brought a myriad of distractions along to kill time for our 4 and 2 year olds.  Those wear thin, however, when the wait is double what you are initially told and have subsequently relayed to the kids.  Maybe this is all due to an inexperienced host.\n\nOur server was very attentive and the food was good.  We tried the baked, beer-battered, and fried fish.  We also had baked potatoes and french fries as well as salads.  Overall, this was not the best Madison has to offer.  We may return, but would only due so as a just a couple or as a family if we could arrive before the rush.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dRko0-SaRcSaP5gR-5uxuA", "review_id": "GYT8mEr3sMzGPc_qrE87pQ", "text": "We went to the Green Lantern last Friday and it was our first visit there.Several of our friends had always spoken highly of it so we thought we would give their Friday Fish fry a try. I had made reservations for us and when we got to the restaurant they informed us it would just be a few more minutes and that we could take a seat at the bar.The bartender was very nice and intuitive, he noticed I was eying up the pickled mushrooms and gave me some for my cocktail.A few minutes later we were promptly seated so the wait was not long at all.We were seated at a nice table by the window with a view of the lake.So far so good.We ordered a kalamari appetizer to share, three beer battered cod fish fry dinners and one breaded shrimp dinner.The kalamari came first and it was ok. Our drinks were finished so we ordered more.Finally she came with our entrees but still no beer we had ordered to go with our meals.So we reminded her again.My fish fry was warm and the fish was flaky.My moms fish fry,however, was cold and soggy and we had ordered the same thing.The cole slaw was good and tasted fresh and the hash browns I had ordered were good as well.My partners shrimp though was awful.It was greasy and mushy and tasted awful.The French fries accompanying it were undercooked and looked anemic, some of them had black coloring on them like the bad part of a potato that has rotted.Our server was still no where to be seen in order to ask about our drinks or inform her about the cold fish,soggy shrimp and undercooked fries.Finally we asked another waitress if she could find her.When we told her we were disappointed in the food,particularily the shrimp and undercooked potatoes she asked why we hadn't told her sooner, to which I really wanted to respond that not once did she check in with us to see how our meal was.She did handle it all professionally in the end and apologized, even took half off of our bill so that was nice.However, between one of us having basically no good entree at all and this being our first time there it really was a disappointment.Like I said the hashbrowns and coleslaw were good, the bartender and hostess service was good but we came there for a good fish fry and dinner service.Next time we are going to Tobys nearby instead.They consistently serve quality food along with good service.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 2, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "i3v1qeqEtHws6oGq3eAtXQ", "review_id": "jTasfkKskWroT2d3rPDsVg", "text": "Service was terrible! I will never return!!! We waited in the bar and were never greeted or spoken too. People walked in after us and were seated. Not sure what their structure is for seating, but they suck at it. I will not be back.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 1, "date": "2010-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Zi61Kgfee1OX6sDG3wbfw", "review_id": "bqTnxsvTzmO_xDVHiMh-9A", "text": "Nasty & Dirty.  Food is okay.  They do a great steak.  The place is full of regulars drinking cheap beer.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "sNvoG3jRINLU_63a9X-X9w", "text": "I really wanted to like this place but it wasn't what we were looking for.\n\nThey have a great spot on the lake but it is a pretty dumpy little fish shanty.   If that is what you are looking for, you will love it.  There were a bunch of locals there having a good time and if we were there with a group of our friends it might be ok for a few beers.  But still way way too crowded.  Like sardines in a can.\nThere was no one to greet us so we just took a table by the window.   Then we waited and waited.  Then someone came over and said hi.  Then we waited and waited.  I was about to get up and leave when someone came over and said, \"oh, you haven't been waited on yet?\"  So she then tried to help things along.   \nThe menu was average for sandwiches but overpriced, we felt, for entrees as we ordered the Ahi Tuna and the Bluegill.   The Tuna was very good and perhaps appropriately priced but the Bluegill was not proportionately enough.  It was made well enough and had ok flavor but should have been a few dollars less.\nSalad was ok.  At least had a variety of greens but still needed a little more.\nIf I ever went back it would be for a few beers and the view, that's it.\nIt's too bad because we really need some nice places on the lake and with all the lakes around here there aren't as many lakeside restaurants as you would expect.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2011-04-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "V3JTVZR8orDlmfwCZG1WHg", "review_id": "w3nMpet6lmITj8j8p9IE_A", "text": "Stopped here while on a Sunday drive.  Tried sitting outside and the waitress did not make us feel welcomed.  She was rude and careless.  We walked inside to the bar where the bartenders were a lot better.  Unfortunately the same lady came in and started venting about her customers.  Seems like they have enough customers and do not need to be nice anymore.  Too bad because the beer was nice and cold.  Great views too.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d-HBNkZ5AJLK-R5_W6fJOQ", "review_id": "mg_lLUO-CDsO7U1ak3lkQQ", "text": "It was ok - waitress was very good - even with 7:45 Friday night reservations no tables were available and had a very long wait - drunk patron at the bar swearing very loud with the F-bomb and other words and slamming items on the bar - first ordered the salmon special and of course it was already sold out - two of us then ordered the fish fry mine was lukewarm and the other one was cold. Don't plan on going back.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "MwXOgU4sB7QBgg0FOz35OQ", "review_id": "vd7lJNpdXM9Lw4iQN4OtWQ", "text": "I took my mom and grandma to the Beach House last night for dinner thinking it would be better than getting a Papa Murphy's pizza. There weren't many patrons in the dining room. Our waitress was very short with us, demanding our drink orders before taking any questions or orders for our food. I ordered scallops, and when they came to the table they were overcooked, but also cold. It took me at least 15 minutes to find the waitress to ask if I could get warmer food. She said that she would have the kitchen make up a new meal, and about 15 minutes later she returned with my same plate, with my original fork and original food. They scallops were now warm, but lacked flavor, and were even tougher than before. The waitress didn't seem to care about the quality of the food and seemed to be either having a terrible night or was on the influence of something. Needless to say, I will not be returning. On a positive note, the sunset on the lake is pretty.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 1, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U7GHbP9OynNHOqisXy7Icw", "review_id": "zQwDqA7HK5zOCPBNgMjQVw", "text": "we found this place on a groupon deal and were excited to try a new place. It was a train wreck! The dining area was not very busy even tho it was a Friday night fish fry. That should have been our first clue. We ordered the steak and lobster, The steak was very good, but the lobster was still raw. We sent it back to be re warmed, and still returned undercooked. we decided to take it \"to go\" and finish cooking it at home.My husband and I love our bloody marys & this is NOT the place to order one. blah. Needless to say, we will not be back, nor recommend this place to anyone else.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 2, "date": "2013-12-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lOu9PPbRz04z-LRfw2Ptpg", "review_id": "5TZ4CiByjntZtDJVj5ZwNg", "text": "Ate there last night with a group of friends.  The waitstaff was friendly, but that was pretty much the only good thing of the night.  I hate french onion soup that was so salty, it tasted like a salt lick.  Plus, they put so many croutons in the soup, I was only actually afforded about two small spoonfuls of soup before the liquid was soaked up.  I ordered the bluegill for my main dish.  Being an avid fisherman, I can appreciate some good Wisconsin bluegill.  This bluegill, however, was not good.  It was cold and tasted very old.  The fries that went along with it were also extremely salty.  A couple people in the group said their food was okay, but definitely not worth a trip back.  I was quite bummed about this.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "-5Wtp9p0jFkAy-eioIbfuQ", "text": "Smoke-filled bathrooms, gross food, even if the burgers are a buck.  Expensive bowling, but on the upside, only one of the bartenders is a tool.", "business_id": "1tkeiIa-daD8LbM6mHm_9A", "stars": 1, "date": "2009-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AXz26iQxhQQF7FFCkDNJ6w", "review_id": "_oM1YkAt2oy0xNCgr_yIHQ", "text": "Its a hick bowling alley.  Cheap bar food.", "business_id": "1tkeiIa-daD8LbM6mHm_9A", "stars": 2, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "VCNBsxepC6uWgREdLvhsdQ", "text": "I was there on Monday December 30, 2013.  And I will NEVER be back again.  I waited nearly ten minutes for a person to show up at the counter.  I just wanted a lane and some shoes.  We were told to go to number 8.  When it was not on, we went back to the counter.  No one was there.  I waited another 5 minutes.  I then went into the bar where I found our person too busy to do his job because he was drinking.  From his vantage point he could not see if people were coming in.\n\nIn addition to that, he kept pointing and telling me number 8 was on.  He could not see number 8 and was just aimlessly pointing.  Most likely he was drunk.  \n\nSpartan Bowl, get some better staff.  Perhaps ensure that your staff can stay sober.", "business_id": "1tkeiIa-daD8LbM6mHm_9A", "stars": 1, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDqWHJG-NQq9ycwV07wjkg", "review_id": "SukL-liHYD7-58tbUICsnw", "text": "At this point, Crandall's is only a bookmark for me.  However, I did stop by only to discover yet another Middleton restaurant closed on Sunday.  Middleton I love your town, but you're killing me with all the restaurants closed on Sundays and Mondays.  In addition, the first two restaurants I drove to were recently CLOSED for good.  \n\nI'm hoping to try Crandall's out sometime, but it will be a challenge since I'm usually in town on Sunday.  Eitherway, I understand the quality of your food is great and your fish fry is the best in the Madison area. The drive thru and patio are also nice features.  \n\nWe'll have to rely on other Yelpers to offer a more accurate rating.  I gave the A-OK 3 star rating since a rating is required.  Check out my pics.  You can also find a PDF menu on their website.", "business_id": "HxPpZSY6Q1eARuiahhra6A", "stars": 3, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "B8HBGwLTTWWM8kqLhix_2w", "review_id": "6DFp76T07l4K-3hbvzJgMg", "text": "Service is extremely subpar.  They messed up our order and we didn't notice until we got home.  Called to inform them of the mix-up and asked that they have our original order ready in 10 minutes as I drove back.  The woman on the phone didn't apologize and abruptly asked, \"Have you eaten the meal?\"  No, I just got home.  \"You must bring back the meal that was wrong.\"  Huh?  I'm fine with that, but what will you do with it?  Re-serve it?  Feed animals?  Odd.  Of course my order wasn't ready when I returned.  I turned over the erroneous order.  Then another worker asked how she could help me...I informed her that my order was mixed up.  She said, \"Well did you bring back the meal that was given to you?\"  Yes, the other server just took it.  It was another 10 minutes before I received the correct order.  No offer of a refund.  No offer of a free piece of cake.  No sincere apology.  Crandall's---your food is good, but your service is simply awful.", "business_id": "HxPpZSY6Q1eARuiahhra6A", "stars": 2, "date": "2013-02-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Bvh3IHeMzSPnJAe5QlBsSw", "review_id": "77npD1TTOnRKe89xedBV_Q", "text": "Just fair, but you learn to appreciate decent chinese food for its rarity (I know, a strange concept for those of us living in the Bay Area).", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2005-12-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SqAgrmuR0GtkoJQeGT1S_A", "review_id": "sR8wgUfBwMaIwKphjRs09g", "text": "Food: It's overall pretty good and probably one of the more reliable options for semi-authentic Chinese food in the Madison area.  To this Asian, there is definitely some catering to Western palates.  Definitely a step down if you're used to eating at, say, Chicago's Chinatown (both old and new sections), and there's no extra menu in Chinese with the more eclectic stuff.  Fresh seafood options very limited.\n\nService: Average.  Food comes in a reasonable time, though refiling the water sometimes is spotty.\n\nValue: Reasonable overall.  Prices fit the portions. Most entrees $9-15 range.\n\nOverall: Good for when you crave Chinese, but I'd still head to Chicago for the more authentic stuff.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2008-04-27", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "XxWsOrQp0gCzDmvOsGvYyA", "review_id": "lgaPs6OzQbS4QaPkgGI1Mw", "text": "Three stars = A-OK.  It was fine.  It wasn't great.  This place has been here for about 30 years.  Before that it was a car wash.  I always think of it as the place that used to be a carwash.\nAnyway.  Went with a group of 15.  Mom was buying and we got the \"Classic\" banquet (the cheapest one).  It was more food than we could eat.  The food was fine.  Not awesome.  The best flavor was hoisin sauce and, well, that comes out of a jar.\nWe got a sesame chicken that had nicely deepfried chicken chunks in a citrus-y sweet sauce.  Some trout that my sister insisted on and really enjoys (not my thing, but everyone else liked it).  Mu-shu pork - it was good.  Delightful (?) beef, kinda bland, but nothing yucky in it.  Aaaannd, oh yeah, crispy duck.  Very crispy, as in dry.  Not so great.\nThe kids got those finger trap toys with their fortune cookies.  The waitress was cheerful, accomodating and informative.  Extra help came out when needed.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2008-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SXRG5zTc2kiezMe-lWa9aQ", "review_id": "SDNd0OwUHw2NaZuS6iQy2g", "text": "Imperial Garden has been around a long time and seems to be a local favorite. That struck me as a very bad sign when I came to Madison almost 20 years ago, and that continues to be the case. The food is insipid, blandly spiced to appeal to unadventurous midwestern tastes and with a menu reminiscent of the Americanized Chinese palaces of the 1950s. I end up there with various groups on occasion, but try to keep it to no more frequent than once every five years (more frequently in my first years in Madison, less so now). It's not that there are vastly superior authentic Chinese options (although I prefer P. F. Chang's, recognizing its limitations), but one does better with other Asian options when in Madison--particularly Thai/Laotian, but also Indian (with many new options in recent years).", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2008-08-31", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "1m7w8LthojiGt5sEmCgatg", "review_id": "qiBoeTWO3BbvKaWNJ0kmLQ", "text": "It's perhaps the closest you can get to authetic Chinese food in a place like Madison, particularly after China Palace closed. The food is alright, it's been embellished in a way to appeal to an American audience, but at least the some of the menu choices are pretty real. \n\nMy real problem with this place is the service: The menu was misinforming and didn't specify that some steamed fish dish was a filet as opposed to a whole fish. I politely complained to the waitress about my order not being accurate and she informed her manager. The manager only ended up refunding me 50% off the item ordered and began telling me how you wouldn't refund someone a fancy steak in an expensive restaurant!\n\nIn the end, I paid for my meal and tipped the poor waitress, but I will never visit this place again. I'm not sure if that manager woman was giving me a hard time because I was a young college student or what, but her management skills leave much to be desired.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2009-04-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "5LjvPOiixP8e_nZEfiBtVA", "review_id": "OFwlRHVrbi_-5jk1j-JOlQ", "text": "This was, quite possibly, the WORST Chinese food (if you can call it that) that I've ever eaten in my life.\n\nWe started with the appetizer platter for two.  The calamari was so stringy that I had to swallow it in one bite because I couldn't separate it with my teeth.  The egg rolls were at least crispy and well-rolled, but they had absolutely no seasoning other than a tad too much salt.  The shrimp were overcooked, the barbecue pork was dry, and the hot dumplings were cold and under seasoned.\n\nThen came the entrees.  I ordered Imperial Chicken, thinking that being the restaurant's namesake, it had to be good.  I was wrong.  The breading was mushy, the chicken was dry, and the sauce was basically  sweet and sour sauce with added hoisan, and several dried peppers that were burnt so badly they added an unintentional, overdone smoky flavor.\n\nMy boyfriend ordered the Ma-po Tofu.  He loves spicy food, and this was just a little spicy, but the spice overpowered all the other flavors in the dish (besides the scallions).  The tofu was a good texture, but the unbalanced sauce flavors basically rendered it inedible.\n\nApart from the horrendous food was the tepid service.  I had to ask several times for a glass of water.  The waitress came by with the water pitcher and had just enough to fill my glass up halfway, so she returned to the kitchen for a refill and stopped by to fill my boyfriend's glass.  By this time, I drank my half glass of water - and she didn't even bother to top mine off.  I tried to ask for some, but she walked away.  \n\nPlus, I thought it was supposed to be an authentic Chinese food restaurant - what's with the Vivaldi and Mozart soundtrack?\n\nSkip this place all together and hit up the Asian grocery and gas station next door.  On Fridays, they receive shipments of Pork Bao in from a bakery in Chicago that are to die for!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 1, "date": "2009-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "XxWsOrQp0gCzDmvOsGvYyA", "review_id": "Yi2O65hivy_kzn8iSJnleg", "text": "Took four kids tonight and we were all underwhelmed. The chicken egg drop soup was oddly sweet. We got a barbecue pork dish and some beef dish that both had a bland gravy. A huge platter of pot stickers that got everyone excited but ended up being ... bland. Even the dipping sauce just tasted like soy sauce. The calamari was not tough. I'll give them that. If this is the best Chinese food around... I'm sorry.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n01pLYcrNOgY8Bdm3Bc5fQ", "review_id": "QFkuq7vT_F4-RfqRugmVVA", "text": "Fool me once, shame on you. Fool me twice, shame on me.\n\nI went there a second time because I couldn't remember if I liked the food or not (yes,it was THAT unremarkable). Upon going there the second time, I knew there would not be a third. Ever. \n\nI know this is Madison, but c'mon, I've had more authentic Chinese food at Panda Express. What should have been an immediate tip-off was the fact that there weren't any chinese words on the menu...and that all the clientele was white (again, yes I know this is Madison, but this is compared to other Chinese restaurants like Fugu or Ichiban). I don't actually remember the specific dishes I ordered (I've had fish, chicken, pork, and beef there), but it all just tasted as if it had been sitting in the freezer for months. Dry and flavorless. \n\nThe service was also slow. They refilled our glasses only once, after we had asked for the check.\n\nI won't be going back.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2012-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zJU0H-OQIbSfU9tStgFEtg", "review_id": "1DnraCHqJGQ_uWVqfChx5A", "text": "It is not delicious, but the service is good.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 1, "date": "2012-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GfceHEXxy7ifcGCSOk6sjA", "review_id": "N8dvWtA26m1XchXEDZAMCg", "text": "Often rumored to have the best Chinese food in the Madison area, this restaurant is a major disappointment. My spicy tofu and vegetables dish was not in the least spicy and the tofu was only fried and would have been better marinated. The entree my dining companion ordered was also sub-par. The service was very quick and the food served very quickly, maybe too much so. Madison has great Southast Asian restaurants, but I definitely won't be eating more Chinese food  anywhere here.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kV7ZoThXkTq9yxT7PAbq0Q", "review_id": "mxEP8SItRNidu8Jo_olF0w", "text": "I live on the east side of Madison and I always eat at the Imperial Gardens near E. Washington and this Imperial was a let down. The restaurant itself is beautiful and the decor is lovely but the food and staff wasn't as amazing as I hoped for. \n\nFor starters, the food is so expensive compared to the east side and the plates are larger but the portions are definitely not bigger. Our chicken sizzling rice soup was flavor less and completely watered down. My friend loves oyster beef but what received tasted completely different and it had a weird sort of sour after taste. I had the pepper steak and I did like how the onions and peppers are more thinly sliced but my meat also had a strange after taste.\n\nThe staff was very kind but a little annoying. It's was great at first to see how attentive they were to our needs but the waitress came to us almost every 10min and made awkward small talk which really bothered us. We could then see her staring at us from across the room waiting to start another unwanted conversation.\n\nImperial Garden Middleton will definitely be memorable but, for all the wrong reasons.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2012-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RdufJ-Wl0abkMOlE2WNaLw", "review_id": "Oa_wOgiz8F1k_-dRow1Nhg", "text": "How do you get voted best of for 31 years when what is served is awful? This is the worst Chinese food my entire family has had in years. We all ordered different things and none of us could eat our meals. That was $50 wasted. There was no flavor, or the flavor there was did not match the dish. How do you mess up beef fried rice? I can make it with more flavor. The Mongolian beef had a flavor but it was all wrong. If you want to waste money and still be hungry, this is the place for you. How do places keep getting good reviews when they are so bad. I use to trust Yelp reviews but lately, I've been fooled by the reviews.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 1, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "Mw94fVzpV71ZZjhe01hgLA", "text": "I had fond memories of dining at the Imperial Garden... back in the 1990s, when I didn't really have access to more \"exotic\" and interesting foods. I've been to this location twice within the past year or so - once for lunch with a coworker, and once for dinner with friends last night.\n\n+ Huge establishment - impressively big\n+ Quick to be seated\n+ Server was friendly\n+ Waters were refilled quickly\n+ Decent selection of bottled beers/drinks\n\n- Massive menu, but not really... many identical dishes on the menu, with different protein options\n- Food/dishes very salty, but otherwise bland in flavor. No spice, no interesting flavors/tastes\n- Sea bass dish tasted extremely fishy; sea bass should be \"clean\" and non-fishy\n- Duck was very fatty - extremely fatty\n- Red Pepper Chicken (\"very spicy\") had zero flavor and was drowned in pasty brown sauce\n- Service became extremely slow/absent after we received our entrees. Took us 30+ minutes to get checks, pay, and leave - entrees arrived at 7:15pm, we left at 8:15pm.\n\nI'm glad the four of us split entrees last night... I would've been really disappointed had I ordered something for myself. It's just... not very good. Guessing this place caters to folks who want to eat adventurously without really doing so. The food is sub-par; this place is resting on some large laurels.\n\nI'd much prefer a flavorful Thai or Indian dish. Won't be back.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "AnW3hjm3lkvx8usob_YjzQ", "review_id": "A3yW2gOKA9BJa4bUH9r30A", "text": "What a crushing experience.\n My son was in town and when he is here we like to visit and spoil ourselves to a splurge of a dinner outing. This particular night was at the end of summer and there was an amazing thunderstorm about to occur. SO on this stormy night we decided on Chinese and I had recommended we drive to Middleton for what I had heard to be the best around.\nOk..so after a short 15 min drive we had a great parking spot...  ran inside and were greeted with a warming beautiful atmosphere.. very welcoming large foyer, nice bar area which u walk thru to get to your dining area.\nAfter the immediate seating, WE were greeted  by a pleasant asian woman and ordered drinks. which turned out to be just right.\n\nAppetizers were mediocre...nothing to remember...we had the app for two...calamari was HORRIBLE  btw  I could go into so much detail but who is gonna read all that....the following is my reason for writing...\n\nMy forewarning is NOT TO TRUST in ordering the Lobster dish. I wanted a decadent treat for myself and decided on the (market price) 45$ Lobster dinner entree which came with two choices of preparation. Ginger sauce or garlic butter  i ordered the garlic but the server said no the other was best.\nMore importantly i asked her how large the lobster was and if it was sold by pound cause it was listed as Market Price. She said she would inquire before i ordered and returned to our table and said it was 2.5 pds or larger. So that made me excited and i did not hesitate in my ordering. I thought 45 dollars was a great price for a generous 2.5 pd lobster entree.\nWhat arrived on my plate was a cut up overly sauced jigsawed puzzled lobster animation on a platter which was in no way a 2.5 pound creature to begin with. It was dismantled then pieced together to look like a lobster shape. The meat was still in shell. (and I mean IN SHELL).  There was hardly any meat to be had. The tail which should have been the meatiest portion was cut in one inch pieces with shell INTACT and had yielded maybe 2 morsel of meat total.  I was shocked as i struggled to manipulate any source of goodness from the pieces of crustacean.There was literally no lobster and what was there was swimming in overpowering sticky sauce. All in all an EXTREME disappointment. Not what I was expecting in the LEAST!!\n\nAs the storm gained intensity outdoors, my high hopes and any thoughts of returning to this eatery were un-intensified. I will NEVER return. I cannot tolerate being misled by a server\n We ended up tipping and not making a fuss...just another lesson learned. The storm raged on , I did get to spend time with my son and hopefully educate you.. Not a total loss I guess.Just stay away from places like this that lie for profit and have followings that end up being ill fated.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2013-12-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AEIKxjduqqu545E3T2lHog", "review_id": "dOr5E63wDvGKSpEesNSycw", "text": "Imperial Garden has been getting progressively worse over the last few years. The waitstaff has always been attentive and professional, and the wait time for food is reasonably short. The restaurant itself and the bathrooms are clean and spacious. The ambiance is relaxed and pleasant, and noise levels are comfortably low.\n\nBut none of these things can save the mediocre-to-bad food. That is, if you get your food at all. On more than one occasion, they have forgotten to include entire entrees or side dishes when I've picked up take-out. I now double-check all of my orders before leaving. The egg rolls taste like they came out of a box in the freezer. They are greasy and heavy, with very little flavor until you douse them in sweet-and-sour sauce that's so sweet it might as well be syrup. The same problems plague the entirely unremarkable crab rangoon. I've had the hot and sour soup, and disliked the taste quite a bit. Not spicy enough, and far too sour. I usually order the ginger beef stir-fry. There's hardly any ginger flavor, and the sauce is thick and also fairly sweet. If they halved the amount of sugar in everything, it would be a good start. I've had more success with the sizzling black pepper beef, which has a punch of black pepper and a good balance of meat and vegetables. On a recent trip, a friend got the beef lo mein. It had a nice quantity of beef, but an anemic quantity of vegetables. It was also very greasy and watery, and tasted extremely bland. The only reason I go here as often as I do is that my grandmother (the poster child for stereotypical Wisconsin taste buds, bless her heart) loves the three delicacies sizzling rice.\n\nI did discover one saving grace: if you dump sriracha on the food, it blends very well with the food and elevates all of the flavors. Too bad they don't have any of it at the restaurant, it could save many a dish. Bottom line: there's much better, more authentic, more balanced, and less heavy Chinese food available in Madison at comparable prices. If you're looking for good Chinese in town, check out Hong Kong Cafe on Regent or Orient House on South Park instead.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2014-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "5W_Dv1E2loDsoXFpi-pqcQ", "review_id": "Z0Nv8FGJJ5o5-cCNRbf2Dg", "text": "The short of the story is - we went here yesterday (Mother's Day) and were there 3 hours! Waited a full 2 hours for our food. So if you have don't mind waiting an unbelievable amount of time for food and have all day to waste, then read on. . .\n\nFor years I have drove by the Imperial Garden and referred to it as the \"Chinese Restaurant Gas Station\". I don't even know if they are connected or what, but you see them both as you turn the corner. We decided to go to this place for Mother's Day and check it out. Talking to friends over the weekend, we were told it was pretty good.\n\nThe building is nice and the atmosphere of the restaurant was way nicer than I expected. Very large and nicely decorated. Not so cheesy like a lot of Chinese-American places in Wisconsin. The hostess greeted us very nicely and having reservations we were seated right away. \n\nNow - we were a larger than average group - table of 8 - but they clearly were set up for groups this big as they had large tables in the corner of the rooms with a spinning lazy susan in the middle that was perfect for us. I think we probably could have even gotten 9 or 10 people on this table. The waitress was very nice too. Came right away and got us drinks and very friendly.\n\nThis is when things went down hill. We did order appetizers, which came out right away. Pot Stickers - both steamed and fried - which were pretty good. Once our whole group arrived we all ordered regular items from their menu. Then we waited. Waited and waited and waited. Apparently so did everyone around us. For hours - over two to be exact. The waitress did her best - kept coming by and telling us she was sorry, that the Kitchen was crazy and that we were next. Honestly we should have left - but it was hard enough getting family members from 4 households together at one time. \n\nEventually the food came out. To their credit, I thought everything tasted pretty good. I got two different shrimp dishes. Decent flavor, cooked perfectly - the snap peas and water chestnuts were good. Portion was decent on the Shrimp dinner and much larger on the chicken dinners that others in my group got. I agree with other reviews - its not the most adventurous food. Flavors were safe and my spicy shrimp wasn't very spicy at all. My sister-in-law was upset her Sesame Chicken with Broccoli came with one piece of broccoli. She complained and the waitress brought out a side of broccoli.\n\nOverall, If the food wasn't pretty good - I would have given this place one star. I give our waitress credit for holding it together too. She offered free desert but we were about an hour late for getting to another place so had to go. Saddest thing is we heard that this has been an ongoing problem with the Kitchen. Sounds like they don't fire dishes in the order they come in and they have a lot of trouble keeping up with things. If they could correct this problem and add a bit more flavor into a few dishes, the place really could be ok.\n\nTry it on your own risk - but I would plan on spending several long hours while you wait for your food.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 2, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "HPUUg5qQpNr02I30hq4wAw", "review_id": "lRZUg6Wkqt5pamCVZjAwjg", "text": "Absolutely THE worst!  This place won \"Best of Madison\" for Chinese food for how many years??? The judge must have been completely stoned out of his mind! \nCustomer service:  Very poor.  The server never checked back until I went looking for her, wondering where our order was 50 minutes after ordering. \nFood finally arrived for our group of four--STONE COLD!  Plates themselves were hot but practically frostbite on the food.  Couldn't eat it. \nManager came by, apologized and took 50% off the bill (!!!). Should have been 100% comped. \nI'm one of those folks who normally overlooks a lot and actually hates to complain, but this culinary travesty really needed to be reported.  If this place previously had great food and service, then as of 2014 they've completely lost their \"mojo\".", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 1, "date": "2014-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tpd1sxBuNgRaJcEYUQL2PQ", "review_id": "B6JNvh3UrbFnJxBXCGCqlw", "text": "It started out as an excellent place to go then they changed the menu, then they changed the menu again! The food changed names and the pricing increased but essentially it remained the same. They are now at the point where they are charging a little much for the food they are serving. I still go here because of convenience and lightning fast service. I noticed a new manager walking over the servers shoulders seemed to make the staff feeling like they were on pins and needles.\nKids eat free on Sundays so keep that in mind!", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2010-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "DavxDAi3EABo4SKWYwXXsg", "text": "Ate here once with a buy one, get one coupon. I won't be heading back. Go to Los Gemelos off of State St instead.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 1, "date": "2010-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rU8yMhWdCQLx2lUwxU8uSA", "review_id": "TmcZk5dRfgIyiurzqCBgLg", "text": "So, I've enjoyed Mi Cocina before.... but I think my tastes have matured.  The salsa was good, but the sauce inside of my taco and chimichanga was a strange ketchup/bbq tasting mixture.  Beans were ok, rice, not so much.  I probably won't be back.  Sorry Mi Cocina.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 2, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "h2Lf89D3H3Ix-dLNfOpDgg", "text": "I joined a few coworkers for lunch here today... I've not been a huge fan of Mi Cocina, so I hoped the new location and fresh look would've improved the experience.\n\nIt's still just barely passable as Mexican food.  Most entrees appear to be drowning in sauces, cheese, and other gooey/greasy stuff.  The salsas are extremely watery and lacking in flavor.  The guacamole (not the tableside-made) is bland and pasty.\n\nI ordered a pollo ensalada (chicken salad), which arrived as a bowl of super watery iceburg lettuce, a slab of seared chicken breast, 4 small slices of cucumber, a spoonful of pico de gallo, and a huge glob of guacamole (which I scraped off and set aside).\n\nThe salad was ok, but as I neared the end, I literally had what looked like a small soup bowl's worth of water resting in the bottom.  \n\nMy coworker's entrees were drenched in various cheese sauces/red sauces; the taco combo was blanketed in cheese.  They loved it, but my guts would've been complaining for days... \n\nSo, enjoy the new location and ambiance - just don't expect better food.  Those who've had real Mexican food will not enjoy this place...\n\nCocina Real/Mi Cocina = FAIL\n\nFood = 2 stars\nService = 3 stars\nValue = 2 stars\nMISC = 3 stars", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 2, "date": "2013-02-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YbjG8LgT13jaOAT3NzoT0Q", "review_id": "2eJEvp6tUcCXhPxuFG5AJg", "text": "Sooo... Ok. I live Mexican food. I grew up in Southern California so my standards for Mexican food are high. That being said I assume most places are gonna be bad so that if they are good I'm quite happy.... And if they aren't well... That's what I expected. \n\nThis place made me happy and quite upset at the same time. I'll start at the beginning. The chips... Kinda bad. They were super dry and weird. Super weird consistency and zero salt. Our second basket was better, but still lacking. The salsa was ok... Not amazing but not bad. Margaritas were good and seemed to be on the strong side which no one should complain about....ever.\n\nMy burrito was actually alright. I had the carnitas burrito and it was good. It needed a bit of spicing up so it asked for hot sauce and another margarita when the waiter checked back. He said no problem. A few min pass and he brings my margarita and says he'll be right bam with the hot sauce. Ok... I'm eating very slowly because I want that hot sauce. It's now been probably 10 min since my margarita came. I don't like eating slow... And I finally say screw it and finish eating. He comes and takes my plate away... And then he brings me the hot sauce to the table. I mean really?\n\nBottom line, Drinks: Yay! Food: Ehh. Service: Booooo!", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 2, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "lWvnozTHpZ-tfU49Fqz-OA", "review_id": "iffr3PApzCIpUZdLUnbsAQ", "text": "On 12/26/11 our 2008 Acura TL broke down in the Wisconsin Dells. We had just purchased it earlier that year. It was a certified used vehicle so it was still under warranty. We called Acura Roadside Assistance and they sent out a tow truck that jumped us so that we could drive to the nearest dealer to have the car looked at and fixed. The closest Acura dealer was Zimbrick of Middleton and we dealt with Shane (the manager) in the service department. They replaced the battery in our car and then informed us that our car now had a check engine light on. We asked if they could pull the codes and tell us what was wrong or even clear them and see if they came back. He told us that we would have to take the car in its current condition with the light on because he said, \"It's the day after Christmas and I just don't have the manpower to deal with it.\". My Husband reiterated to Shane that he please just pull the codes so that we have an idea of what we were dealing with, Shane refused. We were worried about taking the car as we were traveling from Minneapolis to Chicago and it already broke down on us once. Plus, with the delay of the battery ordeal we'd be getting into Chicago during rush hour. We decided to cancel our hotel reservation that we had for that night in Chicago and called Acura of Brookfield. They said they could get us in first thing the next morning to scan it and see why there was a check engine light on. So we spent the night in Brookfield and that dealer took great care of us! They even reserved a rental car in case it was needed. I just wish that's who we would've went to first. Oh, and I forgot to mention earlier...Zimbrick of Middleton put a three inch black scuff on the drivers side rear quarter panel of our white car while it was in the shop. When we noticed it and went in to ask Shane to take a look at it he became extremely short with us and was down right rude. He implied to us that it was there from before and it clearly was not. His level of customer service was appalling.", "business_id": "9brW55Vzyi3ItboHWfoepg", "stars": 1, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Zoi9zXFY6DpvGWY33_8_pg", "review_id": "50vhsZAcNJLSdrGnHJycjQ", "text": "My radio and navigation system went out on my Acura.   I took it in to Zimbrick who immediately determined that a small fuse had blown.  I was glad it was only a fuse until I pick up the car and was charged $100 for replacing a two dollar fuse.  I complained but got nowhere.  They have since lost several thousand dollars of my service business to other repair shops.", "business_id": "9brW55Vzyi3ItboHWfoepg", "stars": 1, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9iD8gqFz7tweptIFNbxmqA", "review_id": "r0Rta5xi6NZvo7ekFVGYkA", "text": "The sales people in this place are the rudest I have ever seen! I walked in there and I was ready to purchase a RDX after doing research online; all I needed was a test drive to make my decision. First I was waiting for 30min so somebody would help me, and then when they did they treated me very badly and were hesitant to let me do a test drive. Then once we finally went to test the car, the sales man that was helping me made a comment like - this car was fully redesigned and Acura wants to target young and successful people - as if we weren't successful enough or good enough to buy the car. EXCUSE ME? So because I look young you assume I don't have enough to buy the car? I was very offended and disgusted, since I was very interested in that car. In the end I went to another zimbrick in town and purchased another car. On fish hatchery road they treated me very well, and aided me with all my needs.\nI am very offended and was never mistreated in such way in my entire life.", "business_id": "9brW55Vzyi3ItboHWfoepg", "stars": 1, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "UVoJK5hHErOtgr8TQkkDsw", "text": "I hate myself for reviewing Dominos, but I have to give props to this location for their awesome service and incredible speed. A++++ service - friendly, helpful, and enjoyable.  Definitely not what you'd expect from a carryout chain pizza place.\n\nThe \"all new\" pizza that the commercials boast about tastes exactly like the \"old\" pizza to me.  Perhaps there's a bit more garlic flavor to the crust, but otherwise seems to be the same 'ole Dominos pie.\n\nPricey, too. A 14\" Brooklyn with 3 toppings and a pair of chocolate lava cakes was $25. Ouch!!! Same deal from Papa Johns would've cost $15.\n\nI usually eat Dominos pizza about once every 2 years. Even with the \"all new\" pizza, I don't think I'll be sampling with any more frequency.\n\nSummary:\n\nService = 5 stars (awesome folks working here, seriously!)\nFood = 2 stars (despite being \"all new\" it still tastes the same to me)\nValue = 1 stars (extremely pricey for take-out pizza)\nMisc = 5 stars (online ordering is the best system ever)", "business_id": "KTqNU4plO23583DYAMGXYg", "stars": 2, "date": "2010-01-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LFsJK5nPekuVciOQ83Niiw", "review_id": "mwUrRrRxH8mRwWF0-FjZIw", "text": "I have had too many negative experiences with the staff in this store.  Today I tried going back after a year, and again the staff is so unhelpful, unknowledgeable and downright rude.  I called to talk with the Manager, and her attitude is just as bad.  Which I guess explains the attitudes of the staff.  There are plenty of other places to shop that actually appreciate and help customers.", "business_id": "cgCqxPhadIAlsqnD1MoWuQ", "stars": 1, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s6jCWGy3Jtg-9oIs21snDw", "review_id": "BDVjP6YTB6xeKdlPyhP6Eg", "text": "Never again will I shop this store!  I have been an extremely loyal customer for well over 5 years.  Several weeks ago I made a very large purchase of many items in order to make a scrapbook for my daughter's bridal shower.  During the course of that shopping experience, an associate kindly offered to keep my selections at the checkout desk while I continued to shop; however, inadvertently another associate also added another customer's purchases to my pile as well, which I did not discover until a few days ago when I proceeded to put together the scrapbook.  When I attempted to return about $20 worth of merchandise that I had paid for but had not selected, I was told I was past their 30-day policy and I was simply out of luck. I later discovered, however, that I had returned these items WITHOUT a receipt, I would have been given a store credit--which I had expressly requested but been denied because I was careful enough to save my receipt!  Nope...no more of my business and I'm telling my story to every woman I know!", "business_id": "cgCqxPhadIAlsqnD1MoWuQ", "stars": 1, "date": "2013-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pXTM0MEmK24EO1NQK8zKMw", "review_id": "oril8e7RJUzUifN77YfsIQ", "text": "It's a strip mall near a bunch of hotels off the beltline.  They have a few cool stores like Ann Taylor Loft, Michaels, and a huge scrapbook store.  Other than that, its nothing special and you're probably better off going to another mall in the area for a more extensive selection.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 3, "date": "2009-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hyAMhpe0hSdZIu88byeCLw", "review_id": "pvSnOq6WYRWbYk2D9rKx6w", "text": "This mall was adjacent to the hotel where I was staying. It seemed to have some nice stores (Loft), and the general mall stuff. I was excited that it had a World Market (my favorite store of all time), and it was Wednesday, Double Coffee Points Day! \nHowever, nothing else stood out to me, and I wasn't impressed with the restaurant selection. In fact, that is a theme for Madison in general. I had to drive a bit away to get something other than a sandwich for lunch.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 3, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Fiec-fG39Gkd5mTK5WEi7w", "review_id": "x77Xi3WbLCilyV2CWWqy1Q", "text": "Greenway station is a total joke.  It seems like the management can't keep businesses to stay more than six months.  They don't have really any good stores that make me stop and shop.  There really is no big draw.  The resturants are worthless.  No men's stores what so ever.  On top of all this the location is horrible.  Make this a dead mall and it will be more exciting.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 1, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "DxskpNqrzI8y4dkb0DBZsg", "review_id": "_rRcBjqGWlS9iCNpsC72qQ", "text": "Barrique's in general is great - they know their wine, and they serve Milwaukee's own Alterra coffees and baked goods.I've been to two of their other Madison locations and enjoy the laid-back atmosphere and comfortable seating areas. \n\nHowever, this morning on my way out of Middleton, the staff at the Middleton Coffee Trader location was dismal. At 7:30 a.m., the assumption in a coffee shop three blocks from a major freeway entrance should probably be that people are on their way to work, or just generally not interested in a leisurely 15-minute wait for a latte!\n\nWhen I entered the store there was one person already waiting for an espresso drink, one person ahead of me and no one behind me. After one of the three employees rung me up, I waited several minutes as the barista VERY leisurely made the person in front of me's cappucino. She was literally pulling an espresso, standing for a few seconds talking to the other girl, then steaming the milk, then standing, and so on.\n\nAfter she finally finished the other guy's drink, she wiped her area down and took her sweet time to start my drink. It was very obvious I was there waiting, and very obvious that she was just wasting time. Meanwhile, her and one of the other employees started to argue with one another, all the while she does nothing. Finally, I tried to make eye contact with one of them, because I really was in a hurry to get back to Milwaukee. Finally, she made my drink, slooooooowly. \n\nAs an aside, I'm not that uptight or fast-paced of a person, but customer service with no customer focus really gets on my nerves, and there is simply no excuse for ignoring a customer in a coffee shop at 7:30 in the morning. The whole experience left a bad taste in my mouth.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 2, "date": "2007-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mqKZD27fxWYIP5Aedph-AQ", "review_id": "u_4StEqNgi1F5Va36gPe1A", "text": "Coffee is fine, although I agree with Laura F. below. Service has always been VERY slow, despite 3 baristas working at the counter. I'd recommend not stopping here on your way to work, but its an OK place to pick up a latte on the weekend or get a bottle of wine.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 2, "date": "2011-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CfHKRE1PJL2snv1ICGhgeA", "review_id": "es7GnRtZRuV78geY7ziF-g", "text": "They should call it S&M Wine & Spirits. The worst of the Barriques around.... The attitude from the girls working there! They do everything they can to make you feel you are beneath them. I work in Middleton and was stopping daily until I could not put up with the attitude any more. The final draw was when I stood there at the counter for 20min with other customer behind me waiting while I got to listen to. \"You know\" \"Oh my god\" \"She didn't\". \"really, really\" \"Oh my god\" \"He hooked up with who\". The girl working the cash register would look over at me and the others waiting and roll here eyes as she kept on talking with the barista.... When she did take my order she got it wrong. This is basically what I got for service for weeks, so I don't chalk this up to a single rotten apple.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 2, "date": "2011-12-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8CuL35s__PeCu7tUKjaoIw", "review_id": "WAWGSaa2TXWbiS37V965kQ", "text": "I have yet to walk away from this Barriques location NOT disappointed. Horrible, horrible, horrible service. Slow, unfriendly staff who refuse to even talk to you sometimes! I have the unfortunate fate of working in the same business district as this location, and it is the ONLY coffee shop within a reasonable distance. I now drive 10 minutes out of my way to work to get coffee and breakfast because I refuse to give those people any of my money. Please stay away from this location - this warning comes from a girl who has NEVER written a bad review of any place! Boo Barriques! :(", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 1, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mUNMXyz5b0CBBrDvXnkoRg", "review_id": "l9RRz_a8vVLyb6eBG4Zfrg", "text": "It doesn't match the layout of the other Barriques and the seating area is a little cramped and sparse.  Still serves the great coffee that I have come to know and love but unlike their other cafe's, the staff is a little surly and indifferent at times.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 3, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "wslF-wJ9E2WtzU0p8mY7vg", "review_id": "PYrqM4Ktd_tA4nhxehkamw", "text": "I went to this place at 7pm. And most of the food was cold or warm some hot fresh food. That was good but not for 10.75.  The only thing was great was the ice cram.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 2, "date": "2011-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mur7-hRX-PTZy64QscTw5w", "review_id": "Xj0bl0K4uKa2-ujs_vwkhw", "text": "Went there on Saturday night to get some food to go. On of the worst Chinese Buffets I've seen. Half of the trays were empty and other half were almost empty. Very little selection. The worst pay is the take out prices: $10.50 to get a to go box(should be under 2lb) and 40 cents for every ounce after, WTF is that!!! So we just went somewhere else that night and didn't dine there at all. Bottom line: EAT SOMEWHERE ELSE.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 1, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R04P35fYVS4HASyBuMcElg", "review_id": "QJyvdDHRbkUMWU1jsAYrzg", "text": "Not good, not BAD, this place is a fine choice if you're looking for totally mediocre but plentiful food. That being said, I would not recommend the place to friends.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 2, "date": "2012-09-04", "type": "review"}
