{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H1kH6QZV7Le4zqTRNxoZow", "review_id": "RF6UnRTtG7tWMcrO2GEoAg", "stars": 2, "date": "2010-03-22", "text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TCqjsTEPFLfjdCxI2Zq1WQ", "review_id": "Hm4bXkXC3098K49bG2lIYg", "stars": 1, "date": "2008-10-18", "text": "They charge more than the services they provide are worth.  Since they currently have a monopoly on cable tv in the madison area there is nothing anyone can do about it.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "QSRCc7ip7DqRnUT0gJ6q_g", "review_id": "Yp9-duCZtwUlrP8CXJwSxg", "stars": 1, "date": "2009-01-16", "text": "To be fair, I am not yet a customer, so I cannot rate the actual quality of their cable/internet.  That said, I have so no such qualms about revealing their absolutely HORRENDOUS customer service practices.\n\nI spoke to a representative yesterday to sign up for internet service at my new apartment.  I specifically asked the representative if there were any promotions currently available, in order to receive the best price possible.  He quoted me 39.99 as their only current promotion for basic internet (not including moden/router rentals, upgraded speed, etc.) Taking him at his word, I accepted, and scheduled an installation.  Thus begins the tale of woe:\n\n-------------------------------------------------------------\n-  Later that night, on the internet:  I see advertised in giant, bold, colorful letters, $24.99 for basic internet.  Just about half the price of the \"promotion\" the representative offered me.\n\n-  I call the representative line to find out what I was told a blatant lie (in nicer terms, of course).  He confirms the promotion is available, but he doesn't have authority to change me to that price. TRANSFER 1, TO SALES!\n\n- Sales also confirms the much cheaper promotion, but says it is an online-only offer, and she absolutely cannot give it to me:  I can only receive it online, and I will need to reschedule my installation.  TRANSFER 2, TO THE INTERNET!\n\n- The internet promotion finds my address alright, but instead of being able to sign up online, every time I reach the promotion page for my address, I receive the same error message:  \"Your session has timed out or encountered an error. Please start over or click the \"Back Button\" on your browser. If you still wish to contact us.\"  This occurs over 3 different computers and the same number of unique browsers.  TRANSFER 3, TO THE ONLINE-CHAT REPRESENTATIVE!\n\n-  Online chat confirms again that the service is available, but I cannot achieve it online, only over the phone.  Having just been told the *exact opposite*, i attempt to point out the circular logic there, but to no avail. Apparently, reducing my price to their own advertised offer would be considered \"downgrading\" a customer, and he is not allowed to do that. TRANSFER 4, TO THE PHONE REPRESENTATIVE (AGAIN)!\n\n-  The new phone representative tells me that as I am NOT a customer, she cannot help me at all.  Still loving the contradictions (the last one claimed that she could not downgrade customers, now I'm not even a customer?  Really?), I try to argue, but she claims sales needs to handle me, and transfers my call.  TRANSFER 5, TO SALES (AGAIN)!\n\n- And at this point, after another few minutes of lovely Charter advertisements and soothingly torturous elevator music, I am transferred to... a voice mail.  This proceeds to Inform me that the Sales Depts. hours are over, so please call back later, and then terminates the call.\n---------------------------------------------------\n\n\n3 fun filled hours of lies, contradictions, and a misinformation campaign that would dazzle ANY public figure later... absolutely nothing was accomplished, except a gigantic waste of my life and a review that will hopefully reveal these horrifying business practices to all those unsuspecting cable-seeking fellows on Yelp.\n\nBeware.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DVWIxcfkjxri5UruYABkrQ", "review_id": "PHcYOcb3Hf18FUPgysF-lQ", "stars": 1, "date": "2010-06-10", "text": "there should be a negative rating on here.  one star is way to high.\ni am sick and tired of how the cable box is never working their solution? KEEP RESETTING THE BOX... YES IT IS MY JOB TO MAKE SURE I GET MY SERIVCE ON A DAILY BASIS.  IT'S NOT THEIRS TO MAKE SURE IT WORK.  Plus they have poor customer service but I don't blame the people that answer the phones but the people who st the rules to nickel and dime it's customers. \n\ncharter is horrible and since i coudn't get thru to complain on the phone here is my truth.  Charter is the worst.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "BD4IhPuK-DwGBQb3RzQDcQ", "review_id": "Hdng63D9qvnT1says4LMMw", "stars": 1, "date": "2010-10-11", "text": "In my opinion, Charter Communications is just terrible.  They have been unreliable, unhelpful, rude and incapable of providing an acceptable level of service.  The customer service representatives are like talking to pre-programed robots, even in the midst of a prolonged service outage, their main goal is to sell more worthless services. Avoid this company like the plague.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
