{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H1kH6QZV7Le4zqTRNxoZow", "review_id": "RF6UnRTtG7tWMcrO2GEoAg", "stars": 2, "date": "2010-03-22", "text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TCqjsTEPFLfjdCxI2Zq1WQ", "review_id": "Hm4bXkXC3098K49bG2lIYg", "stars": 1, "date": "2008-10-18", "text": "They charge more than the services they provide are worth.  Since they currently have a monopoly on cable tv in the madison area there is nothing anyone can do about it.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "QSRCc7ip7DqRnUT0gJ6q_g", "review_id": "Yp9-duCZtwUlrP8CXJwSxg", "stars": 1, "date": "2009-01-16", "text": "To be fair, I am not yet a customer, so I cannot rate the actual quality of their cable/internet.  That said, I have so no such qualms about revealing their absolutely HORRENDOUS customer service practices.\n\nI spoke to a representative yesterday to sign up for internet service at my new apartment.  I specifically asked the representative if there were any promotions currently available, in order to receive the best price possible.  He quoted me 39.99 as their only current promotion for basic internet (not including moden/router rentals, upgraded speed, etc.) Taking him at his word, I accepted, and scheduled an installation.  Thus begins the tale of woe:\n\n-------------------------------------------------------------\n-  Later that night, on the internet:  I see advertised in giant, bold, colorful letters, $24.99 for basic internet.  Just about half the price of the \"promotion\" the representative offered me.\n\n-  I call the representative line to find out what I was told a blatant lie (in nicer terms, of course).  He confirms the promotion is available, but he doesn't have authority to change me to that price. TRANSFER 1, TO SALES!\n\n- Sales also confirms the much cheaper promotion, but says it is an online-only offer, and she absolutely cannot give it to me:  I can only receive it online, and I will need to reschedule my installation.  TRANSFER 2, TO THE INTERNET!\n\n- The internet promotion finds my address alright, but instead of being able to sign up online, every time I reach the promotion page for my address, I receive the same error message:  \"Your session has timed out or encountered an error. Please start over or click the \"Back Button\" on your browser. If you still wish to contact us.\"  This occurs over 3 different computers and the same number of unique browsers.  TRANSFER 3, TO THE ONLINE-CHAT REPRESENTATIVE!\n\n-  Online chat confirms again that the service is available, but I cannot achieve it online, only over the phone.  Having just been told the *exact opposite*, i attempt to point out the circular logic there, but to no avail. Apparently, reducing my price to their own advertised offer would be considered \"downgrading\" a customer, and he is not allowed to do that. TRANSFER 4, TO THE PHONE REPRESENTATIVE (AGAIN)!\n\n-  The new phone representative tells me that as I am NOT a customer, she cannot help me at all.  Still loving the contradictions (the last one claimed that she could not downgrade customers, now I'm not even a customer?  Really?), I try to argue, but she claims sales needs to handle me, and transfers my call.  TRANSFER 5, TO SALES (AGAIN)!\n\n- And at this point, after another few minutes of lovely Charter advertisements and soothingly torturous elevator music, I am transferred to... a voice mail.  This proceeds to Inform me that the Sales Depts. hours are over, so please call back later, and then terminates the call.\n---------------------------------------------------\n\n\n3 fun filled hours of lies, contradictions, and a misinformation campaign that would dazzle ANY public figure later... absolutely nothing was accomplished, except a gigantic waste of my life and a review that will hopefully reveal these horrifying business practices to all those unsuspecting cable-seeking fellows on Yelp.\n\nBeware.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DVWIxcfkjxri5UruYABkrQ", "review_id": "PHcYOcb3Hf18FUPgysF-lQ", "stars": 1, "date": "2010-06-10", "text": "there should be a negative rating on here.  one star is way to high.\ni am sick and tired of how the cable box is never working their solution? KEEP RESETTING THE BOX... YES IT IS MY JOB TO MAKE SURE I GET MY SERIVCE ON A DAILY BASIS.  IT'S NOT THEIRS TO MAKE SURE IT WORK.  Plus they have poor customer service but I don't blame the people that answer the phones but the people who st the rules to nickel and dime it's customers. \n\ncharter is horrible and since i coudn't get thru to complain on the phone here is my truth.  Charter is the worst.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "BD4IhPuK-DwGBQb3RzQDcQ", "review_id": "Hdng63D9qvnT1says4LMMw", "stars": 1, "date": "2010-10-11", "text": "In my opinion, Charter Communications is just terrible.  They have been unreliable, unhelpful, rude and incapable of providing an acceptable level of service.  The customer service representatives are like talking to pre-programed robots, even in the midst of a prolonged service outage, their main goal is to sell more worthless services. Avoid this company like the plague.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k42CUkU9dxyCRDlcOfsVTw", "review_id": "6wYj80QHbOGbttDC0S3NkQ", "stars": 2, "date": "2013-12-23", "text": "Later in the night, not very crowded yet they insisted we sit crowded next to another pair of people.  Service was slow, just getting a drink was an effort.  Food was poorly prepared and over cooked, or as in my partners case cold.  No way coming back other than drinks in the summer.", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "spPw301AwzOqN0nTGXqsKg", "review_id": "ZiZSCu1eQyZ21dHXpLjzzQ", "stars": 1, "date": "2014-03-16", "text": "It you're basic bar food.  Nothing more.", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "yFdFgkJJLgKKrbp9sg1NFA", "stars": 1, "date": "2008-06-28", "text": "Do you like it when your bowels want to explode?  Then this is the place for you.  The sad thing is, the aroma coming from the restaurant is hypnotizing as it drifts through the neighborhood, and the staff is really nice, but holy jeebus, does the pizza suck.  Every time we went there we spent the rest of the night in the bathroom.  Awful.", "type": "review", "business_id": "zOc8lbjViUZajbY7M0aUCQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "011Ny5tOdSs_ZI_EzILaRA", "review_id": "ugxo0iHxlK1nPo-rM15u0g", "stars": 1, "date": "2013-05-07", "text": "Awful, awful, awful...  The worst of the worst of the cookie-cutter Chinese restaurants.  Food without flavor, a menu without imagination and a staff of such profound indifference it's hard to tell they're even there.", "type": "review", "business_id": "UgjVZTSOaYoEvws_lAP_Dw"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "MQPvn-sKbAqLS4tNtb8t1Q", "review_id": "k23vlH_rM4IwmRFrVmCOdQ", "stars": 1, "date": "2013-11-24", "text": "Tried this because it's local.  Terrible, bland Chinese food.  Not much else to say.  Will never return.  My wife wanted me to mention her sweet and sour chicken, which was battered fried chicken pieces with a side of sauce in a bowl.  When she asked where the vegetables were (like the picture), she was told there is a piece of pineapple in the sauce and that is what comes with it.  As promised, we looked hard into the sauce and found one very small piece of pineapple.  Bon Appetite.", "type": "review", "business_id": "UgjVZTSOaYoEvws_lAP_Dw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6UfRC8Sw8z7EcYPIWtl1ig", "review_id": "Kl5i17yln4ZQ9vd3gst39g", "stars": 2, "date": "2010-12-04", "text": "I gave two stars, 1 star for the nice behavior of owners who welcome you into the restaurant with a smile and another star is the ambiance and my kiddo loved it.\n\nWorst service. waitress (an Asian women) was very rude and made me feel like we are not welcome there. \n\nmy two cents, if you are not a white man, please find a Dennis or Perkins and don't even bother to go to this place. \n\nI never wrote a review as bad as this and this place deserves it.", "type": "review", "business_id": "j515klfbCAEF3KPiKvHz9g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vU4N-TaRwk5GtAc97_wx9A", "review_id": "7lM4JHh-gzw9uTx5Z-AJSw", "stars": 2, "date": "2013-12-09", "text": "Kind of makes me feel like I' inconveniencing them.  I get left so they can help others.  I don't mind waiting, but when its my turn, then I am the person that should get the help and the other people should be told to wait.", "type": "review", "business_id": "ImBOmnSOb1ajWskhQyaa4Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pABc641OSh-3QANyWPdu7Q", "review_id": "pyQm4tzzRKgSFNe38CqIgg", "stars": 1, "date": "2013-08-15", "text": "I'm 20 years old.  The last exam I had was when I was 17-18 at planned parenthood.  When you go into their offices for birth control they basically make you do an exam when you go in.  Well, I needed a new gynecologist and my boyfriend's mom recommended Central Phoenix OB/Gyn.  Since I hadn't gone to a professional before (besides planned parenthood) I thought I would give it a try.  The receptionist is VERY rude.  When we first got there we had to stand at the counter for 15 mins before she came out to give me my paperwork.  Her attitude isn't very welcoming, which is what pushed me away in the beginning.  First impressions are very important.  I had set an appointment with the Doctor, but come to find out that she wasn't in the office and they would have to schedule it with the NP (Nurse Practitioner).  I didn't get an exam like I was told, but she consulted me on my birth control and they took a STD test just so I could feel certain that I didn't have any.  They gave me a small discount for not being able to see the doctor ($185 Without insurance) and told me that they would contact me with the results from my test on Monday (a week from when I went).  Monday came and I got no calls.  I had another appointment scheduled not too far from then, so I decided to wait until I went back to the office.\n\nThe second visit I was scheduled with a doctor (that I did see that time) and was greeted by the oh so friendly receptionist.  I was told that they didn't have my test results (They LOST them) and that I would have to do another and they would take care of it.  They DIDN'T do any exam (AGAIN!) even though I was scheduled for it (I haven't had an exam for about 3 years now).  She just consulted me on the birth control and sent me on my way.  I had many questions, I have been having a lot of pain in my lower abdomen which is why I needed to be checked, and she just seemed to be rushing through all of them with no care.  I told her I was frequently urinating and I haven't been drinking a lot of water.  Her solution was that I was drinking a lot of water (I thought I just told her I didn't drink a lot) and that everything was fine.  I was a little frustrated, but that's fine.  I got to the front desk and I had to pay $250 for a consultation and no exam!  They called me a week later and I assumed it was for my results... NOPE.  They had \"forgotten\" to charge me, even though they told me since they screwed up the first time they would take care of it, and I had to pay another $250 for the lab!  That's ridiculous.\n\nThere are too many mistakes in this office for anyone to just overpass.\nI don't know if it's because I didn't have insurance, but they made me feel very unwelcome and like I couldn't afford anything in the office.\n\nPlanned Parenthood seems a lot more professional and welcoming... At least they give me an exam every time I go.", "type": "review", "business_id": "1acmBPmmFDovVSHHzMrJ9A"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ilbenZXokpf4ezafuUH0xA", "review_id": "jsN-FlWzo09lAvaLsPdeBg", "stars": 1, "date": "2013-11-06", "text": "I am 25 years old. I just moved to the area from Philadelphia and was looking for a OBGYN. I do not recommend Central Phoenix! My experience was terrible. The receptionist was very rude over the phone, but I decided to give her the benefit of the doubt because maybe she was having a bad day. After making my appointment I received a call a few days later that it needed to be rescheduled because the doctor was taking that day off. The lady on the phone was not apologetic about the inconvenience as I had already planned to take the day we had arranged off from work. I had an appointment scheduled at 5:30 pm however due to bad traffic I was running late. I called to let them know and no one answered so I left a message. When I arrived the receptionist at the desk was rude again and told me that because I was  little late the doctor could not see me. I tried to explain that when I called no one answered and she again was rude and unapologetic. I am currently looking for another OBGYN.", "type": "review", "business_id": "1acmBPmmFDovVSHHzMrJ9A"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "_HN8b3eZL423v8bQ7ACUXw", "stars": 1, "date": "2008-01-24", "text": "I can't seem to understand 'why' many people rate this as a first-class sports bar because in actuality, its one of the worst I've ever been in, and I grew up going to the sports books in Juarez, Mexico where their idea of a flat screen was a gabacho thumping the TV onto the sticky tile floor and looking cross at an hombre could get your eye cut out and fed to you as the special of the day.\n\nYes, Majerle's is worse.  \n\nOkay, well, no one in Thunder Dan's is gonna devour your soul, but the place makes me feel like I'm sharing a pint with Florentines Catello di Rosso Gianfigliazzi and Ciappo Ubriachi in Dante's inner ring of the seventh circle of Hell.\n\nThe set up is terrible.  The TVs are difficult to see from EVERYWHERE in the bar and they have it arranged so that if you are fortunate enough to view up to TWO SCREENS (!) at one time, they are both showing the same game.  This is a problem during major events like the NCAA tournament or bowl games.  \n\nMoreover, i would be kitten-hearted to ask a manager to change their programming to another game i'd rather watch.  \n\nThe bar is always crowded, which makes it even more wondrous for me when i actually go in there and wait for a seat just to encounter no beer specials and terrible food.\n\nI wonder how large the bowl of crack the editors at Sports Illustrated were smoking to rate this anywhere near the top 1,000 sports bars in the US.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "W3qwEhlI6aBjrsHaOiaaBw", "stars": 2, "date": "2008-06-03", "text": "Been here twice, and I cant say either time was a thrilling experience. One thing I can say as a plus is the bartenders at lunch are always friendly and quick. The food so, not so great. I can never eat it all, the portions are extremely generous, but it's never very high quality. Just kinda seems like it is coming from a slop kitchen, and not really fit for a human. The house margaritas are actually pretty good, and a fair value. I recommend hanging out with a margarita and some chips and salsa (also pretty good) and then moving elsewhere for dinner. Call me crazy, but restaurants that leave me feeling sluggish and greasy are never my favorites.", "type": "review", "business_id": "Y293fHh5SZ0_9BZm4M6BCg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "lG3C1Agp5WnreOS-7R-r-g", "stars": 3, "date": "2012-09-25", "text": "Well, it's a Michaels. Nothing particularly special there. Normally, I'd give most Michaels stores 4stars, but this one tends to be a bit messy and has the wonkiest layout of any craft store. Also, if you pop in and don't find what you're looking for, you have to loop through ALL the checkouts to exit (not just pass by one like at most similar stores). This makes me feel a bit uncomfortable if they happen to not have what I'm looking for or if I just stop in to price something, etc. \n\nOverall, a decent place. Greenway Station on the whole is a bit of a weird shopping center, but I do love that a craft store is in the mix.", "type": "review", "business_id": "YDUB7-NgjKEFn8CERLoKXQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e9ALO47DWQYlG4bICLy_yQ", "review_id": "2aXPEKQrrp0N1Vvcgpp_JQ", "stars": 2, "date": "2014-03-24", "text": "We have been shopping at this location since we moved into the neighborhood this past year. Copp's (the past year or two) has really gone down hill. We normally do our big shopping at Woodman's because it's cheaper. We'd go to this Copp's more but 1, the prices are higher MUCH higher than almost any place in Madison.\n\n Also they have a horrible time having things in stock. A lot of shelves are barely stocked (during the week even) and the signs in the frozen area are dumb, having lame pictures isn't helping me find products.  \n\nIf they updated a few things, had more things in stock and even regular items in stock I'd give a better rating. Also the parking lot is pretty dim/dark. Makes me feel unsafe.", "type": "review", "business_id": "ZjwZIQM4TfFO7T7ck7FtYQ"}
{"votes": {"funny": 5, "useful": 5, "cool": 2}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "X-bkFc7cjzlwjRV4QAkWUw", "stars": 2, "date": "2013-01-21", "text": "Zoinks.\nYou know how you drive by a place over and over and think... \"Man why haven't I tried that!\" Weeeeeeeeeeellllll it kills me to say but sometimes it's for the best. After tripping up and down Atwood for 5 months going from here to there, I finally bit the bullet and gave them a try. While the woman (owner I assume) helping me was lovely, the food was all Wong. Sorry. Bean sprout overload populated the chop suey (a safe choice I thought because its so standard), the eggroll lacked flavor outside of the peanut butter used to seal it and the egg foo young which was a guilty pleasure staple of carry out growing up made me feel GUILTY, like really guilty for consuming it. Oily and in an all too rich sauce, it just didn't jive with my belly. I'd say I will go back, but honestly I feel like I went pretty safe, pretty standard. I'd be afraid to try again and branch out.", "type": "review", "business_id": "uzJ2Vefb951El2oneQI8NQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WDGHEIPGtOfCXNFarC30qA", "review_id": "dzSc6HK1EmyEzY_JgLnnqw", "stars": 1, "date": "2010-09-11", "text": "I would not recommend Joyce for bridal alterations. First and foremost, she is not friendly at all. I put on my dress for the first time since I bought it at her store, and was so excited about it. She made me feel rushed and took away from the moment. Then, she charged me $200 for bad alterations, which I ultimately took to get fixed for $100 elsewhere.", "type": "review", "business_id": "smHuQzYNOkN2CHDjLG8KBA"}
{"votes": {"funny": 6, "useful": 4, "cool": 5}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "JMIJht7Q5GX_NSiSrTEOsA", "stars": 1, "date": "2008-01-29", "text": "The McManager sucks.  (he wouldn't run his store Safeway card for me!)\n\nThe debit/credit card swipers suck! (they don't fit in their holders and they must use a freakin' dialup modem they are so God Damn slow)\n\nThey once completely ran out of MILK!\n\nTheir change machine was down for well over a week!\n\nI swear to God, if  there were any alternative in the vicinity I'd GLADLY pay twice the price to shop there! \n\nRevamped store is nice to look at, shitty to shop at!  \n\nNow with free Wi-Fi! \n\nEAT ME!", "type": "review", "business_id": "7Z7IkR_-94AjUuDw0fbI7g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IkC2BKzADqgPlvaac5gRHg", "review_id": "l_ebk788HDecd6__CHiJTg", "stars": 2, "date": "2012-08-27", "text": "Ugh - stopped in here before a Diamonbacks game and quickly left after a beer. It's tiny, cramped (but not in a fun, packed house kind of way), and so very dark. It was kind of a mood killer. They do have a patio but didn't have the misters on and weren't serving out there. With all the beautiful weather we get in Arizona, I hate being cooped up in dark small places.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "EZEYk3Mf51BtQzPeGE7h7A", "review_id": "qTgvfko7CmEeAdF2qYXFfQ", "stars": 2, "date": "2012-09-19", "text": "PASS...\n\nVery mediocre food when surrounded by a lot of great options.  I can't believe the food network came here?!", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "oPwFc3ae4Rh8JT7xfumOVQ", "review_id": "yRziuUtFQPP8yHiAvJ5OdQ", "stars": 1, "date": "2012-09-24", "text": "Was told this is the best place in downtown Phoenix to catch a game. It's not. They play crappy music instead of the sound from games, food is typical sports bar junk, and drinks are expensive. On top of that the crowd is pretty crappy unless you like washed up jocks acting like they own the town. If that's your thing, this is your spot.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "REfQIccdKSVnEPr3Bnucwg", "review_id": "uAnAb1zL7Rjd2qyMrnfWVA", "stars": 2, "date": "2012-12-03", "text": "\"My vodka soda tastes like water. Lame.\" July 5th 2012\n\nYeah, this place was pretty mediocre...which says a lot considering how uninteresting Phoenix is at night.\n\nThe place was packed, the drinks were pricey, and the waitress made sure to let us know after we sat down that we had to go to the bar to order our drinks as she was off duty. And...my vodka soda tasted like water.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JRNFrfiiuHpWpZJgt6ERYw", "review_id": "ylQn6EQDkHbEvQaeSlCIOg", "stars": 1, "date": "2014-04-05", "text": "The only good part of this place was the welcoming hostess. after the waiting staff and managerial staff, the waitresses were horrible. I felt disrespected and unwelcomed once I entered the door. Managers were very disgruntled and unhelpful... Anissa and Amy's skills should be in question. As a military service member I have never felt more disrespected when visiting an establishment. I will never talk positive about this bar and grill.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "NszHFzBLd0mVQ776zck4DA", "review_id": "z5iOFmGvrY0aHEgi_jqS_w", "stars": 1, "date": "2012-07-29", "text": "Another dismal review for this company. I called for a 6 AM pickup to the airport like I had several times previously. Dispatch informed someone would arrive. I waited until 6:10 AM and called again-dispatch then told me another 15 minutes until pickup! I stated that was not acceptable as I had a flight to catch. I ended up driving myself to the airport. Oh yeah, the driver called, as boarding for my plane started.", "type": "review", "business_id": "yR3U7jOgoD0V0sGovuyt0Q"}