{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "-TsVN230RCkLYKBeLsuz7A", "stars": 4, "date": "2012-02-14", "text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "stars": 4, "date": "2012-03-02", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MDiCwtVo-Aq9cD5bAKd8Lw", "review_id": "Vqkv071v8vLA2ux8aOeICQ", "stars": 5, "date": "2012-03-12", "text": "hands down one of the best breakfasts my wife and i have had. stopped in here based on the positive reviews from fellow yelpers and was sure glad i did. \n\nthis is a good sized diner at a truck stop. the first thing that caught our eye was the pastries - they were all huge and all looked great. tip - be sure to save space for at least one. \n\ni went with the cinnamon roll french toast and was very pleased. very large portion and great taste - go witht the sausage patty over the links. people behind us had links on their plate and they didnt look too appetzing. the patty was good. \n\nwife went with a chicken friend steak, eggs, and hashbrowns. hashbrowns left a bit to desire but they get bonus points for being real potatoes and fresh. \n\noverall, great experience and we were in and out in 35 mins so we could continue out journey. looking forward to stopping here again sometime soon.", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bld8sdbL48rJzVXo4yMYWA", "review_id": "kAFG3i8DsfTkJePPEMc9Ig", "stars": 5, "date": "2013-05-07", "text": "Don't be fooled because it's in a truck stop, truckers know where there are good places to eat. Stop here just for the desserts, I bought an eclair that must have weighed a pound, delicious, like they are supposed to be made. Cream Puffs look like they wouldn't fit in a one pound coffee can... grin. Don't miss this place...", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LVW_8tSvxMgIOaTeOvtteA", "review_id": "-pKx6W2dN6xCFA8ZIe-sOQ", "stars": 4, "date": "2010-10-06", "text": "We ate there several weeks back so the details are a bit thin, but I do recall that the service was good and we enjoyed the burger, club sandwich, and ham and cheese our group had.  Its exactly what you'd expect for a good supper club.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uu5qlI41K1g30bZpNhgRKg", "review_id": "9eglfNPoaJVjBIsTpExTdw", "stars": 4, "date": "2010-11-27", "text": "Under ordinary circumstances I'm not a breakfast person.  However, the morning after Thanksgiving, it was obviously time to consume more food, so off to the Green Lantern we went.  And a good thing too...I had the best breakfast I have eaten in recent memory, and left totally impressed (and full).\n\nBreakfast foods are simple foods.  Many places take advantage of the simplicity by rushing things along.  You end up with edible but uninspired eats.  Though my breakfast arrived shortly after it was ordered, it was cooked properly and with care.  My sunny side up eggs were perfectly done, the whites well set and the yolks warm but properly runny.  The four (!) large slices of bacon were thick and flavorful.  I ordered the hash-browns crispy, and that's how they came.  Everything on the plate was cooked just right and tasted super good.  I could almost like eating breakfast out, if every place served breakfast like this.\n\nService was fast and friendly.  Coffee was the usual diner style, weak and plentiful.  The bar looked capable of producing a solid bloody mary, but alas this went untested.  Prices were as cheap as the day is long.  I'm docking a star for the corn beef hash--it lacked flavor and that all important crunch.  All the same, I still highly recommend the Lantern for your breakfast needs.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rL7XG25E24mErfg9sZ_-wA", "review_id": "dexeF9_xWX_96Zm63Q7zSQ", "stars": 4, "date": "2011-08-23", "text": "We love The Green Lantern. The food is wonderful and the price is great. We have never had a long wait for a table and once we are seated we are always waited on right away. All the staff is very friendly and atmosphere is welcoming. We have taken several friends here for dinner and always have a great time.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jv6lq527bHVW1EbrqzZXag", "review_id": "fDkHtO1eBepMZoV-qmru3g", "stars": 5, "date": "2012-02-08", "text": "We love this place!  This restaurant has excellent food!  It has been family owned for years and that is what makes the difference.  Love being regulars here!  Friday night fish fries are always good.  Scallops are really worth trying.  Salads are always fresh.  Chili is very thick and meaty. This place and staff are always welcoming even when you arrive by boat!  Highly recommend it.  Be sure to  check out their specials on their awesome website!  http://www.thegreenlanternrestaurant.com.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmSPy_RTZArCirAqWsVP6w", "review_id": "3MpetbHOSk0-e0yeAM6K1Q", "stars": 4, "date": "2012-03-18", "text": "Have eaten here several times,most recently this morning..Food has always been good but todays breakfast was exceptional..I had eggs and walleye.Large piece of walleye,flaky,lightly breaded,and delicious! Companion had lobster benedict special which was raved about..To top it off the service provided by April was outstanding....", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWEDVOMa0X4Qhw4wropxig", "review_id": "xOO8goBBxpYexbUxOIRj7Q", "stars": 5, "date": "2012-04-11", "text": "Life is good. In bloody mary heaven. Joy's not bad either :-)", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0mwYO5iiTpzWnaSjuKWMIQ", "review_id": "oNGB_xrmru6V1cZ3dNgOiA", "stars": 5, "date": "2010-11-17", "text": "Amazing Friday night FISH FRY! I got out a lot for fish fry's in Madison and the surrounding area and this still remains my favorite. I usually get the Cod dinner, which is always cooked perfect, not too soggy or too crispy, which comes with a side AND a soup or salad for only $9.95. I always recommend the Beach House when someone is looking for a GREAT fish fry! :)", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4e-IyxRdWBO0Ak88yyacw", "review_id": "wiX8pNAzAhpxwmvYfIMnIg", "stars": 4, "date": "2011-02-23", "text": "This place has good steaks,and fish fry. I also like the saturday special bacon wrapped filet, with lobster tail,all for 24.99 I think? All the dinners come with soup or salad, potato choic,warm rolls w/ butter. Walleye,cod,bluegill are all delecious. Good place for a beer as well. Great view, and drink specials. This is a real Sconnie place,Wisco to the core. My fave Fish Fry spot for sure.", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "C6jV8yFHlfZLWvsysaQ0VA", "review_id": "SYYjswplCko1HyE-ZGdocg", "stars": 5, "date": "2010-04-20", "text": "I have no idea why no one has reviewed this awesome B&B but i'm excited to be the first...perhaps no one wants to let anyone in on the secret...and i thought about not writing the review for that same reason but i have to share this one with my fellow yelpsters. I wanted to celebrate the wife's bday with a quick getaway but didn't want to stay in the usual hotel. so i popped \"lgbt friendly B&Bs\" into google and this place came up. they had a few rooms to choose from but of course the one with the hot tub in the room caught my eye first. i emailed them through the website and the owner Craig got back to me quickly. I reserved the room and then just had to wait until the day arrived. Even though we were arriving earlier than the 3PM check in, Craig was awesome and left a personalized letter and the keys to the house in the mailbox for us to let ourselves in. we put our stuff in the room and when we came downstairs the owners, Craig and Cathy were there and welcomed us to the house, even remembering that we were there for a surprise birthday trip. the house was clean and the room was nicely done. it was definitely more cozy than any hotel room could have ever been, the bed was so comfortable we almost napped thru our dinner reservation! the hot tub was definitely the highlight of the Mentor room, the massage jets were awesome and were so relaxing! in the AM Craig made an awesome breakfast complete with bacon, an egg souffle and a homemade Kringle that was absolutely delish! i couldn't have picked a better place to celebrate my gf's birthday! from the second i made the reservation until the moment we checked out, Craig and Cathy made us feel at home and provided top knotch service to us. If I'm ever in need of a quick getaway to Madison I know exactly where I will stay!!", "type": "review", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R-kP641Frh1NUAftXUAEJA", "review_id": "jdArepQVwaKx7PSl0A8RKA", "stars": 5, "date": "2011-11-08", "text": "Goodbye Hotels!  After this cozy little place I'm a bed and breakfast faithful.  \n\nOur host, Craig, was wonderful.  It was super easy to make the arrangements and the website was helpful.  The place itself gave me the same joy I remember having when I would go see grandparents as a child.  That feeling of a warm house.  Oh, did I mention that when we first entered the whole house smelled of breakfast from that morning.  \n\nThe bed half of the name was extra comfortable and the room was very relaxing.  We stayed in the Sorenson room, which was a little larger and had a couch.  They offered a small bookshelf of books and Madison magazine (which helped us to find our restaurant the next day).  The Sorenson room also offers a private bathroom with a claw-foot tub that is over 110 years old (but has excellent water pressure).  Shampoo, soap, body gel, bath salts (I think that's what they were), and even a hairdryer are all provided.  This was nice since we forgot a couple of those things.  \n\nFor the breakfast portion, we had a spinach and cheddar quiche that was the fluffiest damn quiche I've ever had.  Pardon my French! My fiance is a Vegetarian and it was extremely easy to make.  He also had a myriad of drink options.  Some ready to be poured, some in waiting.  Also, for me (the non-vegetarian), he made an incredible side of bacon.  It was sprinkled with brown sugar and then generously peppered.  Then it was baked.  Then it was devoured with great speed.  Seriously, this was heavenly.  Also, there was a delicious pear and cranberry compote for each of us. \n\nCraig and his beautiful (and friendly) dog joined us for breakfast and some wonderful conversation.  He is a true gentleman and an excellent host.  \n\nMy fiance and I are planning another trip in the spring and we'll be sure to stay with them again.  I could't recommend this place enough.", "type": "review", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LVW_8tSvxMgIOaTeOvtteA", "review_id": "DwiXg11ZgnlF4GAfQ0yDuw", "stars": 5, "date": "2010-10-06", "text": "We went there for the first time yesterday, and I would definitely recommend Spartan Pizza.  Here's why:\n- the crust is thin, crunchy on the bottom, chewy on top\n- the sauce is sweet and savory\n- the cheese is rich and delicious\n- the veggies were fresh and tasty\n\nWe ordered the Canadian bacon deluxe (with onions, green peppers, green & black olives, and mushroom too I think).  The Canadian bacon tasted like real meat and is among the best I've had ... not at all like that heavily processed stuff you usually get at the store.  The CBD is naturally quite salty from the bacon and olives but I like that.\n\nWe also had the small salad which was just iceberg lettuce and tomatoes, but what can you expect for $2?  I'd bet the pizza salad is much better.\n\nThe service was casual and friendly.\n\nIn regards to the atmosphere, we ate in the parlor booth area which is clean enough and family-friendly but quite dated in appearance.  We left through the adjoining room which is a bar that has been added on and is much more modern and was populated by locals drinking and eating dinner around the bar.\n\nI should also note that the plates for eating pizza are plastic.  This is a \"no frills\" kind of place.", "type": "review", "business_id": "zOc8lbjViUZajbY7M0aUCQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jQtmbZmOvfYb4lAkoXMCkQ", "review_id": "qWHIBzDnJpX32D2NpTyRsw", "stars": 5, "date": "2013-04-16", "text": "Best Chinese food madison! I've tried them all and make the 15 minute drive every week :-)", "type": "review", "business_id": "UgjVZTSOaYoEvws_lAP_Dw"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "oRi4cSfHDjrpdZdaYZ6nJg", "review_id": "MnENKSBiH9_ILkt2FxQouw", "stars": 5, "date": "2007-10-12", "text": "i love grocery stores.  a decent place to shop for food is the mark of a town's liveability.  (believe me, i know--i lived in florida with nowhere to shop but publix.)  upon settling in the jenny spaight area, the search for groceries began.\n i have two rules:  i want to shop in my neighborhood--preferably locally owned, and i want to be able to do 90% of my food/beer buying in one place.  now certainly, being the good isthmus dweller that i am, i cherish the co-op.  problem is, i have a serious diet coke addiction, as well as a lust for some other salty, fat-laden goodies, which means that the co-op doesn't satisfy rule number 2.  \nthen, i discover jenny street market.  it is love at first sight.  a small, locally owned grocery store full of friendly faces and nifty food finds.  what more could i want?  decent array of produce? check. fine selection of cheeses?  it's wisconsin.  fage yogurts?  um-huh.  more ice cream than you can shake a stick at?  got it.  fancy crackers (i am a sucker)?  yep.  a walk-in beer cooler, complete with jackets for comfort? oh yeah.  nonni's biscotti?  yes ma'am.  and of course, diet cokes.\ni love the neighborhood grocery.  makes me feel at home.  prices are a bit higher (so i hear) than woodmans (never been) or some of the other bigger stores, but i feel good supporting local markets.  selection may not be as vast as the biggies, but the bottom line is if i can't find it at jenny's, i don't need it.", "type": "review", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1FsUY1f4MZmPHdrwYZ6V3w", "review_id": "2ueWVgacIwsV-bDzRkVOpw", "stars": 5, "date": "2014-05-31", "text": "Parsonage was a perfect fit for my recent trip. What it is: warm, quaint, charmingly old, affordable, homey, accommodating of diet. What it is not: posh, uber-modern, sleek, extravagant.\nHas wifi. Has a (very well-mannered & clean) dog. Street parking. Does not have private bathrooms for each room, so be sure to check on that when booking if it's important to you.\n\nCraig the owner and Coriander the springer spaniel were a warm greeting party. Craig went out of his way to make me feel comfortable with the house, the amenities, where to find him if I needed something, etc. I called him later that night after I realized I had accidentally left without a key, and he told me exactly where he would hide one outside for my return. It felt less like paid lodging, and more like staying with distant relatives. \nOur group had some gluten-sensitive members and some lactose-sensitive members, so Craig made sure that each breakfast had options for everyone. One morning, the power went out around 5am before he could cook the breakfast casserole, so he ran down to a bakery and brought back an improvised meal of fruits and a kringle (?), a local specialty. The weather was nice, so we spent plenty of time on his newly renovated screened-in porch listening to music while we sipped coffee and rubbed Coriander's belly.", "type": "review", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "fkFP5xIO9x7EwptpRcdAnQ", "stars": 5, "date": "2013-07-30", "text": "This is going to sound very weird:  I actually look forward to bringing my Acura in for service here.  There.  I said it.  Why? They are extremely efficient, and they manage to make me feel like a rockstar every time I go in.  Now, I love my little Acura--but having a fling with one of the brand spanking new, sporty little numbers they provide as loaners makes the whole experience feel adventurous and decadent.  Even though I'm dropping lots of moulah on a brake job.  And I have to give the car back.", "type": "review", "business_id": "9brW55Vzyi3ItboHWfoepg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "2vONxrH0Y_RguMvUCGhzig", "stars": 4, "date": "2012-12-02", "text": "I haven't been to this location as much as I have some of the other locations but I do enjoy this location. Again they are all kind of the same in a sense but its about the interior and the experience. I actually quite like the people who work at this location. I have seen the same people working here for a while now and they always make me feel so welcome. They are usually a couple of early 30's to middle aged women working here that make ya feel like mom is welcoming you home. \"What can I get ya hun,\" \"How's your day going sweety,\" that kind of stuff. And some people may not like that but I enjoy it because it makes you feel way more comfortable to be somewhere. They are always fast and efficient and any extras you may want are stocked plentifully. The one small thing I don't like is that they are tucked away and really have to be looking for it to know where it is and it is sort of a small building. It can get really cramped if there is a line in there and pushed against some of the valuables. Nice place to stop after some shopping if ya know where it is.", "type": "review", "business_id": "3jpKGDkFrCHpjEYVEgcG0A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EgBU9oKVNCTzvvZmdqCOzg", "review_id": "6Vk8J-29fYCtcVDBGs1a-Q", "stars": 5, "date": "2014-07-01", "text": "The clinic itself is very, very nice. They had Frozen playing and just about any good magazine you'd want to read in the waiting room. Everyone was very friendly and went out of their ways to make sure I was comfortable at all times. \n\nDr. Brent could have easily said I need a few new fillings--how am I to know? That makes me feel like they're serious about their work and not in it for the money. I know a few people who have been told they need work done when they didn't. I trust that the Killians don't do that. Dr. Brent also seemed to know his stuff. \n\nI don't even like the dentist and I'm looking forward to going back!", "type": "review", "business_id": "GHvLvSN_imiXxqsgFPskWA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-lNQ1ZXMbf8JZZYHiMCfrw", "review_id": "t2tRVl7YCVuTAODzAlBz5w", "stars": 5, "date": "2013-04-22", "text": "Seriously, I love this place! I wish I could give them ten stars! I've got three corgis and after a co-worker referred me here in 2009, I'll never go anywhere else. Every vet my dogs have seen is wonderful...between the three pups I've met with three of the doctors. They're all sincere, empathetic, thorough, understanding, engaging, respectful, and love to share their knowledge. Dr. Haroldson is a sweetheart and can probably put any nervous pet-parent at ease. Dr. Erickson is calm and laid-back, and I can talk to him about even the most awkward pet problems. Dr. Schweitzer is lively--a total hoot. Anyone who likes The Walking Dead AND Downton Abbey is alright in my book!\n\nAll Pets has been able to see me with very short notice, has never rushed me in and out the door, and always made me feel like my dogs were their top priority, even on busier days. They communicate clearly about diagnostic and treatment options. Their prices are very reasonable, and they try less expensive solutions first, instead of immediately recommending the most costly. Not that I'm cheap, it's just that having three dogs adds up. When they weren't 100% positive about something, they aren't afraid to ask each other for second opinions, which I appreciated when my dog Harry swallowed a corncob and had to have emergency surgery.\n\nThat's another thing I love about this place, is that they remember all my dogs names when I walk in the door. Not only the vets, but the front desk staff. Maybe it's my fiction-writer's imagination, but they really make me feel like a VIP. Kenna is always so excited to greet my pups and I love hearing about hers. Dana has a killer sense of humor and if you're lucky, she'll grace you with one of her zingers. Having three rambunctious corgis that get into trouble (catching rabbits and getting worms, swallowing corncobs and needing surgery, attacking car windows and breaking teeth, spraining toes from too much running) means I get to visit more often, and I honestly do not mind at all.", "type": "review", "business_id": "9874O-3GjXPotxYKNNAz5Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "USbxNPSJfLIKAdt10kZs3Q", "review_id": "hHyBXfh7e0opV9_1eiXTMQ", "stars": 5, "date": "2014-03-16", "text": "If you're looking for a super fancy place, keep looking...this is your typical neighborhood tavern and it made me feel like I was back home in the Milwaukee area.  The best burgers in Madison...hands down!  Good fries and cheese curds too...they had a number of other dishes that sounded yummy too.  Super friendly staff.  We will definitely be back!", "type": "review", "business_id": "G1qUGBNYNS220jKlPAlFsA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MtmXN0QIW5xQtTmUvJsejg", "review_id": "rtgTWuQ92txClX2t8IToSg", "stars": 5, "date": "2014-06-13", "text": "Their rates are very reasonable, the staff is friendly and helpful, and on the extremely rare occasion that any issue arises, they take care of it promptly and beyond my satisfaction.  \n\nI've never really had a bad experience with Enterprise, but this location in particular is just full of really nice people.  Fatima in particular is so sweet, remembers my name and where I live, and goes above and beyond to make me feel like a valued customer. \n\nIt's really nice to feel like employees of anywhere recognize you as a good customer and treat you with mutual respect, kindness, and reward your loyalty. We all know that the squeaky wheel gets the oil, so it's nice to see positive karma reinforced at Enterprise. \n\nOnce they called me to let me know I had left a burned cd in their disc player and offered to drop it off with me while they were out doing their pick-ups. WHO DOES THAT? These guys do. Because they are awesome.\n\n Another time, there was a bit of a wait (they were insanely busy just before a holiday weekend, but still smiling and keeping it cool, even though I could see the exhaustion in their eyes) because they were backed up on getting their cars cleaned on the inside before they could ok them for rent.\n I told them I didn't really care, had no one to impress, and they could give me a dirty car as long as there wasn't literally bodily fluids inside it. Save yourselves a few minutes on cleaning that, I'm probably going to put new trash and crumbs in it shortly anyway. \n\nThey looked at me, and told me that they appreciated my sentiment and apologize for the wait, but they would feel bad about giving me a crumby car. So, tell you what. Lets just bump you up the list of cars and give you a free upgrade to a higher class of car, of which we already have one cleaned and ready.  I said that wasn't necessary, I wasn't in a rush.  They said they wanted me to have it, because I was so nice and a good customer besides. Well. I guess if you insist on a free upgrade... I'll take it. \n\nI like that the corporate Enterprise seems to value this sort of behavior in it's employees, and fosters a positive work environment. From talking to their reps, it seems like they work hard, but are fairly rewarded for work well done. And it shows. East Washington Enterprise is great.  And, of course, they pick you up. :)", "type": "review", "business_id": "R6ojvMJvskHGBbtednMQ1g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I3WDCb4CjDSRQA4ObXtMYw", "review_id": "EFMkgbigTo2-GpJhxS5DXg", "stars": 4, "date": "2012-07-24", "text": "Clean and quiet room --  no traffic or jet noise.    There is a walkway directly from the Texas roadhouse, makes me feel little home!.\n\nI find these arrangements to be much quieter and typical of a higher end room.   The room also has a small microwave and refers.  The nice lobby has a restaurant/breakfast area, and a somewhat separated lounge area.\n\nThe updated and modern furnishings are always a great touch.  The beds are soft, and the staff is always ready to bring you extra pillows, should you need them.  The free breakfast is great and saves me a couple bucks, from spending it elsewhere on grub.  The best part is that is completely non-smoking, so there are no smoke odors in the rooms. \n\n With a complimentary shuttle, to the surrounding areas, you can't go wrong. I wanted to pay but it was WELL WORTH. I have no problem paying the rate again. The staff was awesome and more than welcoming. The bed, after an hour of drinking, was INCREDIBLE! Do not hesitate to stop here whether you're travelling or just need a weekend convenience! Thank u", "type": "review", "business_id": "i9JeI7bd1qXGi15FoD45GA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XHuEbGrgPEhnBRjRUdcSgg", "review_id": "AJNclcjSCf-pFUUl0KdpOA", "stars": 4, "date": "2010-01-13", "text": "Monty's goes back a very long time in Madison and is a great place to get a home-cooked style meal.  I used to go with my parents as a kid, and now as an adult I've started to rediscover how much I loved their food.\n\nNestled in the eclectic Atwood Ave neighborhood, Monty's presents a 50's style diner with yummy lunch specials like meatloaf (very good meatloaf), sandwiches, and a wicked good brunch.  They also have ridiculously delicious chocolate shakes, so don't be afraid to splurge while you're there.  \n\nOne of the other great things about Monty's is the atmosphere; the area around it is filled with little mom and pop shops, the Barrymore theater, and relics of an older time.  Take a stroll around if it's a nice day and your bound to find something you like.  If not, I'm sure you probably enjoyed the food as all the dishes I've ever had were great and the portions were generous.\n\nThere are a few drawbacks though that held me back from giving a 5 star review.  First, there is usually a very long wait.  The place is popular, but I don't feel that the food and eastside location (I live far westside) always justifies the overall experience.  Secondly, the service is hit or miss.  I've had some waitresses who were prompt and polite, making me feel right at home, and others who were sarcastically rude to the point where people in my party almost had to say something.  Furthermore, the kitchen doesn't always look clean, as trays of biscuits have been left sitting out and flies have been a buzzing.\n\nSetting all those things aside though (which I know may be hard for some), the blue plate is a Madison delight that should not be missed.  The food is so good you'll be stuffed in a recliner when you get home pining for more.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
