{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RdZwXJY6IlCcnLdJPH25yQ", "review_id": "7YZfA6cRVhvxuRZvKr9Q8Q", "text": "Loved my haircut. Walked in and waited for just a minute. The stylist cut exactly like I wanted and I walked out paying 20 which included the tip.", "business_id": "JoZsAxRCwzkBI6MAfjSu_Q", "stars": 5, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "-TsVN230RCkLYKBeLsuz7A", "text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 4, "date": "2012-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MDiCwtVo-Aq9cD5bAKd8Lw", "review_id": "Vqkv071v8vLA2ux8aOeICQ", "text": "hands down one of the best breakfasts my wife and i have had. stopped in here based on the positive reviews from fellow yelpers and was sure glad i did. \n\nthis is a good sized diner at a truck stop. the first thing that caught our eye was the pastries - they were all huge and all looked great. tip - be sure to save space for at least one. \n\ni went with the cinnamon roll french toast and was very pleased. very large portion and great taste - go witht the sausage patty over the links. people behind us had links on their plate and they didnt look too appetzing. the patty was good. \n\nwife went with a chicken friend steak, eggs, and hashbrowns. hashbrowns left a bit to desire but they get bonus points for being real potatoes and fresh. \n\noverall, great experience and we were in and out in 35 mins so we could continue out journey. looking forward to stopping here again sometime soon.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bld8sdbL48rJzVXo4yMYWA", "review_id": "kAFG3i8DsfTkJePPEMc9Ig", "text": "Don't be fooled because it's in a truck stop, truckers know where there are good places to eat. Stop here just for the desserts, I bought an eclair that must have weighed a pound, delicious, like they are supposed to be made. Cream Puffs look like they wouldn't fit in a one pound coffee can... grin. Don't miss this place...", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LVW_8tSvxMgIOaTeOvtteA", "review_id": "-pKx6W2dN6xCFA8ZIe-sOQ", "text": "We ate there several weeks back so the details are a bit thin, but I do recall that the service was good and we enjoyed the burger, club sandwich, and ham and cheese our group had.  Its exactly what you'd expect for a good supper club.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uu5qlI41K1g30bZpNhgRKg", "review_id": "9eglfNPoaJVjBIsTpExTdw", "text": "Under ordinary circumstances I'm not a breakfast person.  However, the morning after Thanksgiving, it was obviously time to consume more food, so off to the Green Lantern we went.  And a good thing too...I had the best breakfast I have eaten in recent memory, and left totally impressed (and full).\n\nBreakfast foods are simple foods.  Many places take advantage of the simplicity by rushing things along.  You end up with edible but uninspired eats.  Though my breakfast arrived shortly after it was ordered, it was cooked properly and with care.  My sunny side up eggs were perfectly done, the whites well set and the yolks warm but properly runny.  The four (!) large slices of bacon were thick and flavorful.  I ordered the hash-browns crispy, and that's how they came.  Everything on the plate was cooked just right and tasted super good.  I could almost like eating breakfast out, if every place served breakfast like this.\n\nService was fast and friendly.  Coffee was the usual diner style, weak and plentiful.  The bar looked capable of producing a solid bloody mary, but alas this went untested.  Prices were as cheap as the day is long.  I'm docking a star for the corn beef hash--it lacked flavor and that all important crunch.  All the same, I still highly recommend the Lantern for your breakfast needs.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2010-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rL7XG25E24mErfg9sZ_-wA", "review_id": "dexeF9_xWX_96Zm63Q7zSQ", "text": "We love The Green Lantern. The food is wonderful and the price is great. We have never had a long wait for a table and once we are seated we are always waited on right away. All the staff is very friendly and atmosphere is welcoming. We have taken several friends here for dinner and always have a great time.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2011-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jv6lq527bHVW1EbrqzZXag", "review_id": "fDkHtO1eBepMZoV-qmru3g", "text": "We love this place!  This restaurant has excellent food!  It has been family owned for years and that is what makes the difference.  Love being regulars here!  Friday night fish fries are always good.  Scallops are really worth trying.  Salads are always fresh.  Chili is very thick and meaty. This place and staff are always welcoming even when you arrive by boat!  Highly recommend it.  Be sure to  check out their specials on their awesome website!  http://www.thegreenlanternrestaurant.com.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmSPy_RTZArCirAqWsVP6w", "review_id": "3MpetbHOSk0-e0yeAM6K1Q", "text": "Have eaten here several times,most recently this morning..Food has always been good but todays breakfast was exceptional..I had eggs and walleye.Large piece of walleye,flaky,lightly breaded,and delicious! Companion had lobster benedict special which was raved about..To top it off the service provided by April was outstanding....", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWEDVOMa0X4Qhw4wropxig", "review_id": "xOO8goBBxpYexbUxOIRj7Q", "text": "Life is good. In bloody mary heaven. Joy's not bad either :-)", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0mwYO5iiTpzWnaSjuKWMIQ", "review_id": "oNGB_xrmru6V1cZ3dNgOiA", "text": "Amazing Friday night FISH FRY! I got out a lot for fish fry's in Madison and the surrounding area and this still remains my favorite. I usually get the Cod dinner, which is always cooked perfect, not too soggy or too crispy, which comes with a side AND a soup or salad for only $9.95. I always recommend the Beach House when someone is looking for a GREAT fish fry! :)", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4e-IyxRdWBO0Ak88yyacw", "review_id": "wiX8pNAzAhpxwmvYfIMnIg", "text": "This place has good steaks,and fish fry. I also like the saturday special bacon wrapped filet, with lobster tail,all for 24.99 I think? All the dinners come with soup or salad, potato choic,warm rolls w/ butter. Walleye,cod,bluegill are all delecious. Good place for a beer as well. Great view, and drink specials. This is a real Sconnie place,Wisco to the core. My fave Fish Fry spot for sure.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "C6jV8yFHlfZLWvsysaQ0VA", "review_id": "SYYjswplCko1HyE-ZGdocg", "text": "I have no idea why no one has reviewed this awesome B&B but i'm excited to be the first...perhaps no one wants to let anyone in on the secret...and i thought about not writing the review for that same reason but i have to share this one with my fellow yelpsters. I wanted to celebrate the wife's bday with a quick getaway but didn't want to stay in the usual hotel. so i popped \"lgbt friendly B&Bs\" into google and this place came up. they had a few rooms to choose from but of course the one with the hot tub in the room caught my eye first. i emailed them through the website and the owner Craig got back to me quickly. I reserved the room and then just had to wait until the day arrived. Even though we were arriving earlier than the 3PM check in, Craig was awesome and left a personalized letter and the keys to the house in the mailbox for us to let ourselves in. we put our stuff in the room and when we came downstairs the owners, Craig and Cathy were there and welcomed us to the house, even remembering that we were there for a surprise birthday trip. the house was clean and the room was nicely done. it was definitely more cozy than any hotel room could have ever been, the bed was so comfortable we almost napped thru our dinner reservation! the hot tub was definitely the highlight of the Mentor room, the massage jets were awesome and were so relaxing! in the AM Craig made an awesome breakfast complete with bacon, an egg souffle and a homemade Kringle that was absolutely delish! i couldn't have picked a better place to celebrate my gf's birthday! from the second i made the reservation until the moment we checked out, Craig and Cathy made us feel at home and provided top knotch service to us. If I'm ever in need of a quick getaway to Madison I know exactly where I will stay!!", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R-kP641Frh1NUAftXUAEJA", "review_id": "jdArepQVwaKx7PSl0A8RKA", "text": "Goodbye Hotels!  After this cozy little place I'm a bed and breakfast faithful.  \n\nOur host, Craig, was wonderful.  It was super easy to make the arrangements and the website was helpful.  The place itself gave me the same joy I remember having when I would go see grandparents as a child.  That feeling of a warm house.  Oh, did I mention that when we first entered the whole house smelled of breakfast from that morning.  \n\nThe bed half of the name was extra comfortable and the room was very relaxing.  We stayed in the Sorenson room, which was a little larger and had a couch.  They offered a small bookshelf of books and Madison magazine (which helped us to find our restaurant the next day).  The Sorenson room also offers a private bathroom with a claw-foot tub that is over 110 years old (but has excellent water pressure).  Shampoo, soap, body gel, bath salts (I think that's what they were), and even a hairdryer are all provided.  This was nice since we forgot a couple of those things.  \n\nFor the breakfast portion, we had a spinach and cheddar quiche that was the fluffiest damn quiche I've ever had.  Pardon my French! My fiance is a Vegetarian and it was extremely easy to make.  He also had a myriad of drink options.  Some ready to be poured, some in waiting.  Also, for me (the non-vegetarian), he made an incredible side of bacon.  It was sprinkled with brown sugar and then generously peppered.  Then it was baked.  Then it was devoured with great speed.  Seriously, this was heavenly.  Also, there was a delicious pear and cranberry compote for each of us. \n\nCraig and his beautiful (and friendly) dog joined us for breakfast and some wonderful conversation.  He is a true gentleman and an excellent host.  \n\nMy fiance and I are planning another trip in the spring and we'll be sure to stay with them again.  I could't recommend this place enough.", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LVW_8tSvxMgIOaTeOvtteA", "review_id": "DwiXg11ZgnlF4GAfQ0yDuw", "text": "We went there for the first time yesterday, and I would definitely recommend Spartan Pizza.  Here's why:\n- the crust is thin, crunchy on the bottom, chewy on top\n- the sauce is sweet and savory\n- the cheese is rich and delicious\n- the veggies were fresh and tasty\n\nWe ordered the Canadian bacon deluxe (with onions, green peppers, green & black olives, and mushroom too I think).  The Canadian bacon tasted like real meat and is among the best I've had ... not at all like that heavily processed stuff you usually get at the store.  The CBD is naturally quite salty from the bacon and olives but I like that.\n\nWe also had the small salad which was just iceberg lettuce and tomatoes, but what can you expect for $2?  I'd bet the pizza salad is much better.\n\nThe service was casual and friendly.\n\nIn regards to the atmosphere, we ate in the parlor booth area which is clean enough and family-friendly but quite dated in appearance.  We left through the adjoining room which is a bar that has been added on and is much more modern and was populated by locals drinking and eating dinner around the bar.\n\nI should also note that the plates for eating pizza are plastic.  This is a \"no frills\" kind of place.", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 5, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jQtmbZmOvfYb4lAkoXMCkQ", "review_id": "qWHIBzDnJpX32D2NpTyRsw", "text": "Best Chinese food madison! I've tried them all and make the 15 minute drive every week :-)", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 5, "date": "2013-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "oRi4cSfHDjrpdZdaYZ6nJg", "review_id": "MnENKSBiH9_ILkt2FxQouw", "text": "i love grocery stores.  a decent place to shop for food is the mark of a town's liveability.  (believe me, i know--i lived in florida with nowhere to shop but publix.)  upon settling in the jenny spaight area, the search for groceries began.\n i have two rules:  i want to shop in my neighborhood--preferably locally owned, and i want to be able to do 90% of my food/beer buying in one place.  now certainly, being the good isthmus dweller that i am, i cherish the co-op.  problem is, i have a serious diet coke addiction, as well as a lust for some other salty, fat-laden goodies, which means that the co-op doesn't satisfy rule number 2.  \nthen, i discover jenny street market.  it is love at first sight.  a small, locally owned grocery store full of friendly faces and nifty food finds.  what more could i want?  decent array of produce? check. fine selection of cheeses?  it's wisconsin.  fage yogurts?  um-huh.  more ice cream than you can shake a stick at?  got it.  fancy crackers (i am a sucker)?  yep.  a walk-in beer cooler, complete with jackets for comfort? oh yeah.  nonni's biscotti?  yes ma'am.  and of course, diet cokes.\ni love the neighborhood grocery.  makes me feel at home.  prices are a bit higher (so i hear) than woodmans (never been) or some of the other bigger stores, but i feel good supporting local markets.  selection may not be as vast as the biggies, but the bottom line is if i can't find it at jenny's, i don't need it.", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg", "stars": 5, "date": "2007-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1FsUY1f4MZmPHdrwYZ6V3w", "review_id": "2ueWVgacIwsV-bDzRkVOpw", "text": "Parsonage was a perfect fit for my recent trip. What it is: warm, quaint, charmingly old, affordable, homey, accommodating of diet. What it is not: posh, uber-modern, sleek, extravagant.\nHas wifi. Has a (very well-mannered & clean) dog. Street parking. Does not have private bathrooms for each room, so be sure to check on that when booking if it's important to you.\n\nCraig the owner and Coriander the springer spaniel were a warm greeting party. Craig went out of his way to make me feel comfortable with the house, the amenities, where to find him if I needed something, etc. I called him later that night after I realized I had accidentally left without a key, and he told me exactly where he would hide one outside for my return. It felt less like paid lodging, and more like staying with distant relatives. \nOur group had some gluten-sensitive members and some lactose-sensitive members, so Craig made sure that each breakfast had options for everyone. One morning, the power went out around 5am before he could cook the breakfast casserole, so he ran down to a bakery and brought back an improvised meal of fruits and a kringle (?), a local specialty. The weather was nice, so we spent plenty of time on his newly renovated screened-in porch listening to music while we sipped coffee and rubbed Coriander's belly.", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "fkFP5xIO9x7EwptpRcdAnQ", "text": "This is going to sound very weird:  I actually look forward to bringing my Acura in for service here.  There.  I said it.  Why? They are extremely efficient, and they manage to make me feel like a rockstar every time I go in.  Now, I love my little Acura--but having a fling with one of the brand spanking new, sporty little numbers they provide as loaners makes the whole experience feel adventurous and decadent.  Even though I'm dropping lots of moulah on a brake job.  And I have to give the car back.", "business_id": "9brW55Vzyi3ItboHWfoepg", "stars": 5, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "2vONxrH0Y_RguMvUCGhzig", "text": "I haven't been to this location as much as I have some of the other locations but I do enjoy this location. Again they are all kind of the same in a sense but its about the interior and the experience. I actually quite like the people who work at this location. I have seen the same people working here for a while now and they always make me feel so welcome. They are usually a couple of early 30's to middle aged women working here that make ya feel like mom is welcoming you home. \"What can I get ya hun,\" \"How's your day going sweety,\" that kind of stuff. And some people may not like that but I enjoy it because it makes you feel way more comfortable to be somewhere. They are always fast and efficient and any extras you may want are stocked plentifully. The one small thing I don't like is that they are tucked away and really have to be looking for it to know where it is and it is sort of a small building. It can get really cramped if there is a line in there and pushed against some of the valuables. Nice place to stop after some shopping if ya know where it is.", "business_id": "3jpKGDkFrCHpjEYVEgcG0A", "stars": 4, "date": "2012-12-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EgBU9oKVNCTzvvZmdqCOzg", "review_id": "6Vk8J-29fYCtcVDBGs1a-Q", "text": "The clinic itself is very, very nice. They had Frozen playing and just about any good magazine you'd want to read in the waiting room. Everyone was very friendly and went out of their ways to make sure I was comfortable at all times. \n\nDr. Brent could have easily said I need a few new fillings--how am I to know? That makes me feel like they're serious about their work and not in it for the money. I know a few people who have been told they need work done when they didn't. I trust that the Killians don't do that. Dr. Brent also seemed to know his stuff. \n\nI don't even like the dentist and I'm looking forward to going back!", "business_id": "GHvLvSN_imiXxqsgFPskWA", "stars": 5, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-lNQ1ZXMbf8JZZYHiMCfrw", "review_id": "t2tRVl7YCVuTAODzAlBz5w", "text": "Seriously, I love this place! I wish I could give them ten stars! I've got three corgis and after a co-worker referred me here in 2009, I'll never go anywhere else. Every vet my dogs have seen is wonderful...between the three pups I've met with three of the doctors. They're all sincere, empathetic, thorough, understanding, engaging, respectful, and love to share their knowledge. Dr. Haroldson is a sweetheart and can probably put any nervous pet-parent at ease. Dr. Erickson is calm and laid-back, and I can talk to him about even the most awkward pet problems. Dr. Schweitzer is lively--a total hoot. Anyone who likes The Walking Dead AND Downton Abbey is alright in my book!\n\nAll Pets has been able to see me with very short notice, has never rushed me in and out the door, and always made me feel like my dogs were their top priority, even on busier days. They communicate clearly about diagnostic and treatment options. Their prices are very reasonable, and they try less expensive solutions first, instead of immediately recommending the most costly. Not that I'm cheap, it's just that having three dogs adds up. When they weren't 100% positive about something, they aren't afraid to ask each other for second opinions, which I appreciated when my dog Harry swallowed a corncob and had to have emergency surgery.\n\nThat's another thing I love about this place, is that they remember all my dogs names when I walk in the door. Not only the vets, but the front desk staff. Maybe it's my fiction-writer's imagination, but they really make me feel like a VIP. Kenna is always so excited to greet my pups and I love hearing about hers. Dana has a killer sense of humor and if you're lucky, she'll grace you with one of her zingers. Having three rambunctious corgis that get into trouble (catching rabbits and getting worms, swallowing corncobs and needing surgery, attacking car windows and breaking teeth, spraining toes from too much running) means I get to visit more often, and I honestly do not mind at all.", "business_id": "9874O-3GjXPotxYKNNAz5Q", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "USbxNPSJfLIKAdt10kZs3Q", "review_id": "hHyBXfh7e0opV9_1eiXTMQ", "text": "If you're looking for a super fancy place, keep looking...this is your typical neighborhood tavern and it made me feel like I was back home in the Milwaukee area.  The best burgers in Madison...hands down!  Good fries and cheese curds too...they had a number of other dishes that sounded yummy too.  Super friendly staff.  We will definitely be back!", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 5, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MtmXN0QIW5xQtTmUvJsejg", "review_id": "rtgTWuQ92txClX2t8IToSg", "text": "Their rates are very reasonable, the staff is friendly and helpful, and on the extremely rare occasion that any issue arises, they take care of it promptly and beyond my satisfaction.  \n\nI've never really had a bad experience with Enterprise, but this location in particular is just full of really nice people.  Fatima in particular is so sweet, remembers my name and where I live, and goes above and beyond to make me feel like a valued customer. \n\nIt's really nice to feel like employees of anywhere recognize you as a good customer and treat you with mutual respect, kindness, and reward your loyalty. We all know that the squeaky wheel gets the oil, so it's nice to see positive karma reinforced at Enterprise. \n\nOnce they called me to let me know I had left a burned cd in their disc player and offered to drop it off with me while they were out doing their pick-ups. WHO DOES THAT? These guys do. Because they are awesome.\n\n Another time, there was a bit of a wait (they were insanely busy just before a holiday weekend, but still smiling and keeping it cool, even though I could see the exhaustion in their eyes) because they were backed up on getting their cars cleaned on the inside before they could ok them for rent.\n I told them I didn't really care, had no one to impress, and they could give me a dirty car as long as there wasn't literally bodily fluids inside it. Save yourselves a few minutes on cleaning that, I'm probably going to put new trash and crumbs in it shortly anyway. \n\nThey looked at me, and told me that they appreciated my sentiment and apologize for the wait, but they would feel bad about giving me a crumby car. So, tell you what. Lets just bump you up the list of cars and give you a free upgrade to a higher class of car, of which we already have one cleaned and ready.  I said that wasn't necessary, I wasn't in a rush.  They said they wanted me to have it, because I was so nice and a good customer besides. Well. I guess if you insist on a free upgrade... I'll take it. \n\nI like that the corporate Enterprise seems to value this sort of behavior in it's employees, and fosters a positive work environment. From talking to their reps, it seems like they work hard, but are fairly rewarded for work well done. And it shows. East Washington Enterprise is great.  And, of course, they pick you up. :)", "business_id": "R6ojvMJvskHGBbtednMQ1g", "stars": 5, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I3WDCb4CjDSRQA4ObXtMYw", "review_id": "EFMkgbigTo2-GpJhxS5DXg", "text": "Clean and quiet room --  no traffic or jet noise.    There is a walkway directly from the Texas roadhouse, makes me feel little home!.\n\nI find these arrangements to be much quieter and typical of a higher end room.   The room also has a small microwave and refers.  The nice lobby has a restaurant/breakfast area, and a somewhat separated lounge area.\n\nThe updated and modern furnishings are always a great touch.  The beds are soft, and the staff is always ready to bring you extra pillows, should you need them.  The free breakfast is great and saves me a couple bucks, from spending it elsewhere on grub.  The best part is that is completely non-smoking, so there are no smoke odors in the rooms. \n\n With a complimentary shuttle, to the surrounding areas, you can't go wrong. I wanted to pay but it was WELL WORTH. I have no problem paying the rate again. The staff was awesome and more than welcoming. The bed, after an hour of drinking, was INCREDIBLE! Do not hesitate to stop here whether you're travelling or just need a weekend convenience! Thank u", "business_id": "i9JeI7bd1qXGi15FoD45GA", "stars": 4, "date": "2012-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XHuEbGrgPEhnBRjRUdcSgg", "review_id": "AJNclcjSCf-pFUUl0KdpOA", "text": "Monty's goes back a very long time in Madison and is a great place to get a home-cooked style meal.  I used to go with my parents as a kid, and now as an adult I've started to rediscover how much I loved their food.\n\nNestled in the eclectic Atwood Ave neighborhood, Monty's presents a 50's style diner with yummy lunch specials like meatloaf (very good meatloaf), sandwiches, and a wicked good brunch.  They also have ridiculously delicious chocolate shakes, so don't be afraid to splurge while you're there.  \n\nOne of the other great things about Monty's is the atmosphere; the area around it is filled with little mom and pop shops, the Barrymore theater, and relics of an older time.  Take a stroll around if it's a nice day and your bound to find something you like.  If not, I'm sure you probably enjoyed the food as all the dishes I've ever had were great and the portions were generous.\n\nThere are a few drawbacks though that held me back from giving a 5 star review.  First, there is usually a very long wait.  The place is popular, but I don't feel that the food and eastside location (I live far westside) always justifies the overall experience.  Secondly, the service is hit or miss.  I've had some waitresses who were prompt and polite, making me feel right at home, and others who were sarcastically rude to the point where people in my party almost had to say something.  Furthermore, the kitchen doesn't always look clean, as trays of biscuits have been left sitting out and flies have been a buzzing.\n\nSetting all those things aside though (which I know may be hard for some), the blue plate is a Madison delight that should not be missed.  The food is so good you'll be stuffed in a recliner when you get home pining for more.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2010-01-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "TMVr4sJ1yAQoaR4h_C_C7g", "review_id": "AccWAC3WPelqz5mTaWtvMQ", "text": "(This is the first time I felt the need to voice my opinion on yelp and this being such a personal matter, I hope it is useful to future women in my shoes).....As a first time expecting mom, this office has catered to all my obscure worries and fears with care. Always making me feel at ease and answering my questions to fulfillment. I had the unpleasant event of waking up with a kidney stone at 3 a.m. To make matters worse, try typing in \"contracting lower back pain, third trimester pregnancy,\" on the web, instant scare considering I am only 29 weeks. I  called the after hours number and my call was returned by Laura, literally within two minutes. She calmly instructed me to go down to maternal triage at my hospital. I was greeted by Dr. Thompson, who just so happened to be hanging out at the hospital at 4 am, and treated within 45 minutes of making my first call.  This experience alone makes me feel confident when I go into labor this Sept, I know I will have the support of the team as promised. That right there takes a load off my shoulders and gives me the opportunity to enjoy the last few months of pregnancy. \n\nFurthermore, all my appointments have been pleasant and timely, their follow-up is reliable, and the staff is very friendly. Reading another review regarding the lady at the front desk... Don't let her fool you. She is a sweetheart and you will grow to like her. Not being chatty Cathy doesn't mean she isn't helpful or good at her job. \n\nMoral of my review: They have done an excellent job handling a high-matainance, over-reacting, scared to pieces, mom-to-be. And I couldn't be more pleased.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2011-07-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "llkm_iXQszkN5DZvmqjNqA", "review_id": "ncUL_Fsl9eoev0X97rQc5w", "text": "Safeway's are great now..  they have re doen the insides and put in a nice deli type place... they offer pre-made salads that are actually good, fresh sushi, good sandwiches and wonderful soups... since i work in the area i eat lunch there alot and am happy with the price and selection...", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 4, "date": "2006-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WeFxOADIRIDgdgjg8PmQdw", "review_id": "X5OpSA0Rs2Rs1xGTFUAdUg", "text": "Good food, and excellent service. I recommend asking to be waited on by Johnny.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3VIRjR2V29TOaI9u64hMig", "review_id": "OXuRzZ2RB9RJjPRO3Tp7mQ", "text": "Had a nice dinner outside on the patio - it was really pretty. The margaritas were pretty good. The salsa and chips were also pretty tasty - it was nice to have some variety- these were no simple white corn chips; there were blue corn and even sweet potato chips mixed in. My fish tacos were awesome, I love spice and they certainly delivered. I would try it again and hopefully find another item on the menu that was just as good.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gaf4_cxaz2s94qOe7lBA6Q", "review_id": "-7cquUti3-e8MfMXTx-C3g", "text": "Good service and location, food is great too!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 5, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sPg1Psg3AixLDYCm3lhRlg", "review_id": "3_mt70tlO9pBvbdUcSD-Nw", "text": "Good place for a beer. Excellent boneless wings.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "bIyiOjiPAnxHPL_SG-m-Kw", "text": "Great sports bar in downtown Phoenix!  The servers are amazing too!  Great place to have a beer and watch sports on TV.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2013-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rvL6tIP-WT54fVYQqT9N8Q", "review_id": "EUCXzQrL4rKnSojflCUylw", "text": "Good food , excellent service from the hostess to the waiters! Attentive ,friendly ,quality, cleanliness a+", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 5, "date": "2014-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_kll7whIqdrI0BTd9EXQfg", "review_id": "n6uuQdKiyWQ3G23t_csV6A", "text": "Food was amazing! I don't eat red meat and they made me a special chicken burger with cajun avocado!! So fulfilling!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xqd0DzHaiyRqVH3WRG7hzg", "review_id": "15SdjuK7DmYqUAj6rjGowg", "text": "dr. goldberg offers everything i look for in a general practitioner.  he's nice and easy to talk to without being patronizing; he's always on time in seeing his patients; he's affiliated with a top-notch hospital (nyu) which my parents have explained to me is very important in case something happens and you need surgery; and you can get referrals to see specialists without having to see him first.  really, what more do you need?  i'm sitting here trying to think of any complaints i have about him, but i'm really drawing a blank.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 5, "date": "2007-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "ebcN2aqmNUuYNoyvQErgnA", "text": "Got a letter in the mail last week that said Dr. Goldberg is moving to Arizona to take a new position there in June.  He will be missed very much.  \n\nI think finding a new doctor in NYC that you actually like might almost be as awful as trying to find a date!", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 4, "date": "2012-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jE5xVugujSaskAoh2DRx3Q", "review_id": "kMu0knsSUFW2DZXqKkGWlg", "text": "Top notch doctor in a top notch practice. Can't say I am surprised when I was referred to him by another doctor who I think is wonderful and because he went to one of the best medical schools in the country. \nIt is really easy to get an appointment. There is minimal wait to be seen and his bedside manner is great.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 5, "date": "2014-01-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QnhQ8G51XbUpVEyWY2Km-A", "review_id": "onDPFgNZpMk-bT1zlForRA", "text": "Dr. Eric Goldberg is a fantastic doctor who has correctly diagnosed every issue that my wife and I have had. Unlike many of my past doctors, Dr. Goldberg is very accessible and we have been able to schedule appointments with him and his staff very quickly. We are happy to have him in the neighborhood and look forward to being his patients for many years to come.", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA", "stars": 5, "date": "2014-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zvNimI98mrmhgNOOrzOiGg", "review_id": "I7Kte2FwXWPCwdm7ispu1A", "text": "Pretty good dinner with a nice selection of food. Open 24 hours and provide nice service. I usually go here after a night of partying. My favorite dish is the Fried Chicken Eggs Benedict.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2008-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "9uHZyOu5CTCDl1L6cfvOCA", "text": "Good truck stop dining at the right price. We love coming here on the weekends when we don't feel like cooking.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2009-05-03", "type": "review"}
{"votes": {"funny": 6, "useful": 0, "cool": 0}, "user_id": "ZYaumz29bl9qHpu-KVtMGA", "review_id": "ow1c4Lcl3ObWxDC2yurwjQ", "text": "If you like lot lizards, you'll love the Pine Cone!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SvS7NXWG2B2kFoaHaWdGfg", "review_id": "FRTCszJWkJonDAZx3yr8FA", "text": "Enjoyable experience for the whole family. The wait staff was courteous and friendly; the food was reasonably priced and a good value. A word of advice--LEAVE ROOM FOR DESSERT! the deserters are great but huge! Plan to bring some home", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qOYI9O0ecMJ9VaqcM9phNw", "review_id": "qQIvtbqUujvvnJDzPSfmFA", "text": "One of my favorite truck stop diners with solid food and friendly, quick service. My god, those desserts are huge! I can't imagine eating that giant cream puff. \nAll the food we had was delicious and I love how they leave a carafe of coffee on the table. Love this place. Would definitely be back if I was in the area!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EEYwj6_t1OT5WQGypqEPNg", "review_id": "4iPPOQIo5Mr1NAUPUgCUrQ", "text": "Only went here once about a year and a half ago, but they had great pancakes! My only problem with it at the time was that they allowed smoking, so I left smelling like a cigarette. With the change in law, I'm sure the atmosphere has improved!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bfww9ItvUBeRsFQ4UD4eaw", "review_id": "Rnm1KyfRcwNt9bOI5i-yqA", "text": "Great truck stop restaurant.  I've had breakfast and dinner here and it has always been good.  Huge portions and reasonable prices.  The bakery I guess is legendary.  They have doughnuts the size of your head!  Eclairs the size of your arm and Cream Puffs that are about 10\" high.  On our most recent trip in the area, stopped at the gas station attached to the restaurant fo some quick snacks and of course BAKERY.\n\nIf you are driving by and see the sign for The Pine Cone Restaurant - Take the next off ramp and stop it.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 0}, "user_id": "Au3Qs-AAZEWu2_4gIMwRgw", "review_id": "SSlO5u2nIJ8PoAKAgN5m3Q", "text": "Yeah, thats right a five freakin star rating.  \n\nFive Star Truck Stop Dining At Its Finest.\n\nBe prepared to eat.  \n\nI was first introduced to the Pine Cone at its Johnson Creek location years ago and freaked out at the size of the awesome, delicious desserts.   Then on a recent road trip someone mentioned about eating at the Pine Cone, I thought is there really more than one?  I looked out the window to see exactly where we were at and it wasn't near Johnson Creek -- when we arrived, and I saw the bakery....I knew I was home.\n\nIt was near dinner time so I ordered stuffed chicken breast.  The dinner roll alone is a meal.  I can't say enough about dinner.  Everything is homemade. They don't add alot of salt, if any.  You can tell its fresh.  Its plentiful.  Its cheap.  You literally can stuff yourself for next to nothing.\n\nYou can't possibly leave this place without indulging on some bakery goods to take home, IF they can make it home.  In our case, they were safely packed in the trunk for our safety and yours.  The last thing we need to explain to the police is we were under the influence of bakery goods from the Pine Cone.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2011-12-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MnXcXwr0keJpkIiwuPsOKg", "review_id": "_utPYHIdXeq8CqQ4iYD1bw", "text": "Ate a Saturday morning breakfast at the Pine Cone.  Friendly,quick service, normal prices.  But for the new year - the special was all-you-can-eat pancakes for $2.12, I added a breakfast sausage patty ($3.00).  Father had the typical, two eggs, toast, hash-bowns (seem fresh cut), sausage links.  Food was tasty, no major qualms other than - the hash-browns need a bit more cooking and the coffee needs a bit more bite.\n\nvery nice assortment of bakes goods - massive - as large as your head cream-puffs, eclairs - I took a blueberry muffin to go - which I enjoyed.  \n\nQuick exit from I-94...just northeast of  Madison", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 3, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "6wFJ0Ml7r9elqjeoez3HXQ", "text": "Attention fans of David Lynch.  Do stop by this place.  The atmosphere, staff and patrons will certainly help to make your visit enjoyable.\nLast time I was here I ordered the caramel nut covered cinnamon roll.  The waitress asked if I wanted it warmed with some butter.   I thought that sounded even better and said to go ahead and do that.  She nodded agreement.  Then when she brought it to me it was unheated and no butter.   Odd but also kind of humorous.  I always enjoy being in a David Lynch film from time to time.\nThe service and food is way better than the country restaurant just a mile south on 51.  Be sure to go here instead.   Their booths are made for skinny people from the 50s.   take a table.  start a conversations with the truck driver to your left. \nWe used to go to the Pine Cone when it was across the street.  Must be hard times for these guys because the interior appears to be older than what they had when they were on the other side of the street.   That place now sits empty.   Why is this area depressed?   Don't ask me, I don't know.  Do I look like I have all the answers?\nThe food here is good and the prices are cheap.   Go here for a nice meal and a flash back to the past and don't forget to take home some bakery.  Or if you aren't hungry just stop by for some great baked goods.    Well worth the stop.\nThis place gets four stars because of their five star bakery selection.  Crazy big cinnamon rolls and good prices.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2012-01-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "MPKMK36Xp0GuaWaXlUwZ8Q", "review_id": "rgM9f8Xh6ySclVoOSR8MXw", "text": "i rarely give five star reviews but for what this restaurant is, it's pretty perfect.  i've only eaten breakfast here (twice in the last three weeks) and the eggs are cooked perfectly, the sourdough toast is made in the kitchen and is delicious, and the bacon was perfectly crispy.  the hashbrowns are the best i've had in a long time - perfectly crispy on the outside and fluffy inside.  the pancakes are huge and light and amazing.  the cinnamon rolls taste just as good as they look.\n\nprices are right on, baked goods are pretty great.  service is fast and friendly - really fast.  i haven't had to wait more than 5 minutes to get my meal.  i might be in the honeymoon phase, but perfectly cooked poached eggs or over easy eggs are hard to come by!  it shouldn't be an anomaly to discover well cooked food, but i suppose it is.  sure it's a \"greasy spoon\" but how many greasy spoons bake their own bread?  can't recommend this place enough for great breakfasts.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pgKOL4k5tWCWS9VIc33EoQ", "review_id": "khGSK7FRLuRWnnTE6I0stA", "text": "With a recent addition of a truck driver for a BF I have found myself frequenting truck stops to dine. This little place is quite a pleasant surprise. Basically it is just great home cooking. Everything is homemade and quite good. The baked goods in the front counter were amazing. The size of the cinnamon rolls was insane. And of course I couldn't leave without a piece of pie.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2012-02-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4K7YXIl77EOHlTfSUjLCDw", "review_id": "mdjs8GJUfqGajVMjgOrP5Q", "text": "This is one of the best breakfasts I have had! Is the decor dated? Absolutely but it just adds to the nostalgic charm! The place just reeks of beef cooking... Ahhh delicious! Check out the pastry cases!!!! OMG, is all I have to say!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2012-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wC8r-m6KHifL6R2i8ok8yg", "review_id": "gksnzyc9jQ9hNXESjvTrQw", "text": "This is definitely not your usual truck stop. Pastries look delicious. Dinner rolls are large enough for a meal themselves and good!  We had a young waitress who I think was new. We found her to be sweet, polite and trying very hard. The lady managing the restaurant was really rude to her. We could all hear it.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 3, "date": "2012-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4ih20jNIEPIkhkh-uxeyAg", "review_id": "ilPs2w4liKDvlqLhWrkI8Q", "text": "A delicious breakfast.  Amazing fresh bakery and pastry items.  HOWEVER, the parkinglot/gas station area is filthy.  Strewn with debris, dead cars, broken glass.  If you judge a book by this cover you would NEVER venture inside.  I hope the Mgr.  sees this and cleans up.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2013-02-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "ue3D7WBI4ZQxH43wMdpfcA", "text": "Continuing on my Saturday morning hangover theme: there's just something about a plateful of greasy food when you're slightly hung over that makes it all better. The Pine Cone has down-home, rib-sticking, greasy food in spades.  The SO and I split the chicken fried steak, which comes with plenty of toast, hashbrowns, and two eggs.  I could'nt finish mine!  The gravy must be the same that they use for biscuits and gravy, because it tasted sausage-y, and as my plate sat there I could see the grease rising to the top.  BUT--I didn't come here in search of health food, and it was just what the doctor ordered. I'll work out later.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 3, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nJ_6gzvBj0mF943eWZ0cSw", "review_id": "DAFwq9T6sKDYiyQHiAzVbQ", "text": "Some times Jane and Michael Stern are on point and other times the story of the place beats the food.  I would definitely return to the Pine Cone.  It's a bakery and diner attached to a truck stop on the Wisconsin highway.  I live in Chicago and work in a famous Mexican restaurant and I get up to Wisconsin for the old school steak and butter as much as possible: it gives me the energy to do my job.  Pine Cone has eclairs and cream puffs the size of my cat.  And I got a pig cookie.  This little truck stop gives me the big energy to get even deeper into steak and butter territory.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "PCa_K6ijV3Tzbp6nouEiJQ", "text": "I like this location better than the one near Johnson's creek.  It is a bit tight when you walk in, but the charm soon takes over.  \n\nI was not really impressed by the food.  However, their pastries won my over.  Try it all!  The pie was delicious.  I went with a simple apple selection.  Delicious, perfection.  It is nothing crazy, no fancy name but truthfully one of the best piece of classic apple you can find around here.  \n\nThe service is a little slow but once again, it is a small restaurant with lots of charm.  You get what you get and I love it.  It is near a Christmas tree farm so it is the perfect place to stop and get some cocoa on your way.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 4, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IXANAoF_6OOFdDwjpGZpQg", "review_id": "rYKHcfBvFjqd5qvbX700_Q", "text": "This place was excellent. We were a little nervous because it is in a truck stop but the food was absolutely delicious and the service was fast and friendly.", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LDrpATl7viHfGGeUKzPeZA", "review_id": "xpQe4tiCdZuQdmQsgtMErA", "text": "OMG!  The bakery items at Pinecone are AMAZING!   Cinnamon rolls as big as your head and absolutely scrumptious!   The food in the restaurant is great for truck stop food.  We've only come for breakfast but stop every single time we head up to Rhinelander,  WI.  Do NOT miss this place if even only for their baked goods!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vEc7evQDo09ttI3HA9655Q", "review_id": "2owUZZsM0fuMNhzIfWcqRQ", "text": "A really lovely surprise on a rather horrific family road trip.\n\nWe were greeted at the door, the waitress was a peach, and the nice man who filled water/helped out was the sweetest guy ever. The food is also great if you're a fan of the diner-type grub; my hot turkey sandwich will live on in my dreams.\n\nYou can definitely tell the place has the old time appeal of a great family place as all the locals (mostly older people) know each other and it's clear it's the happening place for breakfast with the over-60 crowd (but hey, that says the food has to be pretty homestyle and tasty to me.)  \n\nIf you're headed down 94 and need a good lunch stop, make this it.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8lvmjewvLCwnbfwNoE-Xyg", "review_id": "BfPKrRDzpeQsljyxMa5sSA", "text": "Very nice and clean place to have breakfast or lunch", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 5, "date": "2010-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u5xcw6LCnnMhddoxkRIgUA", "review_id": "HAFNOdoQEluZxGDshb7vOQ", "text": "I eat here regularily because it is consistently good.  Very large menu which makes it tough to choose but never disappointed!", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 5, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qGux2C8XzxDxSNgyR5YpDg", "review_id": "C4gpNPcwPRT7Pd3Dh1247A", "text": "Unlimited hot coffee. I don't have any recollection of what I ate....\n\nI wanted t give it four stars, but that would be a very generous review for a meal I cannot recall.\n\nI know it was decently good, and it's like the only restaurant in Deforest.\n\nFor that, I give it four stars.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2010-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KT1F97KjezOZlIboOq7Krw", "review_id": "64ruCMTy3YpUfK33GS8weg", "text": "Homestyle cooking at its best, dnt go to culvers, McDonald's or whatever trash is right off the hwy, head a bit further down u will find this gem, one of the reasons I love this place so much? They dnt play annoying music, scratch that, they don't play ANY music. People working here are super nice as to be expected. If I owned this joint, I would invest in a new bigger sign, as I drove right by this place and almost missed it twice.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 5, "date": "2011-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tYwzsMLMc8juCuIMDAx3dw", "review_id": "QsrzjenckNACuOgaEiMWfA", "text": "Nice simple homey diner. Very friendly staff, huge family friendly menu, salad bar. If you are on the road this beats the same old options.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q2_xNGF6nhsOoD2NpOa5dg", "review_id": "rEmo-x2TEkgGlTUZHc2PKQ", "text": "Love their breakfast menu & they have friendly waitstaff. We go there nearly every Friday for the last 4 yrs.  I love that they don't play any music.  It is quiet, conversational, and comfortable.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 5, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S4hxgsxvNmjv8dxIaI7Vyg", "review_id": "eePGdbbqruayA3UZKcm9jw", "text": "Don't have time and/or cute outfits for Madison but want an alternative to Cracker Barrel? This is your stop. I started with the chicken dumpling soup. Simply divine, so much as to seriously tempt my veg accomplice. Cheese curds were another hit, far superior to those from the state fair.  Wraps, sammys, even the fried mushrooms were consistent, wholesome, and fresh. Service was on point, our waitress Brianna was business pro.  People watching was a little poor(s), to be expected in rural Midwest? I think our impassioned debate over drug use might have startled the crowd.\n\nNonetheless, not a Cracker Barrel. Takes Amex.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fjGh54rTqVn0ECKroIXwYQ", "review_id": "fgPJmaGRiLgOmEdz9DEEPQ", "text": "Huge menu, fresh tasty food, reasonable prices.  Beats a chain highway place for sure. The chicken dumpling soup alone is worth a trip (fresh made every day and it caused my vegetable-phobic daughter to eat carrots and celery of her own voltion!);  the steak-cut French fries were great and the coconut cream pie was wonderful.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "emBphqO9RndSywB5B1_L3w", "review_id": "yc0GhIx7gY2d3qb84xW1MA", "text": "Food was very good. I had the Reuben sandwich. My only suggestion is that the waitress should check back more often to see if we need anything. Otherwise, I recommend it.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LA_oXZdiMqZqjxNp7gZweA", "review_id": "4it5bgKLOwplPWKZK4Q6cw", "text": "Nice clean place with a very friendly staff.  Great homemade chicken dumpling soup and a very tasty club sandwich.  Decor is outdated, but not sloppy. Good local place to bring the family.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ue3hmkbr-pVaiqiCnxInQg", "review_id": "xjyVKwC1azTtDLrShQBthQ", "text": "Californians are all about the In-N-Out, where you can get your burger animal style. And the Midwest is all about Culver's, where the Butter Burger is the thing to order.\n\nC. and I ate lunch here on our way between Milwaukee and Mosinee before going to my folks for Christmas. I got a cheddar burger with fries, and C. got the two-piece chicken dinner with mashed potatoes and green beans.\n\nThat's one of the things I love about Culver's. Yes, it's a fast food restaurant. But they also do family restaurant food well. The chicken was good and the green beans really fresh, C. said. Fast food you can feel good about.\n\nI also got a frozen custard, their flavor of the day: Swiss almond Christmas or something like that. Chocolate custard with slivered almonds. Yummo.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2007-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l_vRCjYILaY9PYWevubPwQ", "review_id": "67d-r6tRNFSWXbvGR6FPDg", "text": "I wanted ice cream so my husband pulled off the highway at this Culver's. We opted to get the flavor of the day (cookie dough craving). I was disappointed to find that it was a chocolate custard with TONS of cookie dough chunks because I like custard and not just the mix-ins, etc. but it was overall a decent sundae. I'll just stick to vanilla next time!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "nmX7lMtrsWw_z6i6Nt5ltA", "text": "Next to Chick-Fil-A, Culver's is my fav fast food chain.  Rarely is a snowboarding trip complete without Culver's to top off the day.\n\nThe butter burgers hit the spot (though mine was heavy on the red onions; good thing those are easily removeable), and the fried cheese curds are to die for.  You don't find those floating around just anywhere.  But if there is anything you MUST get, it's a cup of the frozen custard.  Damn, that's good stuff.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2008-12-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "iEkq9MFkcop1_CVnl-INSA", "text": "Go-to meal: cheddar butter burger, fried cheese curds, and flavor of the day custard.\n\nThe difference between a deluxe burger and cheddar butter burger is that in the deluxe, you'll get American cheese.  And you have to pay 25 cents extra to add lettuce, tomato, etc. to the cheddar butter burger.  File that away in your memory bank.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2010-01-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wTQHOi_-h1a02clSKCntzA", "review_id": "sywSyodHZeCQUJTftQej1w", "text": "Really good stuff!! The custard was great! I loved it and when I am back in the old USA I can only hope I will cross paths with another culvers.\n\nYou know what the thing is with culvers? You actually don't need that much, it's sort of like eating cake batter or cookie dough. You can only have so much before you start getting that sickly feeling and start stirring that plastic spoon around and staring down the custard and wondering why you dont wanna finish. Yeah it's custard and it's heavy especially when you add every kind of peanut butter chocholate bar to the mix.Let me tell you those first five spoonfuls are pure goodness then it goes downhill. Less is more with this stuff let me tell you! Next time I am getting the smallest size, and I will be far more pleased and not guilty I threw out a mega size bucket. Hahaha!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2012-01-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Z4Bv3gEMbEmncLDDcrB4w", "review_id": "Ddu4pw-Yj3Xqk7lnA6Zo1Q", "text": "My meaty goodness...why isn't Culvers a nationwide chain?  This bacon cheese burger is way too good to come out of a fastfood drive through window.  I had a nice little picnic on the tailgate of my pickup (driving cross country....long story).  I could not believe how great this burger was. \n\nThe amazing part is the onion rings might be better than the burger.\n\nIf you're passing through Wisconsin, you need to stop at Culvers.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WsGQfLLy3YlP_S9jBE3j1w", "review_id": "kzFlI35hkmYA_vPSsMcNoQ", "text": "Love it!!!!! Love it!!!!!! love it!!!!!!!   Who doesn't love Culver's!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Veue6umxTpA3o1eEydowZg", "review_id": "Tfn4EfjyWInS-4ZtGAFNNw", "text": "Everything was great except for the burgers they are greasy and very charred compared to other stores.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 3, "date": "2013-12-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u5xcw6LCnnMhddoxkRIgUA", "review_id": "ZYaS2P5EmK9DANxGTV48Tw", "text": "I really like both Chinese restaurants in town.  This one has outstanding crab rangoon.  Love the chicken with snow peas and mushrooms and General Tso Chicken.  Food is always ready in 10 minutes which is accurate.  Good place and they give you free pop.", "business_id": "RgDg-k9S5YD_BaxMckifkg", "stars": 5, "date": "2010-12-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kj18hvJRPLepZPNL7ySKpg", "review_id": "uOLM0vvnFdp468ofLnszTA", "text": "Above average takeout with friendly staff. The sauce on the pan fried noodle is tasty. Dumplings are quite good.", "business_id": "RgDg-k9S5YD_BaxMckifkg", "stars": 3, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L5kqM35IZggaPTpQJqcgwg", "review_id": "b3u1RHmZTNRc0thlFmj2oQ", "text": "We order from Chang Jiang often and have never been disappointed.  The menu is huge, and can accomodate anyone's taste buds.  The service is quick, usually ready in 10 minutes.", "business_id": "RgDg-k9S5YD_BaxMckifkg", "stars": 4, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3T2Dr5fnsWDmudQM1Hhy7A", "review_id": "-OiuD6jbmiz7F0hghDRezQ", "text": "I was super nervous about using these guys due to the poor reviews, but I have a home warranty and the company chooses who we work with- I didn't have a choice.  I was pleasantly surprised.  We actually had to cancel our first appointment because we were having some major electrical work done that morning and the power was shut off at the time the appointment was supposed to be.  THEY actually called us a little later in the afternoon to find out how things were going and asked when they could send someone out.  They came out on time and got right to work.  The technician was nice and knowledgeable and explained to me that our A/C was shot (bad compressor and burned out wires- we were worried this might be the case after he said it was almost 20 years old).  I was glad to hear he knew about the warranty process and explained how that would all work too.  \n\nSo far, so good.  I'll be sure to update my review when they actually repair or replace the A/C (it's pending approval from the warranty company at the moment).", "business_id": "ZW2WeP2Hp20tq0RG1NFkoQ", "stars": 5, "date": "2014-07-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_cOXx98-ZiOgxjib-ZdYGA", "review_id": "2cycVscLLOmmZDp3BTvOGA", "text": "This public library is a short drive from our house.  During the school year you see a lot of students here from the neighboring schools.  During the summer a lot of Moms here w/ their toddlers and young preschoolers reading.  I don't go here much although my daughter does.  They're open til 8PM four days a week which is cool for those who work later in the day.\n\nBefore we replaced our printer, I was here frequently.  Some of the librarians can be snooty but whatever.  It's a small hometown type library but has what you need to relax and read or get some work done on their computers and printers.\n\nA good-needed staple for the area.\n\n\nINFO:\n\nMonday-Thursday: 9-8\nFriday-Saturday: 9-5:30\nSunday: 12-3\n\nCLOSED: January 1, Easter Sunday, Memorial Day, July 4, Labor Day, Thanksgiving, December 24 & 25. Closing early at 5:30 on December 31.", "business_id": "95p9Xg358BezJyk1wqzzyg", "stars": 3, "date": "2009-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bDk2XvjJlK8fsiL6C1HpEg", "review_id": "_vzTyyPLOgVxNCuWRKOb1w", "text": "Grade: C\n\nThe food is almost as good as the prices. Decent service.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2007-08-22", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 4}, "user_id": "ZYaumz29bl9qHpu-KVtMGA", "review_id": "McrBBaa12WfHKTzOCCh7DA", "text": "I have never eaten at the Green Lantern, but whatever.  What I HAVE done is gone to karaoke there.\n\nI am not the kind of person to enjoy a \"hip\" bar.  I don't want ironic metal on the jukebox or $8 flirtinis.   What I want is totally unpretentious karaoke renditions of Unskinny Bop from people that still look like they graduated high school in 1991, and $2.50 vodka and cranberry juices.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "D72YMW4JGX3NkSNZAW7BeA", "review_id": "i6x1HRWR6BSJIkiKdeQhYQ", "text": "I'm sure if I drove far enough outside of Minneapolis I'd find a place about as awesome as the Green Lantern. Instead of doing all of that work, I just wish the Green Lantern would move into my backyard.\n\nI HATE bars where I feel like I have to do a lot of work just to try to have a good time. I'm not dressing up or drinking a certain drink just to feel like I have a shot of being accepted somewhere, believe me. The Green Lantern rules because it's completely laid back and totally unpretentious. I've seen such a wide variety of people there and everyone is always having a great time.\n\nBesides, the drinks are super strong and cheap - that alone is good enough for me.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ae-liuNOw35td5AU8uOG6A", "review_id": "sSMG7T3hzRbkwqwYTv8i-A", "text": "The biggest plus is it is on the lake with a dock and open for breakfest.\n\nThat is huge if your a fan of a boating trip to eat ...I'll swing by soon to actually eat there again ...it's been 3 years since we had a boat.\n\nWe did find a used boat ...now we may return.\n\nI guess that says a lot as without the boat, we do not go, with a boat, its a 6 out of 5 stars!!!!", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "RueYG7VZjO5HjJz9DD3YsA", "review_id": "0Yy6Zzg11ZzmGtIVG9rPog", "text": "Who does not love the Greeny?  As some posts before me it is a place you can go and have a good time no matter what and just be you.  The staff is awesome and the food is decent.  But the Green lantern has something that other places try to imitate, atmosphere. \n\nI have seen bar after bar try and create a fun atmosphere but they cannot.  The Greeny has it and I wish I could get there more than I do.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "1ga5Aj9_iNDvc_6K3ol2jA", "text": "The Green Lantern is the kind of place that comes in right above the Mendoza Line.  What I mean by this is the quality of the meals and the atmosphere of this supper club is good enough to warrant return visits but not to elicit rave reviews.  I'm not a supper club kind of guy, so right off the bat a place like the Green Lantern isn't going to be my favorite.  However there are plenty of old school supper clubs that do a nice enough job that I've got no qualms tagging along for dinner on a Friday night.  The Green Lantern is one of these places, albeit just barely.\n\nMy friend, however, absolutely loves this place.  As such I've had cause to dine here many times over the years.  There are quite a few pluses.  The bartenders are quick and generally friendly, and they've got an adequate tap selection including Ale Asylum offerings.  I love the location right off the lake, and two-thirds of the seating areas have great atmosphere.  The service has always been above average and I can't think of a bad experience - this type of consistency over the years is very hard to maintain.  They've got Wiggies, which are kind of like low-rent roesti - hashbrowns with onions, peppers and American cheese.  And finally the Green Lantern is obviously popular with the denizens of McFarland.  I don't recall a single trip out here where the bar wasn't mostly full and the restaurant hopping.\n\nThe negatives: first and foremost I've always found the menu to be pretty limited.  I'm not big on fish fry, and the Green Lantern's Friday night menu doesn't have much else aside from sandwiches and a grilled chicken breast entree.  Now as I said, I'm not big on fish fry so my opinion should be taken lightly, but the times that I have ordered the fish I've been underwhelmed.  This is probably just me - my friend simply can't get enough of the stuff.  Prices are moderately high for the perceived quality, though the bar is quite reasonable.  There's also a bit of a hassle when it comes to paying the bill.  While I've never had any concerns with service from the waitstaff, I have stood around for upwards of 15 minutes waiting to have the hostess swipe my card.  That is unacceptable and it's unfortunately led to smaller tips to otherwise deserving waitresses.  Finally, it always seems that after waiting 20-30 minutes for a table on a Friday night we always end up either in the basement or at one of the few poorly located tables upstairs.  \n\nIf it were just up to me I don't think I'd be going to the Green Lantern all that much.  After all, I don't live in McFarland and I don't really go for supper club fish fries.  But so long as I know people that love going here I'll tag along and have a decent enough time.  I think you'd be hard pressed not to at least be able to do that at the Green Lantern.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wesMv1-cXnN8F-TCugisKA", "review_id": "0Y31YeVGkyyTKTf4Y4VyrA", "text": "Ate breakfast here today; overall a really good atmosphere and some tasty items on the menu.  I would recommend their Wiggies, a hodgepodge of hash browns, cheese, green peppers, diced ham, and mushrooms. I topped it off with a mimosa and\nthen my gf and I strolled out onto their dock and enjoyed some lakeside scene.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I7dYsjvl3b66gL4KhOjVIw", "review_id": "gOq_YZPXNiET51Xsoxa9WQ", "text": "Looking for \"that\" spot where the moment you walk in, you fit in?  \n\nLooking for a home cooked meal...without having to lift a finger? \n\nLooking for a place to pop a squat and shoot the shit?\n\nLook no further than the Greenie!  \n\nBreakfast, lunch, happy hour or dinner....it always fills the bill. \n\nLove taking the family there for weekend breakfast.  From the waffle sundae for my youngest to the seafood omelet for me...they have it all.  Huge portions...great prices! \n\nSwing in and ask for my favorite bartender, Joy to make you her ultimate bloody mary made with Effen Cucumber Vodka.  Yeah...she rocks it.  \n\nIt's all good...", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PMMx7b5IBhWtm4EKKL8ung", "review_id": "x12st102YwiWjkRbz8X1tw", "text": "Always good food. Menu seems to have been updated recently. Lake perch really nicely done. Upper dining room has been remodeled. Quite nice!  A favorite.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WTzVMsr5Pre2ZPtlUwWh8w", "review_id": "bP-_y84gpiMuo7dbd0p27w", "text": "We accidentally found Green Lantern when another local eatery was closed for Sunday night. We couldn't have been more happy that the other place was closed as Green Lantern had friendly service, tasty food, and the Packers on tv screens everywhere you looked. It's a restaurant and bar, and the building isn't modern, so leave any judgmental aesthetic attitudes at home (or, in our case, the hotel room) and go enjoy something other than another boring chain.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5yLRVxHgnCQ5taPJ4cl0-A", "review_id": "7_83JssVJ7x3ZTCvLMFLdQ", "text": "Friday Night Fish Fry! reasonable prices and good service. Go with the standards and you will enjoy!", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 3, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1b_wzWO8pIA42NFneY4kAA", "review_id": "xXdoRaDC7pEALfqQgFl-Xg", "text": "This place is like an old up-north supper club. It's dark and cozy with orange light lanterns hanging from the ceiling. The upper seating level has a lovely view of the lake. \n\nI got the lobster omelet and it had this wonderful, flavorful tarragon sauce over the top. Big chunks of lobster made it a memorable breakfast. My english muffin was perfectly toasted and buttered.\n\nMy companion recommends trying the walleye breakfast next time.\n\nOur server was very very very nice and sweet. Several times she uttered \"take your time, no hurry.\" I hear that's the Green Lantern's tag line: loitering encouraged. I like to relax, so this place is perfect. If I lived in the area I'd go there for drinks.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NhCE1r5RPWN3Q0GveOx6kw", "review_id": "ZGVMojZOA7l3bIhiCGdZPA", "text": "Never had a bad meal here, breakfast lunch or dinner.  Prices are very reasonable and the people are very welcoming.  One thing that needs improvement is the coffee.  I think they let the hot water wink at the grounds.  Way to weak.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "L1-rN5tbwV8OcauhcH8c7g", "text": "Good food, cheap drinks, great service. Breakfast is simple, but delicious here- get the Wiggies (hashbrowns with cheese, onions, ham and green pepper inside). Sandwiches are also good, and it's a great place for fish fry.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2013-01-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SEJWhA6MRIavK4b3pGxwTg", "review_id": "LVeiA1ImqGzoYXnZQsohhQ", "text": "FISH FRY was OUT OF THIS WORLD! I read an article in Madison magazine about how this place had one of the best fish fry's in town and decided to try it out! What a gem! First, The fish fry comes with salad and a side. Super Nice.  Secondly, they must have the world's best tartar sauce! I could literally drink the stuff. Third, I took five people here who all had the fish fry and drinks and it only set me back 60 Bucks! WOW! I will be back!", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cBBarVpwP94MsS63W4KKZg", "review_id": "LF8brFVyF0tFSrgo16JK2Q", "text": "Stopped in for a dinner after getting a recommendation from a co worker and we were VERY impressed!  It was fairly quiet on a Thursday night - no problem getting a table.  The location is fabulous being right on the lake with views.  The ambiance is very much a north-woods tavern restaurant type establishment - older decor, a little kitschy, though it suits the place, well.\n\nGreen Lantern has a reputation of being a surf-turf and they do it well!\n\nI had the Ahi-tuna - it was an incredibly delicate piece of fish cooked perfectly.  My wife had a steak which was also prepared very well.  We are DEFINITELY coming back!\n\nThe server, while young and a bit 'nervous', did a fine job and she was very pleasant.  She also provided great suggestions for food pairings!  Well done :)\n\nHint:  Ask for a seat by the window to get a view of the lake.\nhint hint:  The location, ambiance, and setup is VERY family and kid friendly!  They were hosting a birthday party for a grandmother while we were there and the staff bent-over backwards for the family and party - including setting up a powerpoint projector for family slide show and music!  Very sweet....", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "reI1yQImDR-1a55zVZZPHQ", "review_id": "1QkJXpCizrGuP13ovUEJwQ", "text": "Been here a few times. Once for breakfast and few times for drinks/apps. Food has been very good and the service is decent. They don't have the best view of the lake but we'll still be back.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2013-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6MYEMoBDkhNj76KA_hzEyw", "review_id": "rcG9oWtCrDertb1Bn9j54A", "text": "Any place that's located on a lake for a fish fry is alright with me.. It's packed on Friday which means you get to have a few cocktails while waiting for a table, the wait is worth it... Don't hesitate to try this place out you won't be disappointed..", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "iKBS0S0l_PZ_iEaKw8W9bA", "review_id": "bZIEtboNPABmQtMsWmpPaw", "text": "are favorite fish fry in madison area get there before 530 if you dont want to awhile friendly staff both the bar and the waitstaff good burgers and steaks recomend the sea fod platter nice view of the lake good stop for lunch when out boating easy access pier go most for fish fry good hashbrown solid kids menu very reasonable prices can feed family of 5 for around 40 to 50 dollars with cocktails", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ibeYRWmFst05FZfo5vo_aQ", "review_id": "RxfRqqOPVdM0B9PiWq-Oow", "text": "The Lantern doesn't profess to be anything more than it is. Good American, wisco supper club fare. Prices are very good, and they know how to cook a steak to temperature. Bloody Mary's are great as they allow you to add your own seasonings to taste.  Decent wine selection by the glass.  They even have sambuca. \nTry the surf n turf. Very good at a great price. \nAlso fried chicken. \nSolid choice, and nicest place on lake waubesa.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "13XTZwRHFLGjAdpN3YCm5Q", "review_id": "_QZxHs7TfLyoNKgEBcVNOQ", "text": "I've been taking my adorable old english sheepdog here since I got him as a puppy over 6 yrs ago. The staff has always been great about getting me in for appointments even with short notice. The new clinic is very nice, always clean, and set up well. They willingly give you all the treatment options available and corresponding pricings, which always seem reasonable. My guy has had some issues over the years (hematoma on his ear that needed to be surgically drained) and the staff treated him super well and helped him recover quickly. I no longer live in McFarland, but I still drive out there to keep going to this clinic.", "business_id": "ZlhAvs_6ryi4_efZ1SpMbg", "stars": 4, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R9W6whtG5GagjzJ4yrRvqQ", "review_id": "3uP9MHI1IC-zP2FSbA9VcQ", "text": "Spartan Animal Hospital is a fantastic place. I am a seriously poor college grad and I took my new cat (from the shelter) to Spartan for her rabies and FVRCP booster shots today. I was really impressed with the staff and the facility. The people were extremely friendly and were patient and willing to answer all of my questions. They gave me a folder full of good information and the home phone number of Dr. C, the owner, in case of non-office hour emergencies. That's dedication.\n\nThe best part about Spartan is that they don't charge the regular office fee if you're just coming in for vaccinations! It's a rare thing to be pleasantly surprised at a cash register, isn't it?\n\nI highly recommend Spartan to you!", "business_id": "ZlhAvs_6ryi4_efZ1SpMbg", "stars": 5, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "idQx85xfiIm_SGTnDsaXcQ", "review_id": "XQ8-CgwKZ6_dUnEiqbC-bw", "text": "What could I possibly say about the Beach House Restaurant and Lounge?  I guess I could think of a few things.\n\nI went there today for the first time and was dazzled by the charm it flaunted, while still maintaining the gritty edge of a backwoods Wisconsin eatery.  Let's not get it twisted folks, we're not breaking gastronomic ground here.  What we are breaking are your misconceptions of what a restaurant can be whose parking lot is largely composed of Chevy and Dodge trucks, and whose front, snow-covered, lawn is full of snowmobiles.  Deal with it kids, this is that slice of Midwest Americana you've been looking for in any number of wayside eateries in rural America.  Fish fry anyone?\n\nTo begin, let me explain that one of the many draws for the Beach House's patrons is the fact that it is still legal to smoke indoors in McFarland.  I stepped inside and was immediately made aware of this fact as plumes of smoke took up residence in my clothes and nose.  \n\nDo not fear, however, there is a separate dining room that is nonsmoking.  And man was this separate dining room packed (Superbowl Sunday).  Packed with large women squeezing into convention center chairs.  Packed with waitresses who wore skin tight white Jordache jeans, giving you a fleeting sense of their giving nature.  Packed with the eager anticipation of an entire day spent watching football and football-related activities: drooling, eating, drinking, and smoking.  God bless America.\n\nThe AM dish to get here is the Walleye and eggs breakfast.  I would tend to agree, although their limited selection of omelets is made marginally more tasty by the addition of broccoli (you heard me punk).  As breakfast wore on, the dining room filled, emptied, and filled again; the waitstaff eagerly setting new places, removing paper place settings, calling people darlin' and hon'(always appreciated).\n\nSo give it to me hard backwoods Wisconsin.  Give me every sinew of your being: your ice fishing, snowmobiling, smoking, bloody Mary drinking, being.  Just be.  And give me a friggin' huge piece of deep fried walleye to help me digest the spectacle, with scrambled eggs on the side.  And don't you dare forget the tartar sauce.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2009-02-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bafakbBFSIkpafZts10TTw", "review_id": "p8LAguMpxcNF-b3pPKFx2Q", "text": "This place is pretty dumpy - \"Corinthian leather\" chairs, crappy tables...\nWhat is worth going for is the walleye and eggs served on weekends.  It is a HUGE portion of walleye, lighty fried, served with eggs cooked to order, potatoes and toast.  All this for something like $10.  Totally worth a side trip if you are in Madison.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2010-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nqs6Avj7bfyavMUHO0XVBg", "review_id": "B4SfNmVGS6rP2SwhU31kDw", "text": "For being surrounded by two lakes, Madison doesn't do a great job of having places to drink on the water. Head down to McFarland and check out the beach house. It's like a dive bar slash restaurant right on the lake. Tons of windows. Not a bad place.\n\nCan't comment on the food. Drink specials were solid.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "RueYG7VZjO5HjJz9DD3YsA", "review_id": "tbOkGJbrvc_cRAKC9TZ25A", "text": "I have not Yelped in quite a while and to all my fans (all none of you)...sorry.  So I will start on a positive note...\n\nSo I have been to the Beach House so many times I feel dumb reviewing it but I am so deal with it and go there.\n\nIf you are going for drinks...do it.  The clientele is awesome and you will always hear some great stories.  But this review is for the food.  ALWAYS AMAZING!  We went for breakfast the other day for the first time in a long time and it was as good as I remember.  The Eggs Benedict are just delicious and something I could eat every day and they make one hell of a Bloody Mary (so I am told by my wife since I do not like them) if your interest in that.\n\nSo if you want some good breakfast on the weekend and in the McFarland area...Breach House it is!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2011-02-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aRinRrnTa1H4Ssj5h_wzgA", "review_id": "VZIF-RqGvq4Bzoeqf75lqg", "text": "We had dinner at the Beach House on Friday on our way up to northern Wisconsin based on reviews on Yelp.  If you are looking for good fish fry the Beach House has it.  I had the perch which was great, my bf had the walleye which i think had an even better flavor.  The fish deserves 5 stars.  Everything else a 3 star.  I would give 3 1/2 stars if that were an option.  Would definitely go back.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 3, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "YFWfdR8v3wEoezv-IogLPQ", "review_id": "TFH7ICqXtrh4I6beOvw6xg", "text": "This is the quintessential mom and pop bar / restaurant on a lake. They specialize in cheap beer and great food. Staff is friendly and down home, but you'd better leave your big-city attitude at home.\n\nWe went for a Friday night fish fry. I live in Seattle these days and was not about to miss the opportunity while in town.\n\nStarted with a couple of Spotted Cows (on tap!) while the rest drank Miller Lite. (Told ya...) There were five adults plus a 12-year old.\n\nWalleye was excellent, the waitress was too. We made reservations and the table was ready well ahead of time. Our one tactical error was sitting in the bar for the view. It was LOUD! Think that the dining room is much quieter.\n\nNotice that I am not saying much about the food? Here's the deal:\n- It was Friday\n- It was Hot\n- The beer was Cold\n- The fish fry was exactly what you would expect in a place like this: great walleye!\n\n'Nough said...", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TBi0Rvegjtd-bHd9vC0ryA", "review_id": "ViUdEYgjC7J7_Qbxfdw45w", "text": "We live just down from the Beach House.  We love going there. They are super friendly. We usually do not have to wait to be seated. The weekend breakfasts are the best. Bloody Marys are outstanding. Love the crab cakes eggs Benedict. Yum! Huge portion of walleye with your eggs which is one of my friends favs when they come visit. It is a great local hangout too, beautiful view, easy parking for your boat from lake waubesa. We recommend it always!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2011-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zDeT5NCJQi0jxGqo2e_KPw", "review_id": "u-YKTqqW16sdyHbsFSHj2A", "text": "Now I must state one little thing about the way I rate restaurants. My ratings are relative to my expectations of the experience and in no way relative to other restaurants, (it just isn't fair to use the same scale for a place like the Beach House as you would for The French Laundry so again, it's all relative) \n\nI've only been here for breakfast but the second time I drove a long damn way to have breakfast again so that in and of it self should say something. (another caveat: there are maybe six restaurants in McFarland that don't have drive-thrus)  \n\nI ordered the Walleye and eggs both times along with a bloody mary (gotta love a beer back, yay for Wisconsin). Now I am well aware of the number of bones that a whole Walleye contains and cannot in any way hold the Beach House responsible for that. I can say that the breading was perfectly crispy and well seasoned and that the fish was not at all over cooked, nice and moist. plus I think it cost $10 which was awesome (you can't get fish for breakfast at these prices in Chicago) \n\nFor me the biggest highlight of breakfast here is what they do to the potatoes (their name for them is eluding me at the moment) by request they will top your breakfast potatoes with a heap of meat, veggies and cheese, enough to make it a hangover-soaking-up meal unto itself.\n\nTo sum it all up: if you find yourself looking for breakfast and a little \"hair o' the dog\" in McFarland Wisconsin because \"What happens at the Beach House, stays at the Beach House\" and we all love that about any restaurant.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QJPOP71pcBwdT2tD7CNrzg", "review_id": "PFItDgxbkgkUI5WfCy3e3Q", "text": "I use to boat in this area alot.  I always made this place to stop for  breakfast. very good.   They are know for there Walleys and eggs,  Some people even like a bloody mary or vodka and orange served with them.  Anything on the menu is good.  Nice place on the water.  You can come by boat or car.  If you come by boat a nice little ride over to Madison area makes it a fun day.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2012-01-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jv6lq527bHVW1EbrqzZXag", "review_id": "3OMtQG0DF7IqzEDYZYYmiw", "text": "We love the Beach House.  We come here often.  Food is always good.  Drinks are made by some really awesome people!  Specials are always worth a look. Weekend breakfasts are very popular, so come early.  Try the walleye/eggs.  Or the crab/eggs benedict.  Very very good!!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 5, "date": "2012-02-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yw8wBKgA7rgTLSdDQHGcig", "review_id": "4Om7jEvfd2ZTAJJ5B8jPnQ", "text": "Excellent dinner. Had a New York Strip steak and Scallops for $22.00", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "reI1yQImDR-1a55zVZZPHQ", "review_id": "c1lBTPfyk2pSzzc-VOKvTw", "text": "Food was very good and the atmosphere is the classic divey Wisconsin bar. The only way it could be better was if they added outdoor service/outdoor bar. We will be back!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2012-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HKFK6P35KX0VF67NtU0rwg", "review_id": "KRypBJz-iZnj-lcfd8oJUg", "text": "I've been to this place a couple of times and we've always had good food. Service was a bit slow, but will definitely keep going back. Love being so close to Lake Waubesa and watching the sunsets too.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2012-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NhCE1r5RPWN3Q0GveOx6kw", "review_id": "hi6cBbcj1FGp7Z--Q-6Dxw", "text": "Food and service have always been good.  The seafood dinner was done perfectly.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2013-01-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "reI1yQImDR-1a55zVZZPHQ", "review_id": "0Hy96PQqg9kCXxMOKODUsA", "text": "The Beach house is probably one of our favorite breakfast places. The walleye and eggs are truly a specialty. Their fish fry is also very good and they have a nice view of lake Wabesa. If they expanded food and drinks outside, they'd have a 5 star.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2013-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "H7Oqx7unyozYf72d8MXHBQ", "review_id": "bN7EMgyGMZ62yCo-NHYhyg", "text": "I got a Groupon for here for my fiancee and mine's anniversary, and we finally were able to get there a month later.  The restaurant was super easy to find and I loved how it was right on the lake.  I spent a lot of time the last few summers in northern WI on a lake, so it was nice to be back on a lake again- brought back good memories!  We did not make a reservation, so it was an hour wait for a table when we arrived.  We hung out in the slightly crowded bar and had a few drinks while we were waiting.  The drinks were good and the bartenders were attentive, so no complaints there!  We were seated at a table that had a great view of the lake.  They had lots of specials going on that night (Friday night fish!), and we started with pepperjack cheese curds.  Delish!  They had a really nice bite at the end of them from the peppers.  I got the blue gill/lake perch combo and my fiancee got the Caribbean salmon.  I know blue gill is a thinner fish, and while my dish was good, there was not a lot of actual fish under the batter.  I got a salad with my fish with a tomato basil vinaigrette, which was surprisingly good and coleslaw which was pretty standard.  The salmon with the Caribbean dipping sauce was fantastic, but the veggies he got as a side was just some steamed broccoli and carrots- not very creative!  Our server was attentive all night, even though the restaurant was super busy all night.  By the time we left, I was very full and satisfied.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OGxuqUZtoynJ6ayz_VCfyQ", "review_id": "Gcd90ruA8MBMc4rCEuF72g", "text": "Went here for fish fry with one of my friends and we ended up sitting outside and watching the sunset. Our server was very nice and the food was SOOOO good! I had the fried cod and she had the walleye. We were both impressed and full after the meal. My favorite part - the price - very affordable and you get to pick your sides, which were also really good, american fries and asparagus. I'd highly recommend and I'm going back!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "clKTx-oACO0rwblV40tpWg", "review_id": "GqLgixGcbWh51IzkwsiswA", "text": "I would not have known about this place had it not been for the Holiday Groupon. I redeemed mine with my bf over the weekend, and the food was delicious and cooked well (see Holiday Groupon pic).\n\nThe restaurant was packed on Saturday night; I'm glad I called in a reservation. Local town folk. Not a huge place but still cozy. The servers were running around and busy but made sure that our table was attended well. Ask for Dee Dee; she's a trip! I'll be back again for more food once the snow has melted to try the other items on the menu.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2014-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zG47E-MKHT1Yea5us2crBg", "review_id": "5UCkIG2F6s8iOym7rxMC1A", "text": "Great place on the water. Beautiful views. Good fish fry. Very reasonable prices with nice selection of fish and sides. The staff are great!", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kj18hvJRPLepZPNL7ySKpg", "review_id": "j6Ertw1QPSnlpqlKb6xOuQ", "text": "Nice Bed and Breakfast just outside of Madison. My hub and I went there for a quick getaway after a long two months of working on projects. Craig is an incredible host, and if you are vegan (which we are not but love the cuisine) he can totally accommodate you.  Funky, eclectic, a nice retreat with caring owners. Not uptight and very kid friendly. Good for a family gathering. The only reason I don't give it 5 stars is if you are completely uptight about absolute decorating perfection, then this isn't the place for  you. The hosts make up for this in humor, kindness, and providing a peaceful setting. Good stuff, worth a stay. Mid-week deals are worth looking into.", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 4, "date": "2010-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-o4h6R65vlJaTBrfxOEYCA", "review_id": "6Wb-WvcwMgjz3lEBvAciWA", "text": "I am a huge believer in bed & breakfasts, especially in the winter when you are bound to spend more time indoors.  This is a very cute one; bf and I stayed here on our visit to Madison.  Hosts were VERY friendly, so we started our (very big) breakfasts around 9 and usually ended around 10.  They were very accommodating and solicitous of our feedback.  \n\nWe stayed in the Mentor room, which was spacious and had a hot tub but no shower, so I used the shared shower across the hall since there weren't many guests during that weekend.  It really felt like we were staying at a friend's house, except I didn't need to help with the dishes.\n\nSome things that didn't bother me but might other people:\n1)  Note that they have two large dogs\n2)  If you're averse to flowered wallpaper, this is not the place for you.", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 4, "date": "2011-02-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ECOZNokNazcdgocyCRJw6g", "review_id": "RoYo8rE2TREB-sfrHEBfKA", "text": "What a wonderful place Craig runs! So happy we chose to stay at The Parsonage for a girls weekend to Madison.\n\nThe highlights:\n- Location: While the B&B is about 25 minutes from downtown Madison, it's very easy to get to. The perk of being off the beaten path is, well, being off the beaten path. \n- Price: The three of us chose the top floor Reverend's Retreat, which can actually sleep up to 6. It had the feel of your parent's attic, but in a good, comfortable way. For the Friday & Saturday night, it was about comparable to what we would've paid to stay at a fancy-pants place in Madison.\n- Food: Oh my goodness, can Craig cook! The breakfasts alone would've been worth $20/person at a restaurant. Definitely try the juice blend - you won't look at orange and cranberry juice the same way again. \n- The company: On the weekend we were there, we (late 20s/early 30s) had the pleasure of staying with younger groups of people. Chatting at the communal breakfast table was a nice perk and a great way to get some new tips on what to see & do in Madison. And, Craig and his wife have two lovely dogs. \n\nIf you're in town, definitely look up & consider The Parsonage.", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2012-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hr5EjzXbj8osJlE-ZZlIKw", "review_id": "ZPQnj41gRJPcqTWqPPNMIw", "text": "My 8 year old daughter and I stayed at the B&B this past weekend.  We stayed in the Sorenson room which was the right size for us.  It had an attached, good sized bathroom which was great, and my daughter loved that she got to take a bath in a tub that was over 100 years old.  (The water pressure is great by the way).  There was an assortment of soaps, shampoos, bubble baths etc in the bathroom too.  The room and bathroom were clean and spotless.  Craig was extremely nice, helpful, and whipped up a killer breakfast.... a brown sugary, apple, cranberry, upside down baked french toast kind of concoction, homemade pumpkin bread, fresh watermelon, and sausage links.  He was very accomodating and asked us the night before if there were any allergies or food issues that he needed to know about.  The price was very affordable, and the next time I'm in the area I'll be staying there instead of a hotel.  : )", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2012-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xIbUUfdIZJ8wOlp_Aa6m_w", "review_id": "r4srdOnmWSdB49AtXV94uw", "text": "Loved staying here.  We were going up to Madison for the day and found this place through a quick Google search of Madison-area B&B's.  Craig (the owner) was so helpful and friendly when I called to inquire about prices and availability.  He was also awesome and asked about our dietary preferences (I'm a vegetarian who's also temporarily gluten-free, whereas my boyfriend will eat anything) and promised to have a yummy breakfast we would both love.  When we got to The Parsonage, I was so happy we decided to stay there instead of in Madison proper.  It was quiet and cozy.  We picked the Mentor room which had a big awesome jacuzzi tub in there, and also a really nice outdoor patio (which was covered in snow, but i bet will be awesome when spring comes!).   Our bed was SO COMFORTABLE, i think i actually miss it.  Since our room didn't have a shower (which we knew when we booked - well worth it to have that awesome bathtub!), I used the shared bathroom on the second floor which was also very nice and cozy.  Breakfast the next day was so nice.  Craig made homemade cranberry orange muffins with a cheesy kale egg dish - so yummy!  Everyone else got delicious smelling bacon, and Craig very awesomely made me veggie breakfast sausage.  There was also pineapple, juice, and a really great tea selection.  The conversation was also really nice - I like that we all ate together (me, my boyfriend, Craig, and the 5 other guests who were staying there.  Great people and great company.  Next time we are in the Madison area, we will definitely stay here.  Craig, thanks for all the hospitality!  From Denise and Justin", "business_id": "XrzTVrJAjs0yYLvhFI9vkQ", "stars": 5, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "LFmGd7MWHPdXxx0MqNc1Eg", "text": "Great little bar, friendly bartenders (unlike the *other* Spartan- ahem!) and super pizza.  A little on the smoky side, except for a one-day-per week smoke free Saturday, so time your visits accordingly.  Decor in the restaurant could use some updating, but it's a small-town family owned joint that is what it is....", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 3, "date": "2009-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "k-BRt793-4V9GSBSQsOIVw", "text": "Spartan Pizza is going smoke-free on March 1, 2010, well ahead of the ban.  Way to go, Spartan!!!", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 4, "date": "2010-02-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DBp9UzN6WyaFhqzTn7dXIw", "review_id": "40-skjvQoI-Bf0RJs5972Q", "text": "Good pizza (not like Pizza Hut, more like home-made) with a great bar with nice, friendly service.", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 4, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "GYpZ9dPzO3vqrr1lXcXi8g", "text": "Good enough for carry-out in McFarland on a cold winter's evening.  Ready on time, never had a wrong order, and they're at least reasonably friendly.  Would be better if they delivered, but not sure there's a huge demand for it in our tiny burg.  They also have a lunch buffet on weekdays for around $6.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 3, "date": "2010-02-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "hvSlzpUUdKq7qO8uvwPqOQ", "review_id": "UB48XPeYsvvWzYXeV7WsaA", "text": "Main Moon is hand's down my favorite place to grab Chinese in McFarland, but really anywhere. No matter what time of day, day of the week, or week of the year - it only takes 15 minutes to get your food. Freshly made each time too. Don't order from the pictures, order from you heart. The staff is so friendly, I'm thinking about proposing in the near future, as I hope to be a part of their family like they've been a part of mine. I just can't even talk about the lunch buffet, I'll start tearing up with how amazing the deal is. Andddd, I just shed a tear. Yum yum yum in my tum tum tum. Miss you, Main Moon xoxox", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 5, "date": "2014-02-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iOPfu26Siat3sx-8SM63OQ", "review_id": "nFPe7kazeEVjPP7zgoK4Og", "text": "Main Moon has the best lunch in McFarland, buffet style. Friendly service, gloriously large takeout menus, and sauces like no one else. Try their fried pork dumplings, crab Rangoon, or General Tso's. Their fried rice is legit. All portions are generous. Until secondary Moons are established, make your lunar landing as soon as you can. Delicious.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 5, "date": "2014-02-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WLqxkkd-jJ4cuoyqRBTw_w", "review_id": "b_gnK6JS0BHardzlgdZoKg", "text": "Leaps and bounds better than other chinese food in the Madison area. Their lunch buffet is a great value. The general tsao's is to die for.\n\nDon't miss out on this fantastic food.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 5, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "4AGRXB5C588iitXZY-y3wQ", "review_id": "Hufi0DEjKKyGiCu41DA07A", "text": "Wendy C., how can you review a place that you've never been to? I'm sure the Great Barrier Reef is worth a 5 star review, but I can't give it only 3 stars because its inconvenient (or any review for that matter). \n\nAnyway...saw Crandalls in Madison Magazine and the photos stood out to me. I didn't want to drive to the East Side for the Esquire Club. I was reluctant to try take out fish fry because I was worried about fried food getting soggy. \n\nI gave it a shot and I was impressed! \n\nFirst, the fish to beading ratio was really good. Big thick pieces of flaky fish with a dense, probably corn meal based, and crumb-style breaking (as opposed to the extra greasy tempura- style batter). It was nice and crunchy and the breading stayed that way on my 5-10 minute drive home. Tip: crack the styrofoam container to let the steam out for extra insurance against soggy fish. Served with a lemon. \n\nThe fries were coated in something that made them extra crispy and they had a good seasoning. \n\nThe slaw had good flavor but lots of dressing. Purists might say it was over dressed; others might say its just right. \n\nTarter sauce was a little sweet and tangy, which was good contrast with the fish. The server gladly gave me extra. \n\nThe bun was just as you would expect from a supper club, cheap, white, and doughy. Served with a butter chip. \n\nEverything was served together in a box; everything you need except several icy cold beers.\n\nThe service was fine. The take out window was nice. It takes a few minutes for the order but I think they fry-to-order which is well worth it to me and a big plus. Any you cut it, it takes less time than waiting in line for dine in Friday Fish Fry.\n\nA little spendy for take out fish fry ringing up at over $25 for two dinners. That would be more than fair if I could park my fat ass there all night and eat all-you-can-eat. \n\nIt's worth it though and I'll be back.", "business_id": "HxPpZSY6Q1eARuiahhra6A", "stars": 5, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0iPA-UDoxZzA-HCByswY8g", "review_id": "e6ktB6c_47W5Qy2yRvtLxA", "text": "The fish fry is awesome.  Loved it long time.  The red potatoes with cheese are delish.\n\nIt's carry out but that is fine.\n\nTake it out, pop in a movie and have a brandy old fashion.\n\nThe latinos working their are hot too.", "business_id": "HxPpZSY6Q1eARuiahhra6A", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tNxt3gCPObCrB5GDUSnlig", "review_id": "NBR84mZl00855z5nhXMkjw", "text": "Crandalls has moved to state street, and is now serving authentic Peruvian food! We went there for dinner tonight, and it was fabulous. I highly recommend the cheese empanadas, solterito (fava bean and corn salad), and the chaufa de quinoa (like fried rice but with quinoa)! They make chicha morada, which is a drink made from purple corn, and is super refreshing.\n\nCrandalls is owned by a very sweet family from Peru, and I'm so happy to see that they are now showcasing their roots with their new restaurant!!\n\nThey do still have their famous fish fry, and it looked like the lunch menu has cheese curds and sandwiches as well as ceviche.", "business_id": "HxPpZSY6Q1eARuiahhra6A", "stars": 5, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "yzxywpa_yUw8-jZKT-RQdA", "text": "Authentic good quality food in an old style Chinese restaurant setting.  Very satisfied overall with my first visit.  Second visit included my six year old which was not so good, they don't even have crayons for a child.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2007-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SaA0kpMsNDfN_kI1HVK-Xg", "review_id": "waN4WoehyDitk7-jyLYKyw", "text": "This is a good Chinese place. Will it take you to a place you've never been? No. But you will leave satisfied.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2008-01-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "VQ5ulvpbdtMG62G-6YZEsg", "text": "I think some of the best Chinese food in Madison.  A little pricey but a few dishes always feeds me for at least two additional meals.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "v_7KW52Z8r_su8v4uV98MA", "review_id": "_0ugMyohu3HtvtmHXmJWng", "text": "Probably the best Chinese in Madison these days.  Unfortunately, that is not saying much.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2009-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OGxuqUZtoynJ6ayz_VCfyQ", "review_id": "huwwc1ZpFgCtV2WLS9qIXQ", "text": "Best chinese is Madison by far, but very expensive! You do always get great service though. Yum!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2010-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TF9woBMrU3THfrGXo038fA", "review_id": "PtYEtgyiHYvNF2CcZ7v9Lg", "text": "We visit family in Madison at least twice a year and always make sure to have dinner here.  The shrimp sizzling rice soup is absolutely to die for, and every entree I've had has been fabulous.  Hands down the best Chinese food I have ever had.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Orf6p06pNjMHuPXypLbn-w", "review_id": "9mnSxTZlMmtt7uWj_nLsJQ", "text": "This place is wonderful.  One, Almost anything on the menu can be made gluten free.  Two, They have about 7 different types of loose teas to choose from.  Three, The food is GREAT!\n\nMy favorite dishes are the Three Delicacies Sizzling Rice Soup and  the Tofu Lettuce Wraps.  I am not lying when I say that I have NEVER had a dish I didn't like here.  The food is never greasy, never oversauced and never overcooked.  The seafood and veggies always have a really fresh taste... I seriously have no complaints at all.\n\nI miss you.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v_7KW52Z8r_su8v4uV98MA", "review_id": "DcJZa7xKv24j75BHu4Lupw", "text": "Just an update to say they don't even have the #1 spot anymore as that goes pretty easily to Ichiban on park.  Still, better than most in town.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "to4yos7TkaDe45-keAg74A", "review_id": "Dv0BTyIpNhHM7N_HJ3jV3A", "text": "We only ever go for their lunch special - so that's what this review is, I haven't yet gone here for dinner.\n\nThe dishes are a little hit/miss for authenticity. The Imperial Chicken is really good (not breaded like someone else said, but it's great), the sweet and sour chicken is definitely a \"miss,\" the mu shoo pork is great, although a tad greasy, the fried spring rolls are fantastic, the egg rolls are okay. \n\nThe service is FANTASTIC and the price is unbeatable for what you get. We never walk  away from lunch hungry. I suggest getting there a little early for lunch (they open at 11am) because it can get a little crowded.\n\nAlso, I love their spicy mustard - you have to try it!!!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k_M8LHAb-eJiMJ8dohrEyw", "review_id": "P0HcCuf-Ghg35Fs7-mQACA", "text": "Grilled potstickers, moo shu pork, cashew chicken. Yum!!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LFFOb2_HufbLkXNoBTrKIw", "review_id": "jh8euyAwA6dTGPwf3FEZTA", "text": "Yum!  Party of 7, everyone ordered their own dish and then shared with all.  Started with pot stickers and shrimp ragoon.  Grilled pot stickers were really good, could have just eaten those and been happy.  Appetizers came with a variety of dipping sauces.  Best dishes sampled were crispy orange beef, almond chicken and generals lamb.  Lamb was way tender, excellent choice.  Service was prompt and friendly, great atmosphere.  Ended meal with delicious mango ice cream.  Left happy and very full!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vLFk6nslFe35NKvlU2Tz9Q", "review_id": "nyPckYp-rdb9LCN2ti0AJQ", "text": "Decent food, slightly more expensive than their competitors, and more legit varieties on their menu.\n\nI'll give credit to Imperial Garden's decor as it is significantly more eye-pleasing than other Asian restaurants and the fact that they have a full bar. \n\nI give kudos to this place because they're the only Chinese restaurant in the area that offers peking duck, a true Chinese specialty. Their seafood selection is also pretty upstanding and are cooked well. I'm also a fan of their \"banquet\" specials, which is for when you go in groups and they offer you a selection of X many dishes to share for a set price per person (this is available for lunch and dinner I believe, though I've never been here for lunch). \n\nAside from the aforementioned pros of Imperial Garden, the other dishes on their menu (if you order without doing the \"banquet\") is average-tasting at best and overpriced.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6rMHhS3Hf_Ofn1hYaxaUgQ", "review_id": "Rh9GIe9GixvV6Lwr-vBMXA", "text": "Im rating this more on being American Chinese then true authentic Chinese. That being said it was very nice inside. Not too formal but definitely not a take-out joint.\n\nWe got a cup of the Hot and Sour soup. Which is always my favorite. To try something different we got the Seafood Hot and Sour soup also. Almost taste just like the regular Hot and Sour put of course more of a seafood flavor then pork. It only comes in a serving that serves 2-3. Which is a great value because the 3 of us easily got 2 cups each out of it.\n\nThe Fragrant Pork had chestnuts, green peppers, onions, mushrooms and carrots in a garlic tomato sauce, Said that it was spicy hot put I only got a tiny bit of kick. Put still good being sweet and garlicky. \n\nThe Three Delicacies Sizzling Rice dish caught me by surprise in a good way. Expecting it would come with that same bland and over salty white sauce. But I couldn't stop tasting the sauce. It was like no other white sauce I have tasted before. The waitress poured the sauce for the dish right in front of you so it was \"sizzling\". The rice was on the bottom of the skillet plate so it ended up getting crunchy. Adding a great texture to the dish. The shrimp, scallops and chicken in the dish were tender. Also in it were pea pods, water chestnuts, carrots and mushrooms.\n\nEven the fortune cookie at the end was a better grade cookie then take-out places.\n\nService was helpful, attentive and friendly.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "0iPA-UDoxZzA-HCByswY8g", "review_id": "--uHuB7Q9AbWPZPJoszIfg", "text": "For Wisconsin, this is about the best you are going to get for Chinese Food.\n\nSorry, you live in Wisconsin.\n\nBut the food is very good.  Huge servings, enormous shrimps, chicken that is tender, fresh rice.\n\nDon't complain Cheeseheads, this is good as it gets for Chinese in Wisconsin.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2013-02-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "exEi48wqihTORdLbYyR8kA", "review_id": "fWwjh-79aID8x1qT3S0zZA", "text": "Yum. Check out back of menu soups. Very good!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2013-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lI9O3GZm72B94WudEYkp6w", "review_id": "Mv8xaRhWFbTLLIULmEuHfg", "text": "Lettuce wraps 3x better than PF Changs. If Yelp reviewers consider PF changs 3 stars, then this gets 5.\n\nJust to clear up for those who want authentic Chinese. Go to ICHIBAN NOW!!!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fVkYELANscaNkQq-x2OAeQ", "review_id": "TvKHCDE5MdQEfCYqPcD14Q", "text": "Best Chinese food in the area. Great service and calming atmosphere.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QIC6eYpIE1jyJlxYwXcb7Q", "review_id": "cke8mgbsBkRsSjTEQU4FPg", "text": "Always consistently delicious! Classic preparations of Americanized Chinese. The cashew chicken is great!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2013-12-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U0EwhTMkyoJ9vbvwlZcA5Q", "review_id": "0nuJExgk48zYRoqAWQnLUg", "text": "I was in town visiting family and someone suggested IG. When I drove up to it, it brought back yummy memories. It's been years since I ate there. I am glad we went there for dinner. We ate governors chicken, governors beef, sweet and sour chicken, peppered beef and beef chow fun. Everyone ate their plates! Service was slow that night but the food made up for it!", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2014-01-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "vaNuGM0tK71iR1-xg3nrfg", "review_id": "fGux-9aYtQU1t2lQ9rgPwg", "text": "There's a climactic scene in the movie Drive where the hero meets the badguy in a 'Chinese' restaurant. It's a prop for the movie to sell the idea of foreign while these two real bad American dudes hash out their differences. It's rich and exotic and mysterious and... goddamn exciting. \n\nIG is a Chinese American restaurant in the burbs of burbs that serves burbanites, but man it had that feeling.\n\nThe Russian friend and I went there on a Sunday night for their Peking Duck special. We got that and some appetizer platter and some wonton soup and some cocktails. None of it was particularly memorable, and in fact the Peking Duck skin was *not* crispy, but the presentation was spot on. There's been so much streamlining of Asian restaurants that nice chairs and big booths with lots of room is uncommon. And on top of it I am a sucker for ethnic restaurants that have good servers that can connect with customers. Do you know how rare that is? Take advantage and talk it out. Be polite and get good service.\n\nI don't think Madison's foodies would give this place four stars. But I saw a bunch of other slant eyes here with me, and I imagined they were like me, wide eyed and happy to be here eating whatever this was.\n\nI'd take my mom here.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2014-01-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aQZM7L_HPqTsRdFXhQExZw", "review_id": "xTUg5ZFk6-hqZExh-DGGvg", "text": "Hands down the best Chinese food in Madison. The chicken chow mein has been a favorite since I was a child. Try the egg rolls and the jasmine or chrysanthemum tea. You really can never go wrong here! The decor is beautiful, and makes you almost feel like you could be in a restaurant in China.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 5, "date": "2014-01-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "9SU4T5EvO3UVy7e-26yCjQ", "review_id": "y5INUyGwV3PK84kKVFvpkA", "text": "This is our go-to Chinese restaurant in the Madison area.  Hands down, it's the best Chinese I've found so far.  I'd give it 5 stars if the prices were more reasonable and the dine-in environment was better.\n\nLike I said, the food is superb.  My usual dish is Cashew Chicken.  It's hard to deviate from that when it's sooooo good.  Other dishes are excellent as well.  What I like about Imperial is that the meat quality is good.  The beef is tasty and tender - not tough or \"questionable\".  The chicken is good as well - not some of the gray chicken-like material found at lesser establishments.  \n\nWe don't dine in often or at all.  It's a little more formal than I prefer, and the experience can take a while.  Just not my preference.  I keep their number in my phone and call ahead for carry-out.  That's the way to go here, imho.\n\nTheir location is very convenient for those of us that work in town and live in the western 'burbs.  The portions they give out are very fair - my cashew chicken typically leaves me with a nice lunch for work the next day. \n\nIf you're looking for top-quality Chinese food, I highly recommend getting take-out here.  If you don't mind a more formal setting and have the time, go ahead and dine in.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "AC4-bAcxK_E1nwUPaYYqmQ", "review_id": "_wUFwGWeMyj1q1tNkkfLBw", "text": "Great Margaritas.\n\nBut it's hard to review a mexican restaurant that's as good as the next.\n\nI still wish there was a TRULY good mexican restaurant in Madison...\n\nStill waiting.\n\nAnd don't come tell me ... um... the one on Park.. what's that name???\n\n....\n\nLa Hacienda.\n\nI'd rather poke my eye out or eat at La Bambas....", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 2, "date": "2007-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dFSg9ZUwdvXO1c1ZACgZzA", "review_id": "p1E-TKofflpKoQZVRYGQsQ", "text": "Ok Mexican like everywhere else. I completely agree with the previous reviewer, \"when is the authentic one coming to this town?\" The menu cover page says it's authentic, but the men items themselves looked little more tex-mex ish. I had a fajita plate while my friend had a chicken dish (I forgot what it was called). My fajita arrived on a sizzling hot plate (that's takes care of the \"fun part\" regardless of the quality), and it was pretty good. The portion was huge, so I had to take ha;f of my plate to go, and the take out became the perfect left-over dinner next day.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2008-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "0Id-TIObT-nkTFn8qxtFVg", "text": "Mi Cocina is my favorite Mexican-style restaurant in the Madison area.  I have never come away unimpressed with either the food or the service.  I can't really speak to authenticity since I wouldn't really know it if I saw it, but for what they do Mi Cocina does it well.  All I do know is that I have gotten my favorites here over and over without ever having any problems.  The staff is always friendly and fast which sets the place apart from several other area restaurants of the genre.  If only for consistency I would rate Mi Cocina a three, and with never having a bad meal I definitely would go with a high 3.5 - 4 stars.\n\nLast time I had the fried tilapia tacos, and I especially enjoyed the spicy cream-based sauce that was served on the side.  It was perfectly seasoned for my taste, though it was a bit hot for my mother.  The tilapia was lightly fried and was still tender.  The accompanying refried beans were decent, and served to allow for the spice from the tacos to dissipate.  I still put the blackened tilapia tacos at Tex Tubbs at the top of my favorites list, but these easily jumped to the #2 position.  On previous trips I've gotten flautas, which were perfectly fried and not too crispy, and the enchiladas sonora, which comes with an excellent spinach and a creamy sauce.  I also really enjoy the cheese and mushroom quesidilla and the fajitas.  My sister, who is lactose-intolerant, had found the menu a bit dairy-laden, but she did end up finding a chicken breast entree that is now her favorite.  The prices are quite reasonable and given the amount of food always a good deal.  Mi Cocina probably won't ever be held up as a paragon of the style, but it has always been reliable and enjoyable and for that I'll keep coming back.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 4, "date": "2008-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "XiZqiVEOQMQRmjSriBumVQ", "text": "The food is decent, the service is better than your average Madison restaurant and the bathrooms were clean.  It is a bit out of our way but it is consistent enough to warrant more visits.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2008-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b6zxvmCa1a-ggWxObSweZw", "review_id": "jLI0BmiPnPfovnFPsqmGFA", "text": "Good food - especially if you're in a hurry. \n\nThe service is excellent.  \n\nIf you're in Brookfield try the Mi Cocina on Bluemound - I believe owned by the same people but the food is bette.r", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2009-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "P8XxDN4-AZJmgqYpv864Nw", "text": "After a wonderful day spent sitting down at the Memorial Union, drinking beer and reading through the Sunday newspaper, hunger got the better part of us, and Mexican food sounded yummy.  So, our small group made our way back toward the Middleton and decided to take a short walk over to Mi Cocina.\n\nWe arrived at around 6:00pm on a Sunday and were promptly seated.  The waiter brought us chips and salsa immediately, and then took our drink orders.  Within a few minutes, our sodas arrived, along with a cheese dip.\n\nWe quickly scarfed down the salsa and cheese dip; the salsa was initially mild but then had a nice little kick to it at the end.  The chips were a thicker cut chip; they weren't the slightest bit greasy.  The queso was excellent - nice and hearty, white cheese, delicious.\n\nWe ordered our entrees and within minutes our food was available.  There was a slight mix-up with my order - I had requested chicken burritos but received beef.  No big deal; the beef burritos were decent - some chunks of potato were an interesting touch.\n\nMy dining partner ordered a sampler plate, which came with a chicken burrito, a chicken enchilada, and a tamale.  It was good as well; the chicken was far better than the ground beef.\n\nService was beyond excellent - very fast, very attentive, and as such, we left a nice tip.  Only complaints?  A tad pricey - our meal was $26 without any beers/margaritas, and there were a ton of kids in there, which was a bit distracting.  All in all a decent experience.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2009-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tpd1sxBuNgRaJcEYUQL2PQ", "review_id": "V_r7BJcyRWa2ZaEKS8ZKcQ", "text": "Kids eat free on Sunday!", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 4, "date": "2010-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HSfNIKyrpjGuh27nH4i0Ug", "review_id": "zsA4brB_64g6_ShSciIS4A", "text": "I love their taco loco. It's a mouthwatering fajita/taco salad concoction that I\n a. can't get enough of and\n b. can't finish.\n\nI have tried a few other dishes and nothing ranks near the crazy taco.  Warm, thick chips and a mild salsa are served bountifully. The chips aren't greasy and are not heavily salted which makes me happy. I like to add my own anyway.\n\nThey have three versions of guacamole. Yesterday we tried the most basic which was delicious and simple. We also tried an appetizer with cheese and chorizo. It was good, but quickly coagulated which resulted in an undip-able dip.\n\nMARGARITA ALERT- their house margarita... not a traditional margarita. In my opinion, it tasted like watered down orange soda. And the color is a light peach color. If you want a classic, lime margarita I have yet to find one I love here.  I'm not your typical margarita drinker.  The aftermath of too much sweet margarita mix and I do not get along.  I admit,  I'm kind of picky about margaritas, but these, these should have a warning when ordering.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 3, "date": "2011-01-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cnYrqqeLhqY04kqsopBGng", "review_id": "MWJS4mfw0Rji_pyAaj31Cg", "text": "Good authentic Mexican, a lot of menu options, great service, nice quite atmosphere.", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 4, "date": "2012-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bIXI5KABBzU1Nt_RaB6Nug", "review_id": "zaGZsJTnQMSXepntO6Vsxg", "text": "I really enjoyed my dinner here. I had a fantastic fajita platter, which included beef, chicken, shrimp, and the requisite peppers and onions, but also whole scallions and tomato wedges. Delicious! The guacamole was decent, though a little bland. And my husband's mole sauce was just OK. But I really liked the spicy salsa they brought to the table when I requested it.\n\nThe service was pretty great; there was a whole team of servers that were constantly checking up on us to make sure we were doing OK. Every time we had a special request (see: the spicy salsa), they were right on top of it.\n\nBut what I REALLY liked was the margaritas; our table had a pitcher of blended strawberry margaritas, and they were absolutely perfect. Blended just right with no big chunks of ice; perfectly balanced strawberry and tequila flavor. I could have consumed that whole pitcher by myself without even putting in too much effort. Yum!", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 4, "date": "2012-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cMfvLtBnyXo5xlm9IB-8Og", "review_id": "eNM6eMF-GODA0CinGsayAw", "text": "This is my favorite Mexican restaurant in Madison - and I think it is the best one in town.\n\nHere's what I like:\n\nThe House Guacamole - Heaven! I always order this, and the last time, we had a table side preparation, a clear demonstration on how fresh the food is here - another thing that I love about this place - the abundance of fresh food. In all its simplicity, it's perfect.\n\nThe salsa - I've disappointed all over Madison with other Mexican restaurant's salsa, and even for that matter, all over the Midwest and parts of California. I've had the best salsa here - again very simple, but very delicious - and isn't that what matters? Food should be delicious, especially food at any restaurant.\n\nThe chips - so good, so delicious. Yes, seems so silly to rate the free chips, but again another sign that this restaurant cares about how food tastes and only serves the best of ingredients and food.\n\nAs mentioned above, the abundance of fresh ingredients, especially fresh vegetables, in all dishes.\n\nAs for the other entrees, I've never been disappointed. Take your pick - they're all good.\n\nThis restaurant has actually moved, and is no longer located on University Ave. They are now on Allen Bvld. I think they have settled in to their new place, and service is back on par.\n\nBon Appetit!", "business_id": "77ESrCo7hQ96VpCWWdvoxg", "stars": 4, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "N-0xuc5iePJ6hJ0VnSHN5Q", "text": "I love Zimbrick Acura. I love every Zimbrick in the city for that matter. I have never had a bad experience here. I have come here for every little item I needed done and have never felt cheated or had the blanket pulled over my eyes. There have been a few things where I was expecting a HUGE bill for things like the stabilizer for my rear suspension that had been slightly bent. I bought a new one and brought it in thinking well Labor will be $100. Zimbrick got me right in, said it would take an hour, had it out in half an hour and didn't charge me a dime. Another time I have come in expecting to replace all my breaks and rotors and Zimbrick saved me about $300 without having to replace everything. \n\nI have worked with a few guys here and they have ALL been extremely professional and treated me like family. The guy I usually go to even just chats with me about cars and such while i'm having service done. (Mainly getting my oil changed). The facility itself is nothing less than perfection, in my opinion, when it comes to dealerships. It is clean, well layed out, they have a great lounge with a Big Screen TV, leather chairs, FREE WIFI, and the best of all... Free Starbucks Coffee. I have had nothing but great experiences from Zimbrick and not just Zimbrick Acura. However, BECAUSE of Zimbrick Acura I expect to buy another Acura and stay with them for a VERY very long time. Thank you Zimbrick Acura! YOU GUYS ARE THE BEST OF THE BEST.\n\nP.S. When I was having major service done they let me choose what I wanted to drive while I waited for the day.  NOBODY does that. So I had some fun with a brand new TL one day on a secret \"test\" road Zimbrick European showed me when I was buying my car just off Rimrock Road.", "business_id": "9brW55Vzyi3ItboHWfoepg", "stars": 5, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9TDqZLPsOgWERXii_etbcw", "review_id": "S96SbDEyr6dXImYnYXVs5A", "text": "The outdoor sand volleyball courts are nice, and there is an outdoor bar area for spectators, celebrating a win, or drowning your sorrows after a loss.  There is also a playground right there which is nice for people that bring their kids along.  The outdoor soccer field looks nice, but they don't have a scoreboard, so you can't tell how much time is left in the game or keep track of the score.  The facility seems well kept, and the staff has been very nice.\n\nIf you have a serious team and are competitive, Keva is a great place to play sports.  If you are looking for something more laid back and social, there are plenty of nice bar leagues around which may be a better fit.", "business_id": "368m5-RtrrYWf4hPM_bMlg", "stars": 4, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uhsQFs68oZHrKVMPinwfrQ", "review_id": "L0jJZuNLkLFHU3wS3nfmig", "text": "keva is a large sports complex with indoor and outdoor soccer, volleyball and basketball courts. it is hands down the nicest facility i've played volleyball at in the madison area. it would get more stars from me if it weren't for a few things: \n\n1. their leagues are much more expensive than others in the area (and the seasons are shorter as well). pooley's and mscr don't have the same facilities, but their seasons are longer.\n\n2. it's in the middle of nowhere. the location is only convenient if you live in Middleton or on the far west side. driving there from anywhere else suuuucks, especially in the winter.\n\n3. it is always cold in there. if they're going to charge what they do for leagues, the least they could do is turn the heat up a bit, or do something with their insulation.", "business_id": "368m5-RtrrYWf4hPM_bMlg", "stars": 3, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s__z7O5ybdky0KmXkA6MZA", "review_id": "-IZnuvii3PkudUtn6xQ-Jw", "text": "My wife and I have played in the volleyball leagues (sand and indoor) and our kids do some of the kids programming.  Facility is very nice and great atmosphere. Instructors have all been really nice and referees do there best, but very nice. :) Only reason I have it 4 stars instead of 5 was because of the high costs. As someone else said in their review, it is more expensive and sessions are shorter. But overall,  very good.", "business_id": "368m5-RtrrYWf4hPM_bMlg", "stars": 4, "date": "2014-02-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vlSA47FlfINOpooclRc7VQ", "review_id": "hHBoVh_8HxDmQWMxBfXNuA", "text": "I really enjoy this shop. Its definitely. Pricey, but high quality so i feel its worth it for the bird seed maybe not the feeders. But backyard birders should definitely check it out", "business_id": "YjoSdr8uJslIebsQP6c18w", "stars": 4, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "011Ny5tOdSs_ZI_EzILaRA", "review_id": "9TBjzZPKqMZakIQC0UbP7g", "text": "Best birdseed in town. Love their feeders but they ARE overpriced a bit.", "business_id": "YjoSdr8uJslIebsQP6c18w", "stars": 4, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0-Ah9tvcmZruTYLdatVnYA", "review_id": "fPcj0jLlazfzVxZM5h3Cqg", "text": "Great selection of birdseed, birdhouses, books, and other fun wildlife-related gifts. Yes, they may cost more than eBay, but you get great service from the staff who are helpful in answering questions. They are knowledgable and happy to help.", "business_id": "YjoSdr8uJslIebsQP6c18w", "stars": 5, "date": "2013-06-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "XxWsOrQp0gCzDmvOsGvYyA", "review_id": "osWQaFa6Odook3kTUe4ygQ", "text": "Only stayed two nights but would be very comfortable with a much longer stay.  We had a 2-bedroom suite and it was HU-uge!  Two masters, I initially took the one closer to the front door before realizing I'd given the kids the king bed.  Mommy don't play that.  I made everyone switch.  Three tvs.  Two ironing boards and irons.  Kitchenette.\nThe layout and amenities was very much like a Residence Inn but maybe a (small) notch cheaper.\nThe pool/hot tub was really nice.  Indoors, clean and completely empty AND open 24 hours!  Who does that?  It's completely separate from the other buildings, so we didn't feel bad when we were having chicken fights at 11:30 pm our first night (jet lag, ya know).  When we checked in we were told many of the guests were \"transplants\" so we'd most likely have the pool and hot tub to ourselves.  Which made me ask, why would people relocating to the area not want to use the pool?  Doh!  She meant literally transplant PATIENTS at Univ. Hospital or the VA.  I guess I went blond for the weekend...\nOn the map, you'd think there would be major freeway noise as this hotel seriously couldn't get any closer to the beltline.  We heard absolutely nothing.  Either there's good soundproofing or they shut the highway down at midnight.  Also no noise from other rooms.\nDecent standard buffet breakfast.  Sunday paper had no funnies... Did they take 'em out or don't they do that in Wisconsin??\nI would totally stay here again.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 4, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Nh9Nh26tHHwmFigMOO-CUw", "review_id": "QQYSbgH6yIkmtSYhbJBi2A", "text": "I recommend you stay here if you need a hotel in the area. Comfortable and clean. Stayed here two nights. Breakfast is always really good and really well stocked and FREE. On certain weeknights they serve FREE BEER. FREE BEER. \n\nThe service at Staybridge is always stellar and this location did not disappoint. Kenny deserves major props. He was really cool.\n\nInternet worked great (free too) and everything in the room was in working condition and clean. \n\nThe sitting area in the lobby was a happening place and very relaxing to kick it and watch sports. Nice place.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2011-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDqWHJG-NQq9ycwV07wjkg", "review_id": "NjYnkcTBBAn_3EjR0vTPSg", "text": "I recently spoke with the manager regarding extended stays at this location and he provided a tour of the facilities and a couple rooms. I'm extremely impressed with the service and facilities and plan to go here for future visits while in the Madison area.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2011-12-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDqWHJG-NQq9ycwV07wjkg", "review_id": "RnEU_kI5BGGWfUUeIUFuvQ", "text": "I've stayed here a couple times now.  If I reviewed my first stay if probably would have been 2 or 3 stars. Lucky for them.  \n\nBack to my most recent stay.  It was the best experience ever.  (Second to the Double Tree in Carmel, IN.)  I walked in the lobby around 1PM and was greeted by Bobbie.  He was handling the desk by himself and I explained that we would wait in the lobby until they had a room ready (since we were 2 hours early for check in).  \n\nMy husband was anxious to watch the Bears game so he found a spot in the cozy waiting area with a big screen TV.  Bobbie offered to check us in early and I asked about our accommation request to be near the elevator or an area that would require very little walking.  It appeared that he may have had a challenge with our request.\n\nI explained the huge inconvenience with our last visit.  The lady that checked us in, sent us to one of the farthest rooms along the zig zag cooridor.  AFTER we requested a room that required very little walking (due to traveling with a family member on oxygen) and THAT was the best they could do for us?  My husband was exhausted before he was half way to the room.  Needless to say, he didn't want me to request a \"closer\" room after that.  This is why I give them my request when I book the room.\n\nFortunately for all of us, the extra planning helped. An extra bonus was that Bobbie ask if I was Priority Club Rewards member.  Well I wasn't, but I planned on asking...and of course it slipped my mind.  Thankfully, because Bobbie asked me about it, I am now a Priority Club member! This is great because we will be coming here a few times a year.  Bobbie was really good about explaining the details of the membership and even let me know how I can get extra points online.\n\nDid I say how great Bobbie was?  Well...he was everywhere!  He hand-delivered our new membership information to our room (with chocolate and a beverage). Whenever he saw me in the lobby, he always asked if there was anything I needed.  He also helped out with the breakfast buffet in the morning.  He literaly was everywhere!  It's not like he was leaning on the counter when I saw him.  No, he was very proactive in genuinely making his guests feel comfortable.  He's definitely a keeper.  \n\nWhenever I'm in the Madison area, I will continue to book at this Staybridge because of my experience and the excellent service that Bobbie provided.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2012-12-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mDqWHJG-NQq9ycwV07wjkg", "review_id": "T2VjBxpQg9GY26MYA2Focg", "text": "So I used the \"CHAT ONLINE with an agent\" option today.  You can find this link near the top, right side of the screen on the main Overview page on thier website.  I've used this feature with other organizations in the past - so it wasn't really new for me.  I chatted with Vivian and she answered my quick question about dog fees in a timely manner.  That's all I could ask for.  Thanks Vivian!  \n\nSince I wasn't able to find \"Dog Fee\" information on the website, I offer the info here:\n\n\"Pets allowed with nonrefundable fee of 75 USD per stay. No larger than 80 lbs. Pet agreement must be signed at check in. Call hotel for details. Record of complete and up to date vaccinations required.\"\n\nI hope this helps all the dog lovers out there.  :)", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 4, "date": "2013-01-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mDqWHJG-NQq9ycwV07wjkg", "review_id": "qjvo8SZMWwEkjkB4UBs5gw", "text": "I can't say enough great things about this location in Middleton.  Earlier this year, I had a one-bedroom suite for almost three months.  A family member was in the hospital at UW-Madison during this time and this hotel was more than accommodating for the specific needs in our situation.\n\nI'm not going to go into the specific details of the accommodations partly to protect individual privacy.  The other reason not to get so detailed is simply because I think the staff went so far out of their way that these \"favors\" may potentially be abused by other guests if they were aware of the extreme kindness.  \n\nAs I mentioned, this hotel offered many special accommodations.  This allowed us to truly  feel like we had a \"home away from home\".  Most of the staff knew me by name.  They were sensitive to the fact that I had a loved one who was in the hospital and critically ill. I wasn't alone in this, though.  There were many other guests in a similar (if not same) situation as me.  This hotel could be a pilot for partnering up with hospitals in a win, win, win scenario that benefits the hotel, hospital, and the guest/patient.  In addition, I would not be surprised if they have special training for their staff in the area of customer service and handling special accommodations.  \n\nThe manager, Brad, is visible and on-site on a regular basis.  He and his staff organize and manage a social for their guests three nights a week.  The social offers a free meal and drinks (including beer and wine) for a couple hours in the evening. And, as the name describes, it allows their guests an excellent opportunity to socialize.  \n\nThere are several hotel options recommended by UW and we tried three of them.  This one may be five miles away from the main UW hospital, but it is a straight shot along University Avenue.  Now that UW purchased the Best Western Intowner, there is much more of a push with them recommending their newly owned property to UW patients.  The Intowner is fine, but the best thing going for it is how close it is to the hospital. The Staybridge-Middleton, outshines them in so may ways - indoor pool, hot tub, laundry facility, garage, large suites, kitchenettes, socials, breakfast buffet,and most of all...the staff.\n\nUnfortunately, I can not remember all the names of the staff that I would love to thank.  Our housekeeper was perfect.  She cleaned only when we needed it and got to know our preferences.  For instance, she asked if we could use an extra box of Kleenex because she remembered us requesting an extra box the week before.  She always did a great job cleaning and freshening up our room and never invaded our space. \n\nI noticed how well the staff work together as a team and support each other when the need arises.  It's obvious that the staff members are cross-trained to manage various work areas and different shifts.  For instance, I first met Bonnie on the shuttle.  She arrived at UW Hospital to pick me up.  She even showed me a quicker route back to the hotel during rush hour.  During my stay, I also saw Bonnie at the front desk, at the breakfast buffet, in the kitchen area, in the dining area, managing the socials, and even came to our suite to fix the television!  It turned out that the remote needed new batteries - which she was prepared for.\n\nI also feel like I got to know Ana pretty well since she worked the breakfast buffet many mornings.  Between her and Bonnie, I just don't know how they always seem to make everything run so smoothly.  \n\nThere is another lady with short blonde hair (sorry, I can't seem to remember her name)  that always worked the socials.  She was so welcoming and learned what I like to eat and drink.  She even encouraged me to take food \"to-go\"  when I needed to rush back to the hospital.  It was like being with family.\n\nJan, Justin and Bobby are always a pleasure at the front desk.  Not only are they welcoming, but they go out their way to get answers to your questions and take care of any requests.  \n\nMy final comments are definitely not the least important.  During my stay, I noticed that there was a team of about three housekeeping staff members who appeared to have cognitive/mental disabilities.  I was so pleased to see this and know that this hotel and the manager recognize the need to utilize talents that are so often overlooked. There may have been moments of inconvenience for the guests or perhaps mistakes made by these staff members.  However, this is how they learn and become an integral part of society.  I commend Brad Cook for making diversity a priority.\n\nUntil my next stay...", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2013-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TMjZKlOpwoctRmZYdVzr8A", "review_id": "nVnl4ZlHWGKgyxtu_tA7gQ", "text": "Location, location, location.  Great place in downtown Middleton.  Close to all of the places you just need to visit, such as the Mustard Museum (yes, you need to go there), Hubbard St. Diner (try the pies or the carrot cake), and definitely go to the live band at the Capital Brewery a block away on Friday night.  Fantastic place to walk and just enjoy the ambiance of a great little town.  Oh, and free breakfast, free food and drinks on Tues-Thurs, free morning newspapers and spacious suites are all wonderful.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLo_MqJ98pc8ImS8CPb-4Q", "review_id": "2TL6X5Aftp6xpKuCj9O_zQ", "text": "I came to Madison and tried out this club.  VERY  NICE for the individual price.  A warm pool, lap pool, two hot tubs, cardio/weight room upstairs, weight room downstairs, raquetball courts, you name it.  Had a great workout, and and an awesome protein shake at their smoothy bar on my way out!  Really nice staff too!", "business_id": "x7xS2DJvu8klyNzcpN8QHg", "stars": 5, "date": "2011-02-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zxRhpU-ATbWKcDLEsFfT0A", "review_id": "c4d4cuzbiWdDPWvP3OETBQ", "text": "Harbor Athletic Club is great.  We use it all the time - swimming classes for the boys and yoga, pilates, and cardio classes for my wife.  No classes for me, but I still enjoy the club.\n\nMembership dues are right in line with other major clubs in the area.\n\nHighly recommended!", "business_id": "x7xS2DJvu8klyNzcpN8QHg", "stars": 5, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gxloYXYIO3E64yTr5RXt9w", "review_id": "ObWcWsSDYB0BnYldwHxURQ", "text": "Look, I love this place and I don't want you to join. It's the antithesis of the meat market known as Princeton club. \n\nSadly, smoothie bar/cafe is gone. \n\nHarbor is a really laid back health club that has everything that I need and more. The only downfalls are that it's super old and kind of put together like a corn maze.\n\n8 years and counting!", "business_id": "x7xS2DJvu8klyNzcpN8QHg", "stars": 5, "date": "2012-12-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4o9WPIHKZigkAD9r0BzNQg", "review_id": "y0WheVk1dsXWzJxK_SevBA", "text": "Member here for 10 years total--  I love clean! I love being able to walk away from noisy kids and go into another pool since i am a swimmer I like choices. Cool people -- members keep to themselves dont try to interfere with your workout with chit chat  I LOVE THIS !! We are busy working out no talking needed ! Great classes!  Great equipment and you can use other clubs too with their membership win win \nBut umm yeah don't join K? It is hard enough to find parking as it is !\n\nI went astray for a bit I will admit tried the Princeton Club to see what I was missing out on all the hoopla. What I found was old band aides that did not seem to move for days left around the pool and inches of standing water where you are supposed to wring out your suit NASTY !!\n\nI found my way back and like the Prodigal son who returns home after making mistakes I am back and I am happy!!", "business_id": "x7xS2DJvu8klyNzcpN8QHg", "stars": 5, "date": "2013-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_tGp650EdGkIZHwKs2aY6g", "review_id": "BJUsfbI2ISmnCzG1q6ZZ0w", "text": "This is a well-run club that has seemingly unlimited choices for its members at a very reasonable price. The strength and cardio equipment is modern and always in working condition, and you rarely if ever have to wait for anything. The group fitness options are plentiful and the instructors are engaged and motivating. I don't partake, but there are a ton of yoga, Pilates and Barre offerings in the wellness center across the parking lot from the main facility. The pool areas are clean and well-maintained, and the water in the pools is kept at a comfortable temperature. I've worked out a Harbor for a year now. The club has the appearance of a facility that has expanded multiple times as best it can given the architecture of the building and the space available. It's not easy to navigate as there are many separate rooms, but the staff is friendly and helpful and it's easy enough to figure things out once you get the hang of the layout. I wouldn't mind an update of the facility, but not at the expense of higher prices. It's clean and friendly and doesn't lack options and to me, that's most important.", "business_id": "x7xS2DJvu8klyNzcpN8QHg", "stars": 4, "date": "2013-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ot-QjYpIdVsluuxcqidjkA", "review_id": "pN3yjpKxfEkwY5a38sTs-A", "text": "Somehow amid 18 credits both semesters of my senior year, I also managed to find time to do a whole lotta scrapbooking.  And this place pretty much carries everything and anything you need.  Printed papers, solid papers, pens and markers and pencils, stickers, die-cuts, acid-free adhesives, scissors, punches, and a great selection of albums.  I think they have classes, too, but being the *expert* scrapbooker I am (brushes hair off shoulder), I never checked those out though I'm sure they're a lot of fun.  Their workroom is well-stocked, and (*nerd alert!*) it is really fun & satisfying to lock yourself in a space like that with all the necessary tools and make an entire scrapbook in an evening or afternoon.\n\nMiddleton is really close to Madison/the UW Campus and convenient to get to.  The store is spacious and well laid-out; really, a photo-fanatic's dream!", "business_id": "cgCqxPhadIAlsqnD1MoWuQ", "stars": 5, "date": "2006-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "C2TgNDrsWwRnM_79A50npg", "text": "Pricey, but plentiful. Since all the local independent scrapbook stores in the Madison area are now gone this is really the only option for good scrapbook supplies (apart from the small amounts at places like JoAnn's or Michaels) and they have most things you would need. \n\nRecently, I've been in a few times to use their workroom. It's free of charge Sun - Thu and you can have access to their tools and such. The chairs are very comfortable too. \n\nVery friendly staff, though they sometimes get a bit too chatty and aren't anywhere near the register when you need them. If I could improve Archiver's, it would be to have a more attentive staff in regards to sales and more reasonable prices (for a large chain, they have prices on many things that are higher than small stores - bizarre).", "business_id": "cgCqxPhadIAlsqnD1MoWuQ", "stars": 4, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "LQWlBt00QZrvn7McdS_Z_g", "review_id": "90r6tHSlJG08hq3Jm5Ifig", "text": "I make jewelry...for myself and for others. I am always looking for a great deal on the finest beads and findings. \n\nMy first visit to this Michael's came on the day after Thanksgiving. Hell? No really. After elbowing through a few rows of ladies, I reached a mongo wall of strings of beads. Heaven!\n\nThey have the best selection I have seen, really, anywhere. There are always coupons to be found...on their website, in the Sunday newspaper, on your door step, or sign up to get them delivered to your mailbox. It makes a major difference on your wallet. \n\nNow that's what I call a finding!", "business_id": "YDUB7-NgjKEFn8CERLoKXQ", "stars": 4, "date": "2009-12-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LFsJK5nPekuVciOQ83Niiw", "review_id": "2nQEl0Qb1GCbp0xNmMM3kg", "text": "Friendly staff...tons of great ideas and products!  I came here after a disappointing experience at Archivers in the same mall.  From now on, I'll happily come here instead!", "business_id": "YDUB7-NgjKEFn8CERLoKXQ", "stars": 5, "date": "2012-02-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "qNYvQI1IwPuob8Le_9ym5Q", "text": "I differ on the previous review on Greenway Station. I wouldn't take the time to go to a traditional mall. First you have to park and then find the store you want to go to. This has wasted 45 minutes of my life. I guess if I had time to loiter and wander about I would share your view. Malls are dieing across the country and life style centers are the future. In and out quickly.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 4, "date": "2009-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "0Qel5LOSU6Of9rWt5N_qKg", "text": "I find the Greenway Station Shopping Center to be a nice retreat from the Towne Malls where I often feel claustrophobic breathing in recycled air, dodging oncoming traffic, and avoiding all the kiosk vendors...blech! Conversely, Greenway is never over-crowded, parking is easy to find, and during the spring/summer seasons you can get your daily dose of vitamin D while you shop.\n\nThe selection of shops is much smaller, yes, but the Center also houses the higher-end, but still commercial, boutiques that you can't find elsewhere in Madison (e.g. White House Black Market - one of my favorite boutique shops from back home). \n\nSolo shopping at Greenway is definitely one of my favorite ways to spend a sunny Sunday afternoon. :)", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 4, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "PeKAIOslEcZjMCUMum3Nxg", "text": "I have mixed emotions.  I love coming here because it has locations of store that I can not find in other malls in the Madison area.  However, the parking lot situation drives me crazy.  I am not sure what they were trying to do but it is annoying.  Some days I find it impractical to walk the entire length of the area.  However, parking is just as frustrating.  Between the winding roads and entrances of restaurants, I feel like it is only a matter of time before I accidentally hit a patron.  \n\nAdmittedly, this is not just a problem for their venue.  So please take that with a grain of salt.  Otherwise, I appreciate their wide range of stores from little box (like Michael's) to the Loft.  I also enjoy that the Irish pub and Cheeseburger in Paradise are set a little ways away.  This allows them to be open air restaurants without dealing with the mall congestion.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 4, "date": "2014-02-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sdk6OOrj9nZ8z6Ob0jcpDw", "review_id": "38NJNnXPRblxZMCCttALKQ", "text": "The whole chain of Barriques around the Madison area are wonderful.  This one boasts a fireplace that my friend and I spent hours in front of trying to stay warm last weekend.  The staff was friendly and the atmosphere is cozy.  The extensive wine and liquor collection made me almost salivate. 5 stars.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 5, "date": "2006-01-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jgDdaSrlmpCnG3fY__qfUg", "review_id": "roqrXWz2AkO7zD7cAJzJ8A", "text": "i agree with kelly. the staff is really knowledgeable about their wines and i love the variety. the atmosphere is excellent. depending on when you go, you can get good baristas or not-so-good baristas. but when you get a good one, the whole place is absolutely fabulous.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 5, "date": "2006-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hTYXeRD6IZoSb2aYoeEOIg", "review_id": "adECeHUgc1kKpYMYmDgCNA", "text": "I love almost everything about the Middleton location. Big tables to study at or meet friends, great selection of wine and beer, free internet access and busy enough to not feel strange but slow enough that you can almost always get a seat. Also their wine tasting is a lot of fun and interesting when I want to play adult for a night. The only downfall is that the service can tend to be somewhat indifferent to you standing behind the counter. Overall a great place.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2006-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y-nr6eaHwP3HF1jV4JKDJw", "review_id": "4O93Ljg7jCvobaxe70Cxmg", "text": "Although this might not be my favorite Barriques location, it IS closest to me. Still has the great Alterra coffee, but I'm just not sure about the atmosphere. Not that there's anything horrible to report, but it's just not the most relaxing location. Easy to get in and out of, which is a plus.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2008-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nd_ocknNVYaa1Sqy9V9PXA", "review_id": "spmdYML9ABT8K62q7gDDpQ", "text": "I'm going to say that I like it better here than the downtown Madison location for a very simple reason: Seating. It's also a great option to have when stuck out in Middleton for the holidays. This place helps that little Middleton stay classy and it helps me stay sane when I make my annual return to the west side.\n\nOtherwise, I'm staying in Madison for my coffees.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2011-01-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rO3EJK-Bka_eRF9_oJ1nZA", "review_id": "Noj_gbMvlAxnUnXnYgTPeg", "text": "I love the concept of a coffee shop/wine & beer store in one. The tea selection was nice & the atmosphere quaint. The lattes were better than Starbucks (but really- is that saying much?)", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2011-01-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Au8zxtMKpouKEfG0GnXo-A", "review_id": "Yskk1fgYgTeCQyz-Z7h0OA", "text": "I was intrigued when I heard that there was a place that combined a liquor store with a coffee shop. I don't know that the 2 necessarily compliment each other... In fact, the counters for both have their backs to each other.\n\nIn any event, they have a good selection that is fun to browse through, and they make a decent cup of coffee.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 3, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "9BVkMf7qbs8SNuNfsR6yoQ", "review_id": "GpO_NpiRKLz0WdrJZsxy0g", "text": "This review is for one thing only: iced coffee.\n\nI travel a lot for work and try to seek out a local coffee shop to get my iced coffee fix. Normally, I'm disappointed...not so with Barriques.  The iced coffee (listed as cold brewed for 12 hours) is delicious.  Dark and strong just as I prefer.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 5, "date": "2012-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vXdhpf3yihFoqn2i4SNF_Q", "review_id": "JqauWBDAKVEuHaYm9bEnSA", "text": "Great place to chill...  always quiet and can get lots of work done...", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "fGj9G7a2FmCAnebWRRf5JQ", "text": "Pretty stoked that although salads are pre-made these guys dug out ingredients and made me one from scratch sans dairy. Mucho appreciated!", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 4}, "user_id": "L-cexm4-3KDqtL6kGfjzBA", "review_id": "4artGUDQo3TpHywxefQy5A", "text": "Tips for meeting at Barriques on University Ave/ Cayuga Court:\nA. Make sure your friend is meeting you at this one and not the Barriques on Old Sauk.\nB. Parking can be tricky, but they have spots in the front, back and on the street.\nC. Grab a spot near the fireplace in the winter.  Can be a bit breezy in there.\nD. Perhaps get a fortified coffee drink, (as in with some special ingrediants) Daddy Grasshopper, Irish Coffee, etc... they make them up right.\nE. If you have to pass D. there are still plenty of good options for coffee & tea drinkers.\nF. Not as many food options at this location but they do have cookies, scones, bagels, etc..\nG. Plan on getting some good people watching in.  Turns from business crowd, to mama yoga crowd, back to business to the student crowd during the day.  Take your pick.\nH. Hard not to pick up a bottle of booze to take home with you.  Lots of good local options or plenty others.\nI. And if you checked in with Yelp, you'd notice it's 20 % off whole bean coffee. YES\nREPEAT!\nRepeat!\nREPEAT!", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2014-01-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kfbs-uNuaLDVxhb0J7vUSQ", "review_id": "Zqp0_BdCvCNChWShb0ztFA", "text": "Nice overall atmosphere, the fireplace and comfy chairs are very inviting. Coffee is always good and the Cowboy cookie is a round slice of ambrosia.  Huge wine selection and wine accessories are also a draw.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 4, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DTX9svy1v-Jw9013pnYuwQ", "review_id": "rMDj0NaAc9bgy8FyjHrZMQ", "text": "Any place that serves both caffeine and alcohol, then gives you access to reliable wifi and leaves you alone for five hours is good in my book.", "business_id": "1-EIdeHewfEVcpoZm38N8A", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hJbhbqg-x3TFzhvqqwl5RA", "review_id": "_Ev8oZvNjOeZLpWlu66QDg", "text": "The china wok buffet is the best Chinese buffet I've ever been too! I only give it a 4 instead of a 5 because if i find something better(very unlikely) i won't be able to rate it as such. This buffet has everything you could want from Chinese food. It has a delicious array of chicken's, pork, and seafood. My personal fav's are the Tso's, peppered chicken, crab cheese bake, deep fried shrimp, and the baked salmon. Their crab Rangoon, egg rolls, and soup are fair. Finally their desert. Unlike most Chinese buffets I've been to this one buckets of ice cream. You serve yourself but you get a decent assortment of Mint Chocolate chip, strawberry, butter pecan, and birthday cake. If your ever in the mood to over indulge on food at a really good price. I definitely recommend going here.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 4, "date": "2008-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e5zoBfeNPYGeVV8QdeRTCQ", "review_id": "EU4fGVH-ppiifpRTHCJ9Gw", "text": "I typically hate and do not recommend Chinese buffets, but this is totally the exception. I have been going to this buffet for a few years now, and it is great every time.  They don't overstock the buffet, so they keep the items fresh all the time.  From the soups, to apps to the main dishes, is very good food.  Remember, its Chinese, so stay away from the sushi, its not up to par with the rest of the buffet.  Finally, there is ice cream kind of hidden in the back.   Put a scoop or two on top of a hot doughunt or two and you will finish in heaven.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 4, "date": "2011-02-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_CjHZLHzNaKIFFIAcZFuw", "review_id": "7PTZqbWx8_bkFrr0WMSFIA", "text": "this place is great for what it is.  i've never been disappointed - even after the lunch rush is over the food is kept fresh and rotated.  i can't speak for dinner, but lunch is as good as chinese buffets get in the madison/middleton locale.  jade garden is good if they are busy, but they let the food go to pot when they slow down a little.", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 4, "date": "2013-02-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rXiiwnbL7bbmrLpLwL4RtA", "review_id": "gjNaZiIbS2agP609KMi-lg", "text": "I live close by and stop in periodically and have not had any issues with food or service.  I have left full and happy every time.  \n\nHot food...all the sushi you can eat!\n\nKeep up the good work!", "business_id": "MKsb2VpLB-0UBODcInDsSw", "stars": 3, "date": "2013-05-14", "type": "review"}
