{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zvJCcrpm2yOZrxKffwGQLA", "review_id": "-TsVN230RCkLYKBeLsuz7A", "stars": 4, "date": "2012-02-14", "text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "stars": 4, "date": "2012-03-02", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MDiCwtVo-Aq9cD5bAKd8Lw", "review_id": "Vqkv071v8vLA2ux8aOeICQ", "stars": 5, "date": "2012-03-12", "text": "hands down one of the best breakfasts my wife and i have had. stopped in here based on the positive reviews from fellow yelpers and was sure glad i did. \n\nthis is a good sized diner at a truck stop. the first thing that caught our eye was the pastries - they were all huge and all looked great. tip - be sure to save space for at least one. \n\ni went with the cinnamon roll french toast and was very pleased. very large portion and great taste - go witht the sausage patty over the links. people behind us had links on their plate and they didnt look too appetzing. the patty was good. \n\nwife went with a chicken friend steak, eggs, and hashbrowns. hashbrowns left a bit to desire but they get bonus points for being real potatoes and fresh. \n\noverall, great experience and we were in and out in 35 mins so we could continue out journey. looking forward to stopping here again sometime soon.", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bld8sdbL48rJzVXo4yMYWA", "review_id": "kAFG3i8DsfTkJePPEMc9Ig", "stars": 5, "date": "2013-05-07", "text": "Don't be fooled because it's in a truck stop, truckers know where there are good places to eat. Stop here just for the desserts, I bought an eclair that must have weighed a pound, delicious, like they are supposed to be made. Cream Puffs look like they wouldn't fit in a one pound coffee can... grin. Don't miss this place...", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LVW_8tSvxMgIOaTeOvtteA", "review_id": "-pKx6W2dN6xCFA8ZIe-sOQ", "stars": 4, "date": "2010-10-06", "text": "We ate there several weeks back so the details are a bit thin, but I do recall that the service was good and we enjoyed the burger, club sandwich, and ham and cheese our group had.  Its exactly what you'd expect for a good supper club.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uu5qlI41K1g30bZpNhgRKg", "review_id": "9eglfNPoaJVjBIsTpExTdw", "stars": 4, "date": "2010-11-27", "text": "Under ordinary circumstances I'm not a breakfast person.  However, the morning after Thanksgiving, it was obviously time to consume more food, so off to the Green Lantern we went.  And a good thing too...I had the best breakfast I have eaten in recent memory, and left totally impressed (and full).\n\nBreakfast foods are simple foods.  Many places take advantage of the simplicity by rushing things along.  You end up with edible but uninspired eats.  Though my breakfast arrived shortly after it was ordered, it was cooked properly and with care.  My sunny side up eggs were perfectly done, the whites well set and the yolks warm but properly runny.  The four (!) large slices of bacon were thick and flavorful.  I ordered the hash-browns crispy, and that's how they came.  Everything on the plate was cooked just right and tasted super good.  I could almost like eating breakfast out, if every place served breakfast like this.\n\nService was fast and friendly.  Coffee was the usual diner style, weak and plentiful.  The bar looked capable of producing a solid bloody mary, but alas this went untested.  Prices were as cheap as the day is long.  I'm docking a star for the corn beef hash--it lacked flavor and that all important crunch.  All the same, I still highly recommend the Lantern for your breakfast needs.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
